// This file is AUTO-GENERATED by src/architecture/rust/gen_rust_messages.py.
// DO NOT EDIT BY HAND.
//
// Re-run `python3 src/architecture/rust/gen_rust_messages.py` after message payload
// definitions change to keep these bindings in sync.
//
// Crate: bsk-messages
// Source: Basilisk's generated cMsgCInterface headers

#![allow(non_snake_case, non_camel_case_types, non_upper_case_globals, dead_code, clippy::all)]

pub use bsk_build::{
    BskLoggerExt, BskModule, BskModuleRuntime, Msg, MsgReader, MsgWriter, BSKLogger, BSK_DEBUG,
    BSK_ERROR, BSK_INFORMATION, BSK_SILENT, BSK_WARNING,
};

/* automatically generated by rust-bindgen 0.72.1 */

#[doc = " @brief Structure used to define accelerometer package data"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AccPktDataMsg {
    #[doc = "!< [Tick] Measurement time for accel"]
    pub measTime: u64,
    #[doc = "!< [r/s] Angular rate measurement from gyro"]
    pub gyro_B: [f64; 3usize],
    #[doc = "!< [m/s2] Acceleration in platform frame"]
    pub accel_B: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AccPktDataMsg"][::core::mem::size_of::<AccPktDataMsg>() - 56usize];
    ["Alignment of AccPktDataMsg"][::core::mem::align_of::<AccPktDataMsg>() - 8usize];
    ["Offset of field: AccPktDataMsg::measTime"]
        [::core::mem::offset_of!(AccPktDataMsg, measTime) - 0usize];
    ["Offset of field: AccPktDataMsg::gyro_B"]
        [::core::mem::offset_of!(AccPktDataMsg, gyro_B) - 8usize];
    ["Offset of field: AccPktDataMsg::accel_B"]
        [::core::mem::offset_of!(AccPktDataMsg, accel_B) - 32usize];
};
#[doc = " @brief Structure used to define accelerometer package data"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AccDataMsg {
    #[doc = "!< [-] Accelerometer buffer read in"]
    pub accPkts: [AccPktDataMsg; 120usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AccDataMsg"][::core::mem::size_of::<AccDataMsg>() - 6720usize];
    ["Alignment of AccDataMsg"][::core::mem::align_of::<AccDataMsg>() - 8usize];
    ["Offset of field: AccDataMsg::accPkts"]
        [::core::mem::offset_of!(AccDataMsg, accPkts) - 0usize];
};
impl Default for AccDataMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief message system 2 header information structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MsgHeader {
    #[doc = "!< flag if the message has is connected to another message"]
    pub isLinked: i64,
    #[doc = "!< flag if the message conntent has ever been written"]
    pub isWritten: i64,
    #[doc = "!< [ns] time the message was written"]
    pub timeWritten: u64,
    #[doc = "!< ID of the module who wrote the message, negative value for Python module, non-negative for C/C++ modules"]
    pub moduleID: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MsgHeader"][::core::mem::size_of::<MsgHeader>() - 32usize];
    ["Alignment of MsgHeader"][::core::mem::align_of::<MsgHeader>() - 8usize];
    ["Offset of field: MsgHeader::isLinked"][::core::mem::offset_of!(MsgHeader, isLinked) - 0usize];
    ["Offset of field: MsgHeader::isWritten"]
        [::core::mem::offset_of!(MsgHeader, isWritten) - 8usize];
    ["Offset of field: MsgHeader::timeWritten"]
        [::core::mem::offset_of!(MsgHeader, timeWritten) - 16usize];
    ["Offset of field: MsgHeader::moduleID"]
        [::core::mem::offset_of!(MsgHeader, moduleID) - 24usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AccDataMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AccDataMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AccDataMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AccDataMsg_C"][::core::mem::size_of::<AccDataMsg_C>() - 6768usize];
    ["Alignment of AccDataMsg_C"][::core::mem::align_of::<AccDataMsg_C>() - 8usize];
    ["Offset of field: AccDataMsg_C::header"]
        [::core::mem::offset_of!(AccDataMsg_C, header) - 0usize];
    ["Offset of field: AccDataMsg_C::data"]
        [::core::mem::offset_of!(AccDataMsg_C, data) - 32usize];
    ["Offset of field: AccDataMsg_C::dataPointer"]
        [::core::mem::offset_of!(AccDataMsg_C, dataPointer) - 6752usize];
    ["Offset of field: AccDataMsg_C::headerPointer"]
        [::core::mem::offset_of!(AccDataMsg_C, headerPointer) - 6760usize];
};
impl Default for AccDataMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AccPktDataMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AccPktDataMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AccPktDataMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AccPktDataMsg_C"][::core::mem::size_of::<AccPktDataMsg_C>() - 104usize];
    ["Alignment of AccPktDataMsg_C"][::core::mem::align_of::<AccPktDataMsg_C>() - 8usize];
    ["Offset of field: AccPktDataMsg_C::header"]
        [::core::mem::offset_of!(AccPktDataMsg_C, header) - 0usize];
    ["Offset of field: AccPktDataMsg_C::data"]
        [::core::mem::offset_of!(AccPktDataMsg_C, data) - 32usize];
    ["Offset of field: AccPktDataMsg_C::dataPointer"]
        [::core::mem::offset_of!(AccPktDataMsg_C, dataPointer) - 88usize];
    ["Offset of field: AccPktDataMsg_C::headerPointer"]
        [::core::mem::offset_of!(AccPktDataMsg_C, headerPointer) - 96usize];
};
impl Default for AccPktDataMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message that defines access to spacecraft from a groundLocation, providing access, range, and elevation with\n respect to a ground location."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AccessMsg {
    #[doc = "!< [-] 1 when the writer has access to a spacecraft; 0 otherwise."]
    pub hasAccess: u64,
    #[doc = "!< [m] Range from a location to the spacecraft."]
    pub slantRange: f64,
    #[doc = "!< [rad] Elevation angle for a given spacecraft."]
    pub elevation: f64,
    #[doc = "!< [rad] Azimuth angle for a spacecraft."]
    pub azimuth: f64,
    #[doc = "!< [m/s] Range rate of a given spacecraft relative to a location in the SEZ rotating frame."]
    pub range_dot: f64,
    #[doc = "!< [rad/s] Elevation angle rate for a given spacecraft in the SEZ rotating frame."]
    pub el_dot: f64,
    #[doc = "!< [rad/s] Azimuth angle rate for a given spacecraft in the SEZ rotating frame."]
    pub az_dot: f64,
    #[doc = "!<[m] Spacecraft position relative to the groundLocation in the SEZ frame."]
    pub r_BL_L: [f64; 3usize],
    #[doc = "!<[m/s] SEZ relative time derivative of r_BL vector in SEZ vector components."]
    pub v_BL_L: [f64; 3usize],
    #[doc = "!< [-] 1 when illumination constraints are met; 0 otherwise."]
    pub hasIllumination: u64,
    #[doc = "!<[rad] Angle between bore-sight and Sun vector"]
    pub sunIncidenceAngle: f64,
    #[doc = "!<[rad] Angle between bore-sight and deputy SC vector"]
    pub scViewAngle: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AccessMsg"][::core::mem::size_of::<AccessMsg>() - 128usize];
    ["Alignment of AccessMsg"][::core::mem::align_of::<AccessMsg>() - 8usize];
    ["Offset of field: AccessMsg::hasAccess"]
        [::core::mem::offset_of!(AccessMsg, hasAccess) - 0usize];
    ["Offset of field: AccessMsg::slantRange"]
        [::core::mem::offset_of!(AccessMsg, slantRange) - 8usize];
    ["Offset of field: AccessMsg::elevation"]
        [::core::mem::offset_of!(AccessMsg, elevation) - 16usize];
    ["Offset of field: AccessMsg::azimuth"]
        [::core::mem::offset_of!(AccessMsg, azimuth) - 24usize];
    ["Offset of field: AccessMsg::range_dot"]
        [::core::mem::offset_of!(AccessMsg, range_dot) - 32usize];
    ["Offset of field: AccessMsg::el_dot"]
        [::core::mem::offset_of!(AccessMsg, el_dot) - 40usize];
    ["Offset of field: AccessMsg::az_dot"]
        [::core::mem::offset_of!(AccessMsg, az_dot) - 48usize];
    ["Offset of field: AccessMsg::r_BL_L"]
        [::core::mem::offset_of!(AccessMsg, r_BL_L) - 56usize];
    ["Offset of field: AccessMsg::v_BL_L"]
        [::core::mem::offset_of!(AccessMsg, v_BL_L) - 80usize];
    ["Offset of field: AccessMsg::hasIllumination"]
        [::core::mem::offset_of!(AccessMsg, hasIllumination) - 104usize];
    ["Offset of field: AccessMsg::sunIncidenceAngle"]
        [::core::mem::offset_of!(AccessMsg, sunIncidenceAngle) - 112usize];
    ["Offset of field: AccessMsg::scViewAngle"]
        [::core::mem::offset_of!(AccessMsg, scViewAngle) - 120usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AccessMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AccessMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AccessMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AccessMsg_C"][::core::mem::size_of::<AccessMsg_C>() - 176usize];
    ["Alignment of AccessMsg_C"][::core::mem::align_of::<AccessMsg_C>() - 8usize];
    ["Offset of field: AccessMsg_C::header"][::core::mem::offset_of!(AccessMsg_C, header) - 0usize];
    ["Offset of field: AccessMsg_C::data"]
        [::core::mem::offset_of!(AccessMsg_C, data) - 32usize];
    ["Offset of field: AccessMsg_C::dataPointer"]
        [::core::mem::offset_of!(AccessMsg_C, dataPointer) - 160usize];
    ["Offset of field: AccessMsg_C::headerPointer"]
        [::core::mem::offset_of!(AccessMsg_C, headerPointer) - 168usize];
};
impl Default for AccessMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " albedo message definition"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AlbedoMsg {
    #[doc = "!< [-] Max albedo flux ratio at instrument"]
    pub albedoAtInstrumentMax: f64,
    #[doc = "!< [W/m^2] Max albedo flux at instrument"]
    pub AfluxAtInstrumentMax: f64,
    #[doc = "!< [-] Albedo flux ratio at instrument"]
    pub albedoAtInstrument: f64,
    #[doc = "!< [W/m^2] Albedo flux at instrument"]
    pub AfluxAtInstrument: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlbedoMsg"][::core::mem::size_of::<AlbedoMsg>() - 32usize];
    ["Alignment of AlbedoMsg"][::core::mem::align_of::<AlbedoMsg>() - 8usize];
    ["Offset of field: AlbedoMsg::albedoAtInstrumentMax"]
        [::core::mem::offset_of!(AlbedoMsg, albedoAtInstrumentMax) - 0usize];
    ["Offset of field: AlbedoMsg::AfluxAtInstrumentMax"]
        [::core::mem::offset_of!(AlbedoMsg, AfluxAtInstrumentMax) - 8usize];
    ["Offset of field: AlbedoMsg::albedoAtInstrument"]
        [::core::mem::offset_of!(AlbedoMsg, albedoAtInstrument) - 16usize];
    ["Offset of field: AlbedoMsg::AfluxAtInstrument"]
        [::core::mem::offset_of!(AlbedoMsg, AfluxAtInstrument) - 24usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AlbedoMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AlbedoMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AlbedoMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AlbedoMsg_C"][::core::mem::size_of::<AlbedoMsg_C>() - 80usize];
    ["Alignment of AlbedoMsg_C"][::core::mem::align_of::<AlbedoMsg_C>() - 8usize];
    ["Offset of field: AlbedoMsg_C::header"][::core::mem::offset_of!(AlbedoMsg_C, header) - 0usize];
    ["Offset of field: AlbedoMsg_C::data"]
        [::core::mem::offset_of!(AlbedoMsg_C, data) - 32usize];
    ["Offset of field: AlbedoMsg_C::dataPointer"]
        [::core::mem::offset_of!(AlbedoMsg_C, dataPointer) - 64usize];
    ["Offset of field: AlbedoMsg_C::headerPointer"]
        [::core::mem::offset_of!(AlbedoMsg_C, headerPointer) - 72usize];
};
impl Default for AlbedoMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " antenna state message definition"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AntennaLogMsg {
    #[doc = "!< [-]     Antenna Name"]
    pub antennaName: [::core::ffi::c_char; 20usize],
    #[doc = "!< [-]     Environment around the antenna (0: space, 1: earth, -1: unknown)"]
    pub environment: u32,
    #[doc = "!< [-]     Current state of the antenna (0: off, 1: Rx, 2: Tx, 3: RxTx)"]
    pub antennaState: u32,
    #[doc = "!< [Hz]    Operating frequency of the antenna"]
    pub frequency: f64,
    #[doc = "!< [Hz]    Frequency bandwidth of the antenna"]
    pub B: f64,
    #[doc = "!< [rad]   Half-power beamwidth in azimuth"]
    pub HPBW_az: f64,
    #[doc = "!< [rad]   Half-power beamwidth in elevation"]
    pub HPBW_el: f64,
    #[doc = "!< [W]     Transmit power"]
    pub P_Tx: f64,
    #[doc = "!< [W]     Receive power"]
    pub P_Rx: f64,
    #[doc = "!< [dB]    Antenna directivity in decibels"]
    pub DdB: f64,
    #[doc = "!< [-]     Antenna radiation efficiency"]
    pub eta_r: f64,
    #[doc = "!< [W]     Noise power at the receiver"]
    pub P_N: f64,
    #[doc = "!< [W]     EIRP power transmitted"]
    pub P_eirp_dB: f64,
    #[doc = "!< [dB/K]  Antenna gain over system noise temperature"]
    pub G_TN: f64,
    #[doc = "!< [K]     Ambient temperature around the antenna"]
    pub T_Ambient: f64,
    #[doc = "!< [m]     Position vector {N} -> {A} of the antenna, decomposed in {N} frame"]
    pub r_AN_N: [f64; 3usize],
    #[doc = "!< [-]     MRP attitude of antenna relative to inertial frame {N}"]
    pub sigma_AN: [f64; 3usize],
    #[doc = "!< [m/s]   Velocity vector from antenna to ground station in inertial frame {N}"]
    pub v_AN_N: [f64; 3usize],
    #[doc = "!< [-]     Position vector of the antenna wrt to the celestial body frame {P} decomposed in {N} (used for ground antennas only)"]
    pub r_AP_N: [f64; 3usize],
    #[doc = "!< [-]     Position vector of the antenna wrt to the celestial body frame {P} decomposed in {P} (used for ground antennas only)"]
    pub r_AP_P: [f64; 3usize],
    #[doc = "!< [-]     Surface normal vector from the target location in inertial coordinates (used for ground antennas only)"]
    pub nHat_LP_N: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AntennaLogMsg"][::core::mem::size_of::<AntennaLogMsg>() - 272usize];
    ["Alignment of AntennaLogMsg"][::core::mem::align_of::<AntennaLogMsg>() - 8usize];
    ["Offset of field: AntennaLogMsg::antennaName"]
        [::core::mem::offset_of!(AntennaLogMsg, antennaName) - 0usize];
    ["Offset of field: AntennaLogMsg::environment"]
        [::core::mem::offset_of!(AntennaLogMsg, environment) - 20usize];
    ["Offset of field: AntennaLogMsg::antennaState"]
        [::core::mem::offset_of!(AntennaLogMsg, antennaState) - 24usize];
    ["Offset of field: AntennaLogMsg::frequency"]
        [::core::mem::offset_of!(AntennaLogMsg, frequency) - 32usize];
    ["Offset of field: AntennaLogMsg::B"]
        [::core::mem::offset_of!(AntennaLogMsg, B) - 40usize];
    ["Offset of field: AntennaLogMsg::HPBW_az"]
        [::core::mem::offset_of!(AntennaLogMsg, HPBW_az) - 48usize];
    ["Offset of field: AntennaLogMsg::HPBW_el"]
        [::core::mem::offset_of!(AntennaLogMsg, HPBW_el) - 56usize];
    ["Offset of field: AntennaLogMsg::P_Tx"]
        [::core::mem::offset_of!(AntennaLogMsg, P_Tx) - 64usize];
    ["Offset of field: AntennaLogMsg::P_Rx"]
        [::core::mem::offset_of!(AntennaLogMsg, P_Rx) - 72usize];
    ["Offset of field: AntennaLogMsg::DdB"]
        [::core::mem::offset_of!(AntennaLogMsg, DdB) - 80usize];
    ["Offset of field: AntennaLogMsg::eta_r"]
        [::core::mem::offset_of!(AntennaLogMsg, eta_r) - 88usize];
    ["Offset of field: AntennaLogMsg::P_N"]
        [::core::mem::offset_of!(AntennaLogMsg, P_N) - 96usize];
    ["Offset of field: AntennaLogMsg::P_eirp_dB"]
        [::core::mem::offset_of!(AntennaLogMsg, P_eirp_dB) - 104usize];
    ["Offset of field: AntennaLogMsg::G_TN"]
        [::core::mem::offset_of!(AntennaLogMsg, G_TN) - 112usize];
    ["Offset of field: AntennaLogMsg::T_Ambient"]
        [::core::mem::offset_of!(AntennaLogMsg, T_Ambient) - 120usize];
    ["Offset of field: AntennaLogMsg::r_AN_N"]
        [::core::mem::offset_of!(AntennaLogMsg, r_AN_N) - 128usize];
    ["Offset of field: AntennaLogMsg::sigma_AN"]
        [::core::mem::offset_of!(AntennaLogMsg, sigma_AN) - 152usize];
    ["Offset of field: AntennaLogMsg::v_AN_N"]
        [::core::mem::offset_of!(AntennaLogMsg, v_AN_N) - 176usize];
    ["Offset of field: AntennaLogMsg::r_AP_N"]
        [::core::mem::offset_of!(AntennaLogMsg, r_AP_N) - 200usize];
    ["Offset of field: AntennaLogMsg::r_AP_P"]
        [::core::mem::offset_of!(AntennaLogMsg, r_AP_P) - 224usize];
    ["Offset of field: AntennaLogMsg::nHat_LP_N"]
        [::core::mem::offset_of!(AntennaLogMsg, nHat_LP_N) - 248usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AntennaLogMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AntennaLogMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AntennaLogMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AntennaLogMsg_C"][::core::mem::size_of::<AntennaLogMsg_C>() - 320usize];
    ["Alignment of AntennaLogMsg_C"][::core::mem::align_of::<AntennaLogMsg_C>() - 8usize];
    ["Offset of field: AntennaLogMsg_C::header"]
        [::core::mem::offset_of!(AntennaLogMsg_C, header) - 0usize];
    ["Offset of field: AntennaLogMsg_C::data"]
        [::core::mem::offset_of!(AntennaLogMsg_C, data) - 32usize];
    ["Offset of field: AntennaLogMsg_C::dataPointer"]
        [::core::mem::offset_of!(AntennaLogMsg_C, dataPointer) - 304usize];
    ["Offset of field: AntennaLogMsg_C::headerPointer"]
        [::core::mem::offset_of!(AntennaLogMsg_C, headerPointer) - 312usize];
};
impl Default for AntennaLogMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Antenna state output message definition"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AntennaStateMsg {
    #[doc = "!< [-] antenna state: 0: OFF, 1: Rx, 2: Tx, 3: RxTx"]
    pub antennaState: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AntennaStateMsg"][::core::mem::size_of::<AntennaStateMsg>() - 4usize];
    ["Alignment of AntennaStateMsg"]
        [::core::mem::align_of::<AntennaStateMsg>() - 4usize];
    ["Offset of field: AntennaStateMsg::antennaState"]
        [::core::mem::offset_of!(AntennaStateMsg, antennaState) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AntennaStateMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AntennaStateMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AntennaStateMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AntennaStateMsg_C"][::core::mem::size_of::<AntennaStateMsg_C>() - 56usize];
    ["Alignment of AntennaStateMsg_C"][::core::mem::align_of::<AntennaStateMsg_C>() - 8usize];
    ["Offset of field: AntennaStateMsg_C::header"]
        [::core::mem::offset_of!(AntennaStateMsg_C, header) - 0usize];
    ["Offset of field: AntennaStateMsg_C::data"]
        [::core::mem::offset_of!(AntennaStateMsg_C, data) - 32usize];
    ["Offset of field: AntennaStateMsg_C::dataPointer"]
        [::core::mem::offset_of!(AntennaStateMsg_C, dataPointer) - 40usize];
    ["Offset of field: AntennaStateMsg_C::headerPointer"]
        [::core::mem::offset_of!(AntennaStateMsg_C, headerPointer) - 48usize];
};
impl Default for AntennaStateMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for vehicle effectors"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayEffectorLockMsg {
    #[doc = "!< effector lock flag; 0 : do not lock; 1 : lock"]
    pub effectorLockFlag: [::core::ffi::c_int; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayEffectorLockMsg"]
        [::core::mem::size_of::<ArrayEffectorLockMsg>() - 144usize];
    ["Alignment of ArrayEffectorLockMsg"]
        [::core::mem::align_of::<ArrayEffectorLockMsg>() - 4usize];
    ["Offset of field: ArrayEffectorLockMsg::effectorLockFlag"]
        [::core::mem::offset_of!(ArrayEffectorLockMsg, effectorLockFlag) - 0usize];
};
impl Default for ArrayEffectorLockMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayEffectorLockMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ArrayEffectorLockMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ArrayEffectorLockMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayEffectorLockMsg_C"][::core::mem::size_of::<ArrayEffectorLockMsg_C>() - 192usize];
    ["Alignment of ArrayEffectorLockMsg_C"]
        [::core::mem::align_of::<ArrayEffectorLockMsg_C>() - 8usize];
    ["Offset of field: ArrayEffectorLockMsg_C::header"]
        [::core::mem::offset_of!(ArrayEffectorLockMsg_C, header) - 0usize];
    ["Offset of field: ArrayEffectorLockMsg_C::data"]
        [::core::mem::offset_of!(ArrayEffectorLockMsg_C, data) - 32usize];
    ["Offset of field: ArrayEffectorLockMsg_C::dataPointer"]
        [::core::mem::offset_of!(ArrayEffectorLockMsg_C, dataPointer) - 176usize];
    ["Offset of field: ArrayEffectorLockMsg_C::headerPointer"]
        [::core::mem::offset_of!(ArrayEffectorLockMsg_C, headerPointer) - 184usize];
};
impl Default for ArrayEffectorLockMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for vehicle effectors"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayMotorForceMsg {
    #[doc = "!< [N]  motor force array"]
    pub motorForce: [f64; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayMotorForceMsg"]
        [::core::mem::size_of::<ArrayMotorForceMsg>() - 288usize];
    ["Alignment of ArrayMotorForceMsg"]
        [::core::mem::align_of::<ArrayMotorForceMsg>() - 8usize];
    ["Offset of field: ArrayMotorForceMsg::motorForce"]
        [::core::mem::offset_of!(ArrayMotorForceMsg, motorForce) - 0usize];
};
impl Default for ArrayMotorForceMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayMotorForceMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ArrayMotorForceMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ArrayMotorForceMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayMotorForceMsg_C"][::core::mem::size_of::<ArrayMotorForceMsg_C>() - 336usize];
    ["Alignment of ArrayMotorForceMsg_C"][::core::mem::align_of::<ArrayMotorForceMsg_C>() - 8usize];
    ["Offset of field: ArrayMotorForceMsg_C::header"]
        [::core::mem::offset_of!(ArrayMotorForceMsg_C, header) - 0usize];
    ["Offset of field: ArrayMotorForceMsg_C::data"]
        [::core::mem::offset_of!(ArrayMotorForceMsg_C, data) - 32usize];
    ["Offset of field: ArrayMotorForceMsg_C::dataPointer"]
        [::core::mem::offset_of!(ArrayMotorForceMsg_C, dataPointer) - 320usize];
    ["Offset of field: ArrayMotorForceMsg_C::headerPointer"]
        [::core::mem::offset_of!(ArrayMotorForceMsg_C, headerPointer) - 328usize];
};
impl Default for ArrayMotorForceMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for vehicle effectors"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayMotorTorqueMsg {
    #[doc = "!< [Nm]  motor torque array"]
    pub motorTorque: [f64; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayMotorTorqueMsg"]
        [::core::mem::size_of::<ArrayMotorTorqueMsg>() - 288usize];
    ["Alignment of ArrayMotorTorqueMsg"]
        [::core::mem::align_of::<ArrayMotorTorqueMsg>() - 8usize];
    ["Offset of field: ArrayMotorTorqueMsg::motorTorque"]
        [::core::mem::offset_of!(ArrayMotorTorqueMsg, motorTorque) - 0usize];
};
impl Default for ArrayMotorTorqueMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayMotorTorqueMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ArrayMotorTorqueMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ArrayMotorTorqueMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayMotorTorqueMsg_C"][::core::mem::size_of::<ArrayMotorTorqueMsg_C>() - 336usize];
    ["Alignment of ArrayMotorTorqueMsg_C"]
        [::core::mem::align_of::<ArrayMotorTorqueMsg_C>() - 8usize];
    ["Offset of field: ArrayMotorTorqueMsg_C::header"]
        [::core::mem::offset_of!(ArrayMotorTorqueMsg_C, header) - 0usize];
    ["Offset of field: ArrayMotorTorqueMsg_C::data"]
        [::core::mem::offset_of!(ArrayMotorTorqueMsg_C, data) - 32usize];
    ["Offset of field: ArrayMotorTorqueMsg_C::dataPointer"]
        [::core::mem::offset_of!(ArrayMotorTorqueMsg_C, dataPointer) - 320usize];
    ["Offset of field: ArrayMotorTorqueMsg_C::headerPointer"]
        [::core::mem::offset_of!(ArrayMotorTorqueMsg_C, headerPointer) - 328usize];
};
impl Default for ArrayMotorTorqueMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the message format of the motor voltage input"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayMotorVoltageMsg {
    #[doc = "!< [V]     Motor voltage input value"]
    pub voltage: [f64; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayMotorVoltageMsg"]
        [::core::mem::size_of::<ArrayMotorVoltageMsg>() - 288usize];
    ["Alignment of ArrayMotorVoltageMsg"]
        [::core::mem::align_of::<ArrayMotorVoltageMsg>() - 8usize];
    ["Offset of field: ArrayMotorVoltageMsg::voltage"]
        [::core::mem::offset_of!(ArrayMotorVoltageMsg, voltage) - 0usize];
};
impl Default for ArrayMotorVoltageMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArrayMotorVoltageMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ArrayMotorVoltageMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ArrayMotorVoltageMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ArrayMotorVoltageMsg_C"][::core::mem::size_of::<ArrayMotorVoltageMsg_C>() - 336usize];
    ["Alignment of ArrayMotorVoltageMsg_C"]
        [::core::mem::align_of::<ArrayMotorVoltageMsg_C>() - 8usize];
    ["Offset of field: ArrayMotorVoltageMsg_C::header"]
        [::core::mem::offset_of!(ArrayMotorVoltageMsg_C, header) - 0usize];
    ["Offset of field: ArrayMotorVoltageMsg_C::data"]
        [::core::mem::offset_of!(ArrayMotorVoltageMsg_C, data) - 32usize];
    ["Offset of field: ArrayMotorVoltageMsg_C::dataPointer"]
        [::core::mem::offset_of!(ArrayMotorVoltageMsg_C, dataPointer) - 320usize];
    ["Offset of field: ArrayMotorVoltageMsg_C::headerPointer"]
        [::core::mem::offset_of!(ArrayMotorVoltageMsg_C, headerPointer) - 328usize];
};
impl Default for ArrayMotorVoltageMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " atmospheric property message definition"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AtmoPropsMsg {
    #[doc = "!< kg/m^3 Local neutral particle density"]
    pub neutralDensity: f64,
    #[doc = "!< K Local avg particle temperature"]
    pub localTemp: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AtmoPropsMsg"][::core::mem::size_of::<AtmoPropsMsg>() - 16usize];
    ["Alignment of AtmoPropsMsg"][::core::mem::align_of::<AtmoPropsMsg>() - 8usize];
    ["Offset of field: AtmoPropsMsg::neutralDensity"]
        [::core::mem::offset_of!(AtmoPropsMsg, neutralDensity) - 0usize];
    ["Offset of field: AtmoPropsMsg::localTemp"]
        [::core::mem::offset_of!(AtmoPropsMsg, localTemp) - 8usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AtmoPropsMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AtmoPropsMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AtmoPropsMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AtmoPropsMsg_C"][::core::mem::size_of::<AtmoPropsMsg_C>() - 64usize];
    ["Alignment of AtmoPropsMsg_C"][::core::mem::align_of::<AtmoPropsMsg_C>() - 8usize];
    ["Offset of field: AtmoPropsMsg_C::header"]
        [::core::mem::offset_of!(AtmoPropsMsg_C, header) - 0usize];
    ["Offset of field: AtmoPropsMsg_C::data"]
        [::core::mem::offset_of!(AtmoPropsMsg_C, data) - 32usize];
    ["Offset of field: AtmoPropsMsg_C::dataPointer"]
        [::core::mem::offset_of!(AtmoPropsMsg_C, dataPointer) - 48usize];
    ["Offset of field: AtmoPropsMsg_C::headerPointer"]
        [::core::mem::offset_of!(AtmoPropsMsg_C, headerPointer) - 56usize];
};
impl Default for AtmoPropsMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for attitude guidance"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AttGuidMsg {
    #[doc = "!<        Current attitude error estimate (MRPs) of B relative to R*/"]
    pub sigma_BR: [f64; 3usize],
    #[doc = "!< [r/s]  Current body error estimate of B relateive to R in B frame compoonents */"]
    pub omega_BR_B: [f64; 3usize],
    #[doc = "!< [r/s]  Reference frame rate vector of the of R relative to N in B frame components */"]
    pub omega_RN_B: [f64; 3usize],
    #[doc = "!< [r/s2] Reference frame inertial body acceleration of R relative to N in B frame components */"]
    pub domega_RN_B: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AttGuidMsg"][::core::mem::size_of::<AttGuidMsg>() - 96usize];
    ["Alignment of AttGuidMsg"][::core::mem::align_of::<AttGuidMsg>() - 8usize];
    ["Offset of field: AttGuidMsg::sigma_BR"]
        [::core::mem::offset_of!(AttGuidMsg, sigma_BR) - 0usize];
    ["Offset of field: AttGuidMsg::omega_BR_B"]
        [::core::mem::offset_of!(AttGuidMsg, omega_BR_B) - 24usize];
    ["Offset of field: AttGuidMsg::omega_RN_B"]
        [::core::mem::offset_of!(AttGuidMsg, omega_RN_B) - 48usize];
    ["Offset of field: AttGuidMsg::domega_RN_B"]
        [::core::mem::offset_of!(AttGuidMsg, domega_RN_B) - 72usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AttGuidMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AttGuidMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AttGuidMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AttGuidMsg_C"][::core::mem::size_of::<AttGuidMsg_C>() - 144usize];
    ["Alignment of AttGuidMsg_C"][::core::mem::align_of::<AttGuidMsg_C>() - 8usize];
    ["Offset of field: AttGuidMsg_C::header"]
        [::core::mem::offset_of!(AttGuidMsg_C, header) - 0usize];
    ["Offset of field: AttGuidMsg_C::data"]
        [::core::mem::offset_of!(AttGuidMsg_C, data) - 32usize];
    ["Offset of field: AttGuidMsg_C::dataPointer"]
        [::core::mem::offset_of!(AttGuidMsg_C, dataPointer) - 128usize];
    ["Offset of field: AttGuidMsg_C::headerPointer"]
        [::core::mem::offset_of!(AttGuidMsg_C, headerPointer) - 136usize];
};
impl Default for AttGuidMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for attitude reference generation"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AttRefMsg {
    #[doc = "!<        MRP Reference attitude of R relative to N"]
    pub sigma_RN: [f64; 3usize],
    #[doc = "!< [r/s]  Reference frame rate vector of the of R relative to N in N frame components"]
    pub omega_RN_N: [f64; 3usize],
    #[doc = "!< [r/s2] Reference frame inertial acceleration of  R relative to N in N frame components"]
    pub domega_RN_N: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AttRefMsg"][::core::mem::size_of::<AttRefMsg>() - 72usize];
    ["Alignment of AttRefMsg"][::core::mem::align_of::<AttRefMsg>() - 8usize];
    ["Offset of field: AttRefMsg::sigma_RN"]
        [::core::mem::offset_of!(AttRefMsg, sigma_RN) - 0usize];
    ["Offset of field: AttRefMsg::omega_RN_N"]
        [::core::mem::offset_of!(AttRefMsg, omega_RN_N) - 24usize];
    ["Offset of field: AttRefMsg::domega_RN_N"]
        [::core::mem::offset_of!(AttRefMsg, domega_RN_N) - 48usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AttRefMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AttRefMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AttRefMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AttRefMsg_C"][::core::mem::size_of::<AttRefMsg_C>() - 120usize];
    ["Alignment of AttRefMsg_C"][::core::mem::align_of::<AttRefMsg_C>() - 8usize];
    ["Offset of field: AttRefMsg_C::header"][::core::mem::offset_of!(AttRefMsg_C, header) - 0usize];
    ["Offset of field: AttRefMsg_C::data"]
        [::core::mem::offset_of!(AttRefMsg_C, data) - 32usize];
    ["Offset of field: AttRefMsg_C::dataPointer"]
        [::core::mem::offset_of!(AttRefMsg_C, dataPointer) - 104usize];
    ["Offset of field: AttRefMsg_C::headerPointer"]
        [::core::mem::offset_of!(AttRefMsg_C, headerPointer) - 112usize];
};
impl Default for AttRefMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output euler set for attitude reference generation"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AttStateMsg {
    #[doc = "!< []   3D attitude orientation coordinate set The units depend on the attitude coordinate chosen and can be either radians (i.e. Euler angles) or dimensionless (i.e. MRP, quaternions, etc.)"]
    pub state: [f64; 3usize],
    #[doc = "!< []   3D attitude rate coordinate set.  These rate coordinates can be either omega (in rad/sec) or attitude coordiante rates with appropriate units"]
    pub rate: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AttStateMsg"][::core::mem::size_of::<AttStateMsg>() - 48usize];
    ["Alignment of AttStateMsg"][::core::mem::align_of::<AttStateMsg>() - 8usize];
    ["Offset of field: AttStateMsg::state"]
        [::core::mem::offset_of!(AttStateMsg, state) - 0usize];
    ["Offset of field: AttStateMsg::rate"]
        [::core::mem::offset_of!(AttStateMsg, rate) - 24usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AttStateMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: AttStateMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut AttStateMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AttStateMsg_C"][::core::mem::size_of::<AttStateMsg_C>() - 96usize];
    ["Alignment of AttStateMsg_C"][::core::mem::align_of::<AttStateMsg_C>() - 8usize];
    ["Offset of field: AttStateMsg_C::header"]
        [::core::mem::offset_of!(AttStateMsg_C, header) - 0usize];
    ["Offset of field: AttStateMsg_C::data"]
        [::core::mem::offset_of!(AttStateMsg_C, data) - 32usize];
    ["Offset of field: AttStateMsg_C::dataPointer"]
        [::core::mem::offset_of!(AttStateMsg_C, dataPointer) - 80usize];
    ["Offset of field: AttStateMsg_C::headerPointer"]
        [::core::mem::offset_of!(AttStateMsg_C, headerPointer) - 88usize];
};
impl Default for AttStateMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "!@brief Planet heading message definition.\n*! Many modules in Basilisk utilize the spacecraft body frame heading to something.\nFor instance, a spacecraft may want to point at a point on earth, the sun, another planet\nor another spacecraft. This message is unique from the interface message NavAttMsg\nin being agnostic of the thing being pointed to while not including separate information\nabout attitude and rates that are not necessarily desired\n*/"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BodyHeadingMsg {
    #[doc = "!< [] unit heading vector to any thing \"X\" in the spacecraft, \"B\", body frame"]
    pub rHat_XB_B: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BodyHeadingMsg"][::core::mem::size_of::<BodyHeadingMsg>() - 24usize];
    ["Alignment of BodyHeadingMsg"]
        [::core::mem::align_of::<BodyHeadingMsg>() - 8usize];
    ["Offset of field: BodyHeadingMsg::rHat_XB_B"]
        [::core::mem::offset_of!(BodyHeadingMsg, rHat_XB_B) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BodyHeadingMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: BodyHeadingMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut BodyHeadingMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BodyHeadingMsg_C"][::core::mem::size_of::<BodyHeadingMsg_C>() - 72usize];
    ["Alignment of BodyHeadingMsg_C"][::core::mem::align_of::<BodyHeadingMsg_C>() - 8usize];
    ["Offset of field: BodyHeadingMsg_C::header"]
        [::core::mem::offset_of!(BodyHeadingMsg_C, header) - 0usize];
    ["Offset of field: BodyHeadingMsg_C::data"]
        [::core::mem::offset_of!(BodyHeadingMsg_C, data) - 32usize];
    ["Offset of field: BodyHeadingMsg_C::dataPointer"]
        [::core::mem::offset_of!(BodyHeadingMsg_C, dataPointer) - 56usize];
    ["Offset of field: BodyHeadingMsg_C::headerPointer"]
        [::core::mem::offset_of!(BodyHeadingMsg_C, headerPointer) - 64usize];
};
impl Default for BodyHeadingMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to compute a angle between boresight and body"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct BoreAngleMsg {
    #[doc = "!< [r] the location angle to put the miss in a quadrant"]
    pub azimuth: f64,
    #[doc = "!< [r] the angular distance between the boresight and body"]
    pub missAngle: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BoreAngleMsg"][::core::mem::size_of::<BoreAngleMsg>() - 16usize];
    ["Alignment of BoreAngleMsg"][::core::mem::align_of::<BoreAngleMsg>() - 8usize];
    ["Offset of field: BoreAngleMsg::azimuth"]
        [::core::mem::offset_of!(BoreAngleMsg, azimuth) - 0usize];
    ["Offset of field: BoreAngleMsg::missAngle"]
        [::core::mem::offset_of!(BoreAngleMsg, missAngle) - 8usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BoreAngleMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: BoreAngleMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut BoreAngleMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BoreAngleMsg_C"][::core::mem::size_of::<BoreAngleMsg_C>() - 64usize];
    ["Alignment of BoreAngleMsg_C"][::core::mem::align_of::<BoreAngleMsg_C>() - 8usize];
    ["Offset of field: BoreAngleMsg_C::header"]
        [::core::mem::offset_of!(BoreAngleMsg_C, header) - 0usize];
    ["Offset of field: BoreAngleMsg_C::data"]
        [::core::mem::offset_of!(BoreAngleMsg_C, data) - 32usize];
    ["Offset of field: BoreAngleMsg_C::dataPointer"]
        [::core::mem::offset_of!(BoreAngleMsg_C, dataPointer) - 48usize];
    ["Offset of field: BoreAngleMsg_C::headerPointer"]
        [::core::mem::offset_of!(BoreAngleMsg_C, headerPointer) - 56usize];
};
impl Default for BoreAngleMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define CM estimation output data"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CMEstDataMsg {
    #[doc = "!< [-]   attitude convergence error"]
    pub attError: f64,
    #[doc = "!< [m]   estimated cm location"]
    pub state: [f64; 3usize],
    #[doc = "!< [m]   errpr w.r.t. truth"]
    pub stateError: [f64; 3usize],
    #[doc = "!< [m^2] CM estimated covariance"]
    pub covariance: [f64; 3usize],
    #[doc = "!< [Nm]  pre-fit torque residuals"]
    pub preFitRes: [f64; 3usize],
    #[doc = "!< [Nm]  post-fit torque residuals"]
    pub postFitRes: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CMEstDataMsg"][::core::mem::size_of::<CMEstDataMsg>() - 128usize];
    ["Alignment of CMEstDataMsg"][::core::mem::align_of::<CMEstDataMsg>() - 8usize];
    ["Offset of field: CMEstDataMsg::attError"]
        [::core::mem::offset_of!(CMEstDataMsg, attError) - 0usize];
    ["Offset of field: CMEstDataMsg::state"]
        [::core::mem::offset_of!(CMEstDataMsg, state) - 8usize];
    ["Offset of field: CMEstDataMsg::stateError"]
        [::core::mem::offset_of!(CMEstDataMsg, stateError) - 32usize];
    ["Offset of field: CMEstDataMsg::covariance"]
        [::core::mem::offset_of!(CMEstDataMsg, covariance) - 56usize];
    ["Offset of field: CMEstDataMsg::preFitRes"]
        [::core::mem::offset_of!(CMEstDataMsg, preFitRes) - 80usize];
    ["Offset of field: CMEstDataMsg::postFitRes"]
        [::core::mem::offset_of!(CMEstDataMsg, postFitRes) - 104usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CMEstDataMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CMEstDataMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CMEstDataMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CMEstDataMsg_C"][::core::mem::size_of::<CMEstDataMsg_C>() - 176usize];
    ["Alignment of CMEstDataMsg_C"][::core::mem::align_of::<CMEstDataMsg_C>() - 8usize];
    ["Offset of field: CMEstDataMsg_C::header"]
        [::core::mem::offset_of!(CMEstDataMsg_C, header) - 0usize];
    ["Offset of field: CMEstDataMsg_C::data"]
        [::core::mem::offset_of!(CMEstDataMsg_C, data) - 32usize];
    ["Offset of field: CMEstDataMsg_C::dataPointer"]
        [::core::mem::offset_of!(CMEstDataMsg_C, dataPointer) - 160usize];
    ["Offset of field: CMEstDataMsg_C::headerPointer"]
        [::core::mem::offset_of!(CMEstDataMsg_C, headerPointer) - 168usize];
};
impl Default for CMEstDataMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output of the sub-module.  This is the same\noutput message that is used by all sub-modules in the module folder."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CModuleTemplateMsg {
    #[doc = "!< [units] sample message vector"]
    pub dataVector: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CModuleTemplateMsg"]
        [::core::mem::size_of::<CModuleTemplateMsg>() - 24usize];
    ["Alignment of CModuleTemplateMsg"]
        [::core::mem::align_of::<CModuleTemplateMsg>() - 8usize];
    ["Offset of field: CModuleTemplateMsg::dataVector"]
        [::core::mem::offset_of!(CModuleTemplateMsg, dataVector) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CModuleTemplateMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CModuleTemplateMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CModuleTemplateMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CModuleTemplateMsg_C"][::core::mem::size_of::<CModuleTemplateMsg_C>() - 72usize];
    ["Alignment of CModuleTemplateMsg_C"][::core::mem::align_of::<CModuleTemplateMsg_C>() - 8usize];
    ["Offset of field: CModuleTemplateMsg_C::header"]
        [::core::mem::offset_of!(CModuleTemplateMsg_C, header) - 0usize];
    ["Offset of field: CModuleTemplateMsg_C::data"]
        [::core::mem::offset_of!(CModuleTemplateMsg_C, data) - 32usize];
    ["Offset of field: CModuleTemplateMsg_C::dataPointer"]
        [::core::mem::offset_of!(CModuleTemplateMsg_C, dataPointer) - 56usize];
    ["Offset of field: CModuleTemplateMsg_C::headerPointer"]
        [::core::mem::offset_of!(CModuleTemplateMsg_C, headerPointer) - 64usize];
};
impl Default for CModuleTemplateMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Output structure for CSS array or constellation interface.  Each element contains the raw measurement which should be a cosine value nominally"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CSSArraySensorMsg {
    #[doc = "!< [s]   Current vehicle time-tag associated with measurements"]
    pub timeTag: f64,
    #[doc = "!< Current measured CSS value (ideally a cosine value) for the constellation of CSS sensors"]
    pub CosValue: [f64; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CSSArraySensorMsg"]
        [::core::mem::size_of::<CSSArraySensorMsg>() - 264usize];
    ["Alignment of CSSArraySensorMsg"]
        [::core::mem::align_of::<CSSArraySensorMsg>() - 8usize];
    ["Offset of field: CSSArraySensorMsg::timeTag"]
        [::core::mem::offset_of!(CSSArraySensorMsg, timeTag) - 0usize];
    ["Offset of field: CSSArraySensorMsg::CosValue"]
        [::core::mem::offset_of!(CSSArraySensorMsg, CosValue) - 8usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CSSArraySensorMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CSSArraySensorMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CSSArraySensorMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CSSArraySensorMsg_C"][::core::mem::size_of::<CSSArraySensorMsg_C>() - 312usize];
    ["Alignment of CSSArraySensorMsg_C"][::core::mem::align_of::<CSSArraySensorMsg_C>() - 8usize];
    ["Offset of field: CSSArraySensorMsg_C::header"]
        [::core::mem::offset_of!(CSSArraySensorMsg_C, header) - 0usize];
    ["Offset of field: CSSArraySensorMsg_C::data"]
        [::core::mem::offset_of!(CSSArraySensorMsg_C, data) - 32usize];
    ["Offset of field: CSSArraySensorMsg_C::dataPointer"]
        [::core::mem::offset_of!(CSSArraySensorMsg_C, dataPointer) - 296usize];
    ["Offset of field: CSSArraySensorMsg_C::headerPointer"]
        [::core::mem::offset_of!(CSSArraySensorMsg_C, headerPointer) - 304usize];
};
impl Default for CSSArraySensorMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to contain the configuration information for\neach sun sensor"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CSSUnitConfigMsg {
    #[doc = "!< [-] CSS unit normal expressed in structure"]
    pub nHat_B: [f64; 3usize],
    #[doc = "!< [W]  Individual calibration coefficient bias for CSS.  If all CSS have the same gain, then this is set to 1.0. If one CSS has a 10% stronger response for the same input, then the value would be 1.10"]
    pub CBias: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CSSUnitConfigMsg"]
        [::core::mem::size_of::<CSSUnitConfigMsg>() - 32usize];
    ["Alignment of CSSUnitConfigMsg"]
        [::core::mem::align_of::<CSSUnitConfigMsg>() - 8usize];
    ["Offset of field: CSSUnitConfigMsg::nHat_B"]
        [::core::mem::offset_of!(CSSUnitConfigMsg, nHat_B) - 0usize];
    ["Offset of field: CSSUnitConfigMsg::CBias"]
        [::core::mem::offset_of!(CSSUnitConfigMsg, CBias) - 24usize];
};
#[doc = " @brief Structure used to contain the configuration information for\neach sun sensor"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CSSConfigMsg {
    #[doc = "!< [-] Number of coarse sun sensors in cluster"]
    pub nCSS: u32,
    #[doc = "!< [-] constellation of CSS elements"]
    pub cssVals: [CSSUnitConfigMsg; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CSSConfigMsg"][::core::mem::size_of::<CSSConfigMsg>() - 1032usize];
    ["Alignment of CSSConfigMsg"][::core::mem::align_of::<CSSConfigMsg>() - 8usize];
    ["Offset of field: CSSConfigMsg::nCSS"]
        [::core::mem::offset_of!(CSSConfigMsg, nCSS) - 0usize];
    ["Offset of field: CSSConfigMsg::cssVals"]
        [::core::mem::offset_of!(CSSConfigMsg, cssVals) - 8usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CSSConfigMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CSSConfigMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CSSConfigMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CSSConfigMsg_C"][::core::mem::size_of::<CSSConfigMsg_C>() - 1080usize];
    ["Alignment of CSSConfigMsg_C"][::core::mem::align_of::<CSSConfigMsg_C>() - 8usize];
    ["Offset of field: CSSConfigMsg_C::header"]
        [::core::mem::offset_of!(CSSConfigMsg_C, header) - 0usize];
    ["Offset of field: CSSConfigMsg_C::data"]
        [::core::mem::offset_of!(CSSConfigMsg_C, data) - 32usize];
    ["Offset of field: CSSConfigMsg_C::dataPointer"]
        [::core::mem::offset_of!(CSSConfigMsg_C, dataPointer) - 1064usize];
    ["Offset of field: CSSConfigMsg_C::headerPointer"]
        [::core::mem::offset_of!(CSSConfigMsg_C, headerPointer) - 1072usize];
};
impl Default for CSSConfigMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "!@brief CSS raw data output message definition."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CSSRawDataMsg {
    #[doc = "!< CSS measurement output"]
    pub OutputData: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CSSRawDataMsg"][::core::mem::size_of::<CSSRawDataMsg>() - 8usize];
    ["Alignment of CSSRawDataMsg"][::core::mem::align_of::<CSSRawDataMsg>() - 8usize];
    ["Offset of field: CSSRawDataMsg::OutputData"]
        [::core::mem::offset_of!(CSSRawDataMsg, OutputData) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CSSRawDataMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CSSRawDataMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CSSRawDataMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CSSRawDataMsg_C"][::core::mem::size_of::<CSSRawDataMsg_C>() - 56usize];
    ["Alignment of CSSRawDataMsg_C"][::core::mem::align_of::<CSSRawDataMsg_C>() - 8usize];
    ["Offset of field: CSSRawDataMsg_C::header"]
        [::core::mem::offset_of!(CSSRawDataMsg_C, header) - 0usize];
    ["Offset of field: CSSRawDataMsg_C::data"]
        [::core::mem::offset_of!(CSSRawDataMsg_C, data) - 32usize];
    ["Offset of field: CSSRawDataMsg_C::dataPointer"]
        [::core::mem::offset_of!(CSSRawDataMsg_C, dataPointer) - 40usize];
    ["Offset of field: CSSRawDataMsg_C::headerPointer"]
        [::core::mem::offset_of!(CSSRawDataMsg_C, headerPointer) - 48usize];
};
impl Default for CSSRawDataMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CSSUnitConfigMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CSSUnitConfigMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CSSUnitConfigMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CSSUnitConfigMsg_C"][::core::mem::size_of::<CSSUnitConfigMsg_C>() - 80usize];
    ["Alignment of CSSUnitConfigMsg_C"][::core::mem::align_of::<CSSUnitConfigMsg_C>() - 8usize];
    ["Offset of field: CSSUnitConfigMsg_C::header"]
        [::core::mem::offset_of!(CSSUnitConfigMsg_C, header) - 0usize];
    ["Offset of field: CSSUnitConfigMsg_C::data"]
        [::core::mem::offset_of!(CSSUnitConfigMsg_C, data) - 32usize];
    ["Offset of field: CSSUnitConfigMsg_C::dataPointer"]
        [::core::mem::offset_of!(CSSUnitConfigMsg_C, dataPointer) - 64usize];
    ["Offset of field: CSSUnitConfigMsg_C::headerPointer"]
        [::core::mem::offset_of!(CSSUnitConfigMsg_C, headerPointer) - 72usize];
};
impl Default for CSSUnitConfigMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CameraConfigMsg {
    #[doc = "!< [-]   ID of the camera that took the snapshot*/"]
    pub cameraID: i64,
    #[doc = "!<  The camera is taking images at rendering rate if 1, 0 if not*/"]
    pub isOn: ::core::ffi::c_int,
    #[doc = "!< [-] Name of the parent body to which the camera should be attached"]
    pub parentName: [::core::ffi::c_char; 256usize],
    #[doc = "!< [rad]   Camera Field of View, edge-to-edge along camera y-axis */"]
    pub fieldOfView: f64,
    #[doc = "!< [-] Camera resolution, width/height in pixels (pixelWidth/pixelHeight in Unity) in pixels*/"]
    pub resolution: [::core::ffi::c_int; 2usize],
    #[doc = "!< [ns] Frame time interval at which to capture images in units of nanosecond */"]
    pub renderRate: u64,
    #[doc = "!< [m] Camera position in body frame */"]
    pub cameraPos_B: [f64; 3usize],
    #[doc = "!< [-] MRP defining the orientation of the camera frame relative to the body frame */"]
    pub sigma_CB: [f64; 3usize],
    #[doc = "!< string containing the star field preference"]
    pub skyBox: [::core::ffi::c_char; 256usize],
    #[doc = "!< (Optional) Enable post-processing of camera image. Value of 0 (protobuffer default) to use viz default which is off, -1 for false, 1 for true"]
    pub postProcessingOn: ::core::ffi::c_int,
    #[doc = "!< (Optional) Distance to the point of focus, minimum value of 0.1, Value of 0 to turn off this parameter entirely."]
    pub ppFocusDistance: f64,
    #[doc = "!<  (Optional) Ratio of the aperture (known as f-stop or f-number). The smaller the value is, the shallower the depth of field is. Valid Setting Range: 0.05 to 32. Value of 0 to turn off this parameter entirely."]
    pub ppAperture: f64,
    #[doc = "!< [m] (Optional) Valid setting range: 0.001m to 0.3m. Value of 0 to turn off this parameter entirely."]
    pub ppFocalLength: f64,
    #[doc = "!< (Optional) Convolution kernel size of the bokeh filter, which determines the maximum radius of bokeh. It also affects the performance (the larger the kernel is, the longer the GPU time is required). Depth textures Value of 1 for Small, 2 for Medium, 3 for Large, 4 for Extra Large. Value of 0 to turn off this parameter entirely."]
    pub ppMaxBlurSize: ::core::ffi::c_int,
    #[doc = "!< If true, commands camera to update Instrument Camera to current message's parameters"]
    pub updateCameraParameters: ::core::ffi::c_int,
    #[doc = "!< (Optional) Value of 0 to render visual image (default), value of 1 to render depth buffer to image"]
    pub renderMode: ::core::ffi::c_int,
    #[doc = "!< (Optional) [m] Set the bounds of rendered depth map by setting the near and far clipping planes when in renderMode=1 (depthMap mode). Default values of 0.1 and 100."]
    pub depthMapClippingPlanes: [f64; 2usize],
    #[doc = "!< (Optional) Value of 0 (protobuffer default) to use viz default, -1 for false, 1 for true"]
    pub showHUDElementsInImage: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CameraConfigMsg"][::core::mem::size_of::<CameraConfigMsg>() - 672usize];
    ["Alignment of CameraConfigMsg"]
        [::core::mem::align_of::<CameraConfigMsg>() - 8usize];
    ["Offset of field: CameraConfigMsg::cameraID"]
        [::core::mem::offset_of!(CameraConfigMsg, cameraID) - 0usize];
    ["Offset of field: CameraConfigMsg::isOn"]
        [::core::mem::offset_of!(CameraConfigMsg, isOn) - 8usize];
    ["Offset of field: CameraConfigMsg::parentName"]
        [::core::mem::offset_of!(CameraConfigMsg, parentName) - 12usize];
    ["Offset of field: CameraConfigMsg::fieldOfView"]
        [::core::mem::offset_of!(CameraConfigMsg, fieldOfView) - 272usize];
    ["Offset of field: CameraConfigMsg::resolution"]
        [::core::mem::offset_of!(CameraConfigMsg, resolution) - 280usize];
    ["Offset of field: CameraConfigMsg::renderRate"]
        [::core::mem::offset_of!(CameraConfigMsg, renderRate) - 288usize];
    ["Offset of field: CameraConfigMsg::cameraPos_B"]
        [::core::mem::offset_of!(CameraConfigMsg, cameraPos_B) - 296usize];
    ["Offset of field: CameraConfigMsg::sigma_CB"]
        [::core::mem::offset_of!(CameraConfigMsg, sigma_CB) - 320usize];
    ["Offset of field: CameraConfigMsg::skyBox"]
        [::core::mem::offset_of!(CameraConfigMsg, skyBox) - 344usize];
    ["Offset of field: CameraConfigMsg::postProcessingOn"]
        [::core::mem::offset_of!(CameraConfigMsg, postProcessingOn) - 600usize];
    ["Offset of field: CameraConfigMsg::ppFocusDistance"]
        [::core::mem::offset_of!(CameraConfigMsg, ppFocusDistance) - 608usize];
    ["Offset of field: CameraConfigMsg::ppAperture"]
        [::core::mem::offset_of!(CameraConfigMsg, ppAperture) - 616usize];
    ["Offset of field: CameraConfigMsg::ppFocalLength"]
        [::core::mem::offset_of!(CameraConfigMsg, ppFocalLength) - 624usize];
    ["Offset of field: CameraConfigMsg::ppMaxBlurSize"]
        [::core::mem::offset_of!(CameraConfigMsg, ppMaxBlurSize) - 632usize];
    ["Offset of field: CameraConfigMsg::updateCameraParameters"]
        [::core::mem::offset_of!(CameraConfigMsg, updateCameraParameters) - 636usize];
    ["Offset of field: CameraConfigMsg::renderMode"]
        [::core::mem::offset_of!(CameraConfigMsg, renderMode) - 640usize];
    ["Offset of field: CameraConfigMsg::depthMapClippingPlanes"]
        [::core::mem::offset_of!(CameraConfigMsg, depthMapClippingPlanes) - 648usize];
    ["Offset of field: CameraConfigMsg::showHUDElementsInImage"]
        [::core::mem::offset_of!(CameraConfigMsg, showHUDElementsInImage) - 664usize];
};
impl Default for CameraConfigMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CameraConfigMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CameraConfigMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CameraConfigMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CameraConfigMsg_C"][::core::mem::size_of::<CameraConfigMsg_C>() - 720usize];
    ["Alignment of CameraConfigMsg_C"][::core::mem::align_of::<CameraConfigMsg_C>() - 8usize];
    ["Offset of field: CameraConfigMsg_C::header"]
        [::core::mem::offset_of!(CameraConfigMsg_C, header) - 0usize];
    ["Offset of field: CameraConfigMsg_C::data"]
        [::core::mem::offset_of!(CameraConfigMsg_C, data) - 32usize];
    ["Offset of field: CameraConfigMsg_C::dataPointer"]
        [::core::mem::offset_of!(CameraConfigMsg_C, dataPointer) - 704usize];
    ["Offset of field: CameraConfigMsg_C::headerPointer"]
        [::core::mem::offset_of!(CameraConfigMsg_C, headerPointer) - 712usize];
};
impl Default for CameraConfigMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for attitude guidance"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CameraImageMsg {
    #[doc = "!< --[ns]   Current vehicle time-tag associated with measurements*/"]
    pub timeTag: u64,
    #[doc = "!< --  A valid image is present for 1, 0 if not*/"]
    pub valid: ::core::ffi::c_int,
    #[doc = "!< -- [-]   ID of the camera that took the snapshot*/"]
    pub cameraID: i64,
    #[doc = "!< -- Pointer to the image"]
    pub imagePointer: *mut ::core::ffi::c_void,
    #[doc = "!< -- Length of the buffer for recasting"]
    pub imageBufferLength: i32,
    #[doc = "!< -- Number of channels in each pixel, RGB = 3, RGBA = 4"]
    pub imageType: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CameraImageMsg"][::core::mem::size_of::<CameraImageMsg>() - 40usize];
    ["Alignment of CameraImageMsg"]
        [::core::mem::align_of::<CameraImageMsg>() - 8usize];
    ["Offset of field: CameraImageMsg::timeTag"]
        [::core::mem::offset_of!(CameraImageMsg, timeTag) - 0usize];
    ["Offset of field: CameraImageMsg::valid"]
        [::core::mem::offset_of!(CameraImageMsg, valid) - 8usize];
    ["Offset of field: CameraImageMsg::cameraID"]
        [::core::mem::offset_of!(CameraImageMsg, cameraID) - 16usize];
    ["Offset of field: CameraImageMsg::imagePointer"]
        [::core::mem::offset_of!(CameraImageMsg, imagePointer) - 24usize];
    ["Offset of field: CameraImageMsg::imageBufferLength"]
        [::core::mem::offset_of!(CameraImageMsg, imageBufferLength) - 32usize];
    ["Offset of field: CameraImageMsg::imageType"]
        [::core::mem::offset_of!(CameraImageMsg, imageType) - 36usize];
};
impl Default for CameraImageMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CameraImageMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CameraImageMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CameraImageMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CameraImageMsg_C"][::core::mem::size_of::<CameraImageMsg_C>() - 88usize];
    ["Alignment of CameraImageMsg_C"][::core::mem::align_of::<CameraImageMsg_C>() - 8usize];
    ["Offset of field: CameraImageMsg_C::header"]
        [::core::mem::offset_of!(CameraImageMsg_C, header) - 0usize];
    ["Offset of field: CameraImageMsg_C::data"]
        [::core::mem::offset_of!(CameraImageMsg_C, data) - 32usize];
    ["Offset of field: CameraImageMsg_C::dataPointer"]
        [::core::mem::offset_of!(CameraImageMsg_C, dataPointer) - 72usize];
    ["Offset of field: CameraImageMsg_C::headerPointer"]
        [::core::mem::offset_of!(CameraImageMsg_C, headerPointer) - 80usize];
};
impl Default for CameraImageMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define classic orbit elements"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ClassicElementsMsg {
    #[doc = "!< object semi-major axis"]
    pub a: f64,
    #[doc = "!< Eccentricity of the orbit"]
    pub e: f64,
    #[doc = "!< inclination of the orbital plane"]
    pub i: f64,
    #[doc = "!< Right ascension of the ascending node"]
    pub Omega: f64,
    #[doc = "!< Argument of periapsis of the orbit"]
    pub omega: f64,
    #[doc = "!< True anomaly of the orbit"]
    pub f: f64,
    #[doc = "!< Magnitude of the position vector (extra)"]
    pub rmag: f64,
    #[doc = "!< Inverted semi-major axis (extra)"]
    pub alpha: f64,
    #[doc = "!< Radius of periapsis (extra)"]
    pub rPeriap: f64,
    #[doc = "!< Radius if apoapsis (extra)"]
    pub rApoap: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ClassicElementsMsg"]
        [::core::mem::size_of::<ClassicElementsMsg>() - 80usize];
    ["Alignment of ClassicElementsMsg"]
        [::core::mem::align_of::<ClassicElementsMsg>() - 8usize];
    ["Offset of field: ClassicElementsMsg::a"]
        [::core::mem::offset_of!(ClassicElementsMsg, a) - 0usize];
    ["Offset of field: ClassicElementsMsg::e"]
        [::core::mem::offset_of!(ClassicElementsMsg, e) - 8usize];
    ["Offset of field: ClassicElementsMsg::i"]
        [::core::mem::offset_of!(ClassicElementsMsg, i) - 16usize];
    ["Offset of field: ClassicElementsMsg::Omega"]
        [::core::mem::offset_of!(ClassicElementsMsg, Omega) - 24usize];
    ["Offset of field: ClassicElementsMsg::omega"]
        [::core::mem::offset_of!(ClassicElementsMsg, omega) - 32usize];
    ["Offset of field: ClassicElementsMsg::f"]
        [::core::mem::offset_of!(ClassicElementsMsg, f) - 40usize];
    ["Offset of field: ClassicElementsMsg::rmag"]
        [::core::mem::offset_of!(ClassicElementsMsg, rmag) - 48usize];
    ["Offset of field: ClassicElementsMsg::alpha"]
        [::core::mem::offset_of!(ClassicElementsMsg, alpha) - 56usize];
    ["Offset of field: ClassicElementsMsg::rPeriap"]
        [::core::mem::offset_of!(ClassicElementsMsg, rPeriap) - 64usize];
    ["Offset of field: ClassicElementsMsg::rApoap"]
        [::core::mem::offset_of!(ClassicElementsMsg, rApoap) - 72usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClassicElementsMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ClassicElementsMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ClassicElementsMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ClassicElementsMsg_C"][::core::mem::size_of::<ClassicElementsMsg_C>() - 128usize];
    ["Alignment of ClassicElementsMsg_C"][::core::mem::align_of::<ClassicElementsMsg_C>() - 8usize];
    ["Offset of field: ClassicElementsMsg_C::header"]
        [::core::mem::offset_of!(ClassicElementsMsg_C, header) - 0usize];
    ["Offset of field: ClassicElementsMsg_C::data"]
        [::core::mem::offset_of!(ClassicElementsMsg_C, data) - 32usize];
    ["Offset of field: ClassicElementsMsg_C::dataPointer"]
        [::core::mem::offset_of!(ClassicElementsMsg_C, dataPointer) - 112usize];
    ["Offset of field: ClassicElementsMsg_C::headerPointer"]
        [::core::mem::offset_of!(ClassicElementsMsg_C, headerPointer) - 120usize];
};
impl Default for ClassicElementsMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message used to define the vehicle control force vector in Body frame components"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CmdForceBodyMsg {
    #[doc = "!< [N] Control force requested"]
    pub forceRequestBody: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CmdForceBodyMsg"][::core::mem::size_of::<CmdForceBodyMsg>() - 24usize];
    ["Alignment of CmdForceBodyMsg"]
        [::core::mem::align_of::<CmdForceBodyMsg>() - 8usize];
    ["Offset of field: CmdForceBodyMsg::forceRequestBody"]
        [::core::mem::offset_of!(CmdForceBodyMsg, forceRequestBody) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CmdForceBodyMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CmdForceBodyMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CmdForceBodyMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CmdForceBodyMsg_C"][::core::mem::size_of::<CmdForceBodyMsg_C>() - 72usize];
    ["Alignment of CmdForceBodyMsg_C"][::core::mem::align_of::<CmdForceBodyMsg_C>() - 8usize];
    ["Offset of field: CmdForceBodyMsg_C::header"]
        [::core::mem::offset_of!(CmdForceBodyMsg_C, header) - 0usize];
    ["Offset of field: CmdForceBodyMsg_C::data"]
        [::core::mem::offset_of!(CmdForceBodyMsg_C, data) - 32usize];
    ["Offset of field: CmdForceBodyMsg_C::dataPointer"]
        [::core::mem::offset_of!(CmdForceBodyMsg_C, dataPointer) - 56usize];
    ["Offset of field: CmdForceBodyMsg_C::headerPointer"]
        [::core::mem::offset_of!(CmdForceBodyMsg_C, headerPointer) - 64usize];
};
impl Default for CmdForceBodyMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message used to define the vehicle control force vector in Inertial frame components"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CmdForceInertialMsg {
    #[doc = "!< [N] control force request"]
    pub forceRequestInertial: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CmdForceInertialMsg"]
        [::core::mem::size_of::<CmdForceInertialMsg>() - 24usize];
    ["Alignment of CmdForceInertialMsg"]
        [::core::mem::align_of::<CmdForceInertialMsg>() - 8usize];
    ["Offset of field: CmdForceInertialMsg::forceRequestInertial"]
        [::core::mem::offset_of!(CmdForceInertialMsg, forceRequestInertial) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CmdForceInertialMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CmdForceInertialMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CmdForceInertialMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CmdForceInertialMsg_C"][::core::mem::size_of::<CmdForceInertialMsg_C>() - 72usize];
    ["Alignment of CmdForceInertialMsg_C"]
        [::core::mem::align_of::<CmdForceInertialMsg_C>() - 8usize];
    ["Offset of field: CmdForceInertialMsg_C::header"]
        [::core::mem::offset_of!(CmdForceInertialMsg_C, header) - 0usize];
    ["Offset of field: CmdForceInertialMsg_C::data"]
        [::core::mem::offset_of!(CmdForceInertialMsg_C, data) - 32usize];
    ["Offset of field: CmdForceInertialMsg_C::dataPointer"]
        [::core::mem::offset_of!(CmdForceInertialMsg_C, dataPointer) - 56usize];
    ["Offset of field: CmdForceInertialMsg_C::headerPointer"]
        [::core::mem::offset_of!(CmdForceInertialMsg_C, headerPointer) - 64usize];
};
impl Default for CmdForceInertialMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message used to define the vehicle control torque vector in Body frame components"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CmdTorqueBodyMsg {
    #[doc = "!< [Nm] Control torque requested"]
    pub torqueRequestBody: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CmdTorqueBodyMsg"]
        [::core::mem::size_of::<CmdTorqueBodyMsg>() - 24usize];
    ["Alignment of CmdTorqueBodyMsg"]
        [::core::mem::align_of::<CmdTorqueBodyMsg>() - 8usize];
    ["Offset of field: CmdTorqueBodyMsg::torqueRequestBody"]
        [::core::mem::offset_of!(CmdTorqueBodyMsg, torqueRequestBody) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CmdTorqueBodyMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CmdTorqueBodyMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CmdTorqueBodyMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CmdTorqueBodyMsg_C"][::core::mem::size_of::<CmdTorqueBodyMsg_C>() - 72usize];
    ["Alignment of CmdTorqueBodyMsg_C"][::core::mem::align_of::<CmdTorqueBodyMsg_C>() - 8usize];
    ["Offset of field: CmdTorqueBodyMsg_C::header"]
        [::core::mem::offset_of!(CmdTorqueBodyMsg_C, header) - 0usize];
    ["Offset of field: CmdTorqueBodyMsg_C::data"]
        [::core::mem::offset_of!(CmdTorqueBodyMsg_C, data) - 32usize];
    ["Offset of field: CmdTorqueBodyMsg_C::dataPointer"]
        [::core::mem::offset_of!(CmdTorqueBodyMsg_C, dataPointer) - 56usize];
    ["Offset of field: CmdTorqueBodyMsg_C::headerPointer"]
        [::core::mem::offset_of!(CmdTorqueBodyMsg_C, headerPointer) - 64usize];
};
impl Default for CmdTorqueBodyMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define RGBA color"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ColorMsg {
    #[doc = "!< [-] 0-255 Color values in RGBA format"]
    pub colorRGBA: [::core::ffi::c_int; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ColorMsg"][::core::mem::size_of::<ColorMsg>() - 16usize];
    ["Alignment of ColorMsg"][::core::mem::align_of::<ColorMsg>() - 4usize];
    ["Offset of field: ColorMsg::colorRGBA"]
        [::core::mem::offset_of!(ColorMsg, colorRGBA) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ColorMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ColorMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ColorMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ColorMsg_C"][::core::mem::size_of::<ColorMsg_C>() - 64usize];
    ["Alignment of ColorMsg_C"][::core::mem::align_of::<ColorMsg_C>() - 8usize];
    ["Offset of field: ColorMsg_C::header"][::core::mem::offset_of!(ColorMsg_C, header) - 0usize];
    ["Offset of field: ColorMsg_C::data"]
        [::core::mem::offset_of!(ColorMsg_C, data) - 32usize];
    ["Offset of field: ColorMsg_C::dataPointer"]
        [::core::mem::offset_of!(ColorMsg_C, dataPointer) - 48usize];
    ["Offset of field: ColorMsg_C::headerPointer"]
        [::core::mem::offset_of!(ColorMsg_C, headerPointer) - 56usize];
};
impl Default for ColorMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to Constraint Dynamic Effector output message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ConstDynEffectorMsg {
    #[doc = "!< [N] Constraint force applied in Inertial frame"]
    pub Fc_N: [f64; 3usize],
    #[doc = "!< [N.m] Constraint torque applied on s/c 1 in B1 frame"]
    pub L1_B1: [f64; 3usize],
    #[doc = "!< [N.m] Constraint torque applied on s/c 2 in B2 frame"]
    pub L2_B2: [f64; 3usize],
    #[doc = "!< [m] Direction constraint violation"]
    pub psi_N: [f64; 3usize],
    #[doc = "!< [N] Magnitude of filtered constraint force applied in Inertial frame"]
    pub Fc_mag_filtered: f64,
    #[doc = "!< [N.m] Magnitude of filtered constraint torque on s/c 1 applied in B1 frame"]
    pub L1_mag_filtered: f64,
    #[doc = "!< [N.m] Magnitude of filtered constraint torque on s/c 2 applied in B2 frame"]
    pub L2_mag_filtered: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ConstDynEffectorMsg"]
        [::core::mem::size_of::<ConstDynEffectorMsg>() - 120usize];
    ["Alignment of ConstDynEffectorMsg"]
        [::core::mem::align_of::<ConstDynEffectorMsg>() - 8usize];
    ["Offset of field: ConstDynEffectorMsg::Fc_N"]
        [::core::mem::offset_of!(ConstDynEffectorMsg, Fc_N) - 0usize];
    ["Offset of field: ConstDynEffectorMsg::L1_B1"]
        [::core::mem::offset_of!(ConstDynEffectorMsg, L1_B1) - 24usize];
    ["Offset of field: ConstDynEffectorMsg::L2_B2"]
        [::core::mem::offset_of!(ConstDynEffectorMsg, L2_B2) - 48usize];
    ["Offset of field: ConstDynEffectorMsg::psi_N"]
        [::core::mem::offset_of!(ConstDynEffectorMsg, psi_N) - 72usize];
    ["Offset of field: ConstDynEffectorMsg::Fc_mag_filtered"]
        [::core::mem::offset_of!(ConstDynEffectorMsg, Fc_mag_filtered) - 96usize];
    ["Offset of field: ConstDynEffectorMsg::L1_mag_filtered"]
        [::core::mem::offset_of!(ConstDynEffectorMsg, L1_mag_filtered) - 104usize];
    ["Offset of field: ConstDynEffectorMsg::L2_mag_filtered"]
        [::core::mem::offset_of!(ConstDynEffectorMsg, L2_mag_filtered) - 112usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConstDynEffectorMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ConstDynEffectorMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ConstDynEffectorMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ConstDynEffectorMsg_C"][::core::mem::size_of::<ConstDynEffectorMsg_C>() - 168usize];
    ["Alignment of ConstDynEffectorMsg_C"]
        [::core::mem::align_of::<ConstDynEffectorMsg_C>() - 8usize];
    ["Offset of field: ConstDynEffectorMsg_C::header"]
        [::core::mem::offset_of!(ConstDynEffectorMsg_C, header) - 0usize];
    ["Offset of field: ConstDynEffectorMsg_C::data"]
        [::core::mem::offset_of!(ConstDynEffectorMsg_C, data) - 32usize];
    ["Offset of field: ConstDynEffectorMsg_C::dataPointer"]
        [::core::mem::offset_of!(ConstDynEffectorMsg_C, dataPointer) - 152usize];
    ["Offset of field: ConstDynEffectorMsg_C::headerPointer"]
        [::core::mem::offset_of!(ConstDynEffectorMsg_C, headerPointer) - 160usize];
};
impl Default for ConstDynEffectorMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to store current measurement"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CurrentMsg {
    #[doc = "!< [A] Amps"]
    pub current: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CurrentMsg"][::core::mem::size_of::<CurrentMsg>() - 8usize];
    ["Alignment of CurrentMsg"][::core::mem::align_of::<CurrentMsg>() - 8usize];
    ["Offset of field: CurrentMsg::current"]
        [::core::mem::offset_of!(CurrentMsg, current) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CurrentMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: CurrentMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut CurrentMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CurrentMsg_C"][::core::mem::size_of::<CurrentMsg_C>() - 56usize];
    ["Alignment of CurrentMsg_C"][::core::mem::align_of::<CurrentMsg_C>() - 8usize];
    ["Offset of field: CurrentMsg_C::header"]
        [::core::mem::offset_of!(CurrentMsg_C, header) - 0usize];
    ["Offset of field: CurrentMsg_C::data"]
        [::core::mem::offset_of!(CurrentMsg_C, data) - 32usize];
    ["Offset of field: CurrentMsg_C::dataPointer"]
        [::core::mem::offset_of!(CurrentMsg_C, dataPointer) - 40usize];
    ["Offset of field: CurrentMsg_C::headerPointer"]
        [::core::mem::offset_of!(CurrentMsg_C, headerPointer) - 48usize];
};
impl Default for CurrentMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message for reporting the science or telemetry data produced or consumed by a module."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DataNodeUsageMsg {
    #[doc = "!< data name"]
    pub dataName: [::core::ffi::c_char; 128usize],
    #[doc = "!< [bits/s] Data usage by the message writer; positive for data generators, negative for data sinks"]
    pub baudRate: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DataNodeUsageMsg"]
        [::core::mem::size_of::<DataNodeUsageMsg>() - 136usize];
    ["Alignment of DataNodeUsageMsg"]
        [::core::mem::align_of::<DataNodeUsageMsg>() - 8usize];
    ["Offset of field: DataNodeUsageMsg::dataName"]
        [::core::mem::offset_of!(DataNodeUsageMsg, dataName) - 0usize];
    ["Offset of field: DataNodeUsageMsg::baudRate"]
        [::core::mem::offset_of!(DataNodeUsageMsg, baudRate) - 128usize];
};
impl Default for DataNodeUsageMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DataNodeUsageMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: DataNodeUsageMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut DataNodeUsageMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DataNodeUsageMsg_C"][::core::mem::size_of::<DataNodeUsageMsg_C>() - 184usize];
    ["Alignment of DataNodeUsageMsg_C"][::core::mem::align_of::<DataNodeUsageMsg_C>() - 8usize];
    ["Offset of field: DataNodeUsageMsg_C::header"]
        [::core::mem::offset_of!(DataNodeUsageMsg_C, header) - 0usize];
    ["Offset of field: DataNodeUsageMsg_C::data"]
        [::core::mem::offset_of!(DataNodeUsageMsg_C, data) - 32usize];
    ["Offset of field: DataNodeUsageMsg_C::dataPointer"]
        [::core::mem::offset_of!(DataNodeUsageMsg_C, dataPointer) - 168usize];
    ["Offset of field: DataNodeUsageMsg_C::headerPointer"]
        [::core::mem::offset_of!(DataNodeUsageMsg_C, headerPointer) - 176usize];
};
impl Default for DataNodeUsageMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define a desired velocity for a maneuver in the inertial frame"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DesiredVelocityMsg {
    #[doc = "!< [m/s] Desired velocity in inertial frame N"]
    pub vDesired_N: [f64; 3usize],
    #[doc = "!< [s] Time of maneuver"]
    pub maneuverTime: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DesiredVelocityMsg"]
        [::core::mem::size_of::<DesiredVelocityMsg>() - 32usize];
    ["Alignment of DesiredVelocityMsg"]
        [::core::mem::align_of::<DesiredVelocityMsg>() - 8usize];
    ["Offset of field: DesiredVelocityMsg::vDesired_N"]
        [::core::mem::offset_of!(DesiredVelocityMsg, vDesired_N) - 0usize];
    ["Offset of field: DesiredVelocityMsg::maneuverTime"]
        [::core::mem::offset_of!(DesiredVelocityMsg, maneuverTime) - 24usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DesiredVelocityMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: DesiredVelocityMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut DesiredVelocityMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DesiredVelocityMsg_C"][::core::mem::size_of::<DesiredVelocityMsg_C>() - 80usize];
    ["Alignment of DesiredVelocityMsg_C"][::core::mem::align_of::<DesiredVelocityMsg_C>() - 8usize];
    ["Offset of field: DesiredVelocityMsg_C::header"]
        [::core::mem::offset_of!(DesiredVelocityMsg_C, header) - 0usize];
    ["Offset of field: DesiredVelocityMsg_C::data"]
        [::core::mem::offset_of!(DesiredVelocityMsg_C, data) - 32usize];
    ["Offset of field: DesiredVelocityMsg_C::dataPointer"]
        [::core::mem::offset_of!(DesiredVelocityMsg_C, dataPointer) - 64usize];
    ["Offset of field: DesiredVelocityMsg_C::headerPointer"]
        [::core::mem::offset_of!(DesiredVelocityMsg_C, headerPointer) - 72usize];
};
impl Default for DesiredVelocityMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! @brief Device command message used to change the state of instruments."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DeviceCmdMsg {
    #[doc = "!< device command; 0 is off, >0 commands other states"]
    pub deviceCmd: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceCmdMsg"][::core::mem::size_of::<DeviceCmdMsg>() - 8usize];
    ["Alignment of DeviceCmdMsg"][::core::mem::align_of::<DeviceCmdMsg>() - 8usize];
    ["Offset of field: DeviceCmdMsg::deviceCmd"]
        [::core::mem::offset_of!(DeviceCmdMsg, deviceCmd) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeviceCmdMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: DeviceCmdMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut DeviceCmdMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceCmdMsg_C"][::core::mem::size_of::<DeviceCmdMsg_C>() - 56usize];
    ["Alignment of DeviceCmdMsg_C"][::core::mem::align_of::<DeviceCmdMsg_C>() - 8usize];
    ["Offset of field: DeviceCmdMsg_C::header"]
        [::core::mem::offset_of!(DeviceCmdMsg_C, header) - 0usize];
    ["Offset of field: DeviceCmdMsg_C::data"]
        [::core::mem::offset_of!(DeviceCmdMsg_C, data) - 32usize];
    ["Offset of field: DeviceCmdMsg_C::dataPointer"]
        [::core::mem::offset_of!(DeviceCmdMsg_C, dataPointer) - 40usize];
    ["Offset of field: DeviceCmdMsg_C::headerPointer"]
        [::core::mem::offset_of!(DeviceCmdMsg_C, headerPointer) - 48usize];
};
impl Default for DeviceCmdMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const On: deviceState = 1;
pub const Off: deviceState = 0;
pub type deviceState = ::core::ffi::c_uint;
#[doc = "! @brief Power node command message used to change the state of power modules."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeviceStatusMsg {
    #[doc = "!< device status indicator; 0 is off, 1 is on"]
    pub deviceStatus: deviceState,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceStatusMsg"][::core::mem::size_of::<DeviceStatusMsg>() - 4usize];
    ["Alignment of DeviceStatusMsg"]
        [::core::mem::align_of::<DeviceStatusMsg>() - 4usize];
    ["Offset of field: DeviceStatusMsg::deviceStatus"]
        [::core::mem::offset_of!(DeviceStatusMsg, deviceStatus) - 0usize];
};
impl Default for DeviceStatusMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeviceStatusMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: DeviceStatusMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut DeviceStatusMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceStatusMsg_C"][::core::mem::size_of::<DeviceStatusMsg_C>() - 56usize];
    ["Alignment of DeviceStatusMsg_C"][::core::mem::align_of::<DeviceStatusMsg_C>() - 8usize];
    ["Offset of field: DeviceStatusMsg_C::header"]
        [::core::mem::offset_of!(DeviceStatusMsg_C, header) - 0usize];
    ["Offset of field: DeviceStatusMsg_C::data"]
        [::core::mem::offset_of!(DeviceStatusMsg_C, data) - 32usize];
    ["Offset of field: DeviceStatusMsg_C::dataPointer"]
        [::core::mem::offset_of!(DeviceStatusMsg_C, dataPointer) - 40usize];
    ["Offset of field: DeviceStatusMsg_C::headerPointer"]
        [::core::mem::offset_of!(DeviceStatusMsg_C, headerPointer) - 48usize];
};
impl Default for DeviceStatusMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output of the sub-module.  This is the same\noutput message that is used by all sub-modules in the module folder."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DipoleRequestBodyMsg {
    #[doc = "!< [A-m2] desired net magnetic torque bar dipole in the Body frame."]
    pub dipole_B: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DipoleRequestBodyMsg"]
        [::core::mem::size_of::<DipoleRequestBodyMsg>() - 24usize];
    ["Alignment of DipoleRequestBodyMsg"]
        [::core::mem::align_of::<DipoleRequestBodyMsg>() - 8usize];
    ["Offset of field: DipoleRequestBodyMsg::dipole_B"]
        [::core::mem::offset_of!(DipoleRequestBodyMsg, dipole_B) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DipoleRequestBodyMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: DipoleRequestBodyMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut DipoleRequestBodyMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DipoleRequestBodyMsg_C"][::core::mem::size_of::<DipoleRequestBodyMsg_C>() - 72usize];
    ["Alignment of DipoleRequestBodyMsg_C"]
        [::core::mem::align_of::<DipoleRequestBodyMsg_C>() - 8usize];
    ["Offset of field: DipoleRequestBodyMsg_C::header"]
        [::core::mem::offset_of!(DipoleRequestBodyMsg_C, header) - 0usize];
    ["Offset of field: DipoleRequestBodyMsg_C::data"]
        [::core::mem::offset_of!(DipoleRequestBodyMsg_C, data) - 32usize];
    ["Offset of field: DipoleRequestBodyMsg_C::dataPointer"]
        [::core::mem::offset_of!(DipoleRequestBodyMsg_C, dataPointer) - 56usize];
    ["Offset of field: DipoleRequestBodyMsg_C::headerPointer"]
        [::core::mem::offset_of!(DipoleRequestBodyMsg_C, headerPointer) - 64usize];
};
impl Default for DipoleRequestBodyMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message for reporting downlink performance and data handling metrics"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DownlinkHandlingMsg {
    #[doc = "!< [-]     1 if link-quality inputs are valid for downlink calculations"]
    pub linkActive: u32,
    #[doc = "!< [-]     Selected receiver antenna index (1, 2) or 0 if none"]
    pub receiverIndex: u32,
    #[doc = "!< [-]     Maximum transmission attempts per packet in the ARQ model"]
    pub maxRetransmissions: u64,
    #[doc = "!< [-]     Storage-removal policy (0=REMOVE_ATTEMPTED, 1=REMOVE_DELIVERED_ONLY)"]
    pub removalPolicy: u32,
    #[doc = "!< [-]     Name of the selected transmitting antenna"]
    pub transmitterAntennaName: [::core::ffi::c_char; 20usize],
    #[doc = "!< [-]     Name of the selected receiving antenna"]
    pub receiverAntennaName: [::core::ffi::c_char; 20usize],
    #[doc = "!< [-]     Name of the data partition currently downlinked"]
    pub dataName: [::core::ffi::c_char; 128usize],
    #[doc = "!< [s]     Module integration timestep"]
    pub timeStep: f64,
    #[doc = "!< [Hz]    Link overlap bandwidth used in the calculation"]
    pub bandwidth: f64,
    #[doc = "!< [bit/s] Requested channel bit rate"]
    pub bitRateRequest: f64,
    #[doc = "!< [bit]   Packet size used for BER-to-PER conversion"]
    pub packetSizeBits: f64,
    #[doc = "!< [-]     Selected C/N ratio (linear)"]
    pub cnr: f64,
    #[doc = "!< [dB]    Selected C/N ratio in decibel"]
    pub cnr_dB: f64,
    #[doc = "!< [dBHz]  Carrier-to-noise density ratio"]
    pub cNo_dBHz: f64,
    #[doc = "!< [dB]    Energy-per-bit to noise-density ratio"]
    pub ebN0_dB: f64,
    #[doc = "!< [-]     Bit error rate"]
    pub ber: f64,
    #[doc = "!< [-]     Packet error rate"]
    pub per: f64,
    #[doc = "!< [-]     Packet success probability within max transmission attempts"]
    pub packetSuccessProb: f64,
    #[doc = "!< [-]     Packet drop probability within max transmission attempts"]
    pub packetDropProb: f64,
    #[doc = "!< [-]     Expected number of attempts needed to complete one source packet"]
    pub expectedAttemptsPerPacket: f64,
    #[doc = "!< [bit/s] Attempted channel transmission rate including retransmissions"]
    pub attemptedDataRate: f64,
    #[doc = "!< [bit/s] Data removed from spacecraft storage per selected removal policy"]
    pub storageRemovalRate: f64,
    #[doc = "!< [bit/s] Data delivered successfully to receiver"]
    pub deliveredDataRate: f64,
    #[doc = "!< [bit/s] Data dropped after reaching retransmission limit"]
    pub droppedDataRate: f64,
    #[doc = "!< [bit]   Data available in selected storage partition at start of step"]
    pub availableDataBits: f64,
    #[doc = "!< [bit]   Estimated remaining data in selected partition after this step"]
    pub estimatedRemainingDataBits: f64,
    #[doc = "!< [bit]   Cumulative attempted bits including retransmissions"]
    pub cumulativeAttemptedBits: f64,
    #[doc = "!< [bit]   Cumulative bits removed from storage"]
    pub cumulativeRemovedBits: f64,
    #[doc = "!< [bit]   Cumulative successfully delivered bits"]
    pub cumulativeDeliveredBits: f64,
    #[doc = "!< [bit]   Cumulative dropped bits"]
    pub cumulativeDroppedBits: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DownlinkHandlingMsg"]
        [::core::mem::size_of::<DownlinkHandlingMsg>() - 376usize];
    ["Alignment of DownlinkHandlingMsg"]
        [::core::mem::align_of::<DownlinkHandlingMsg>() - 8usize];
    ["Offset of field: DownlinkHandlingMsg::linkActive"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, linkActive) - 0usize];
    ["Offset of field: DownlinkHandlingMsg::receiverIndex"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, receiverIndex) - 4usize];
    ["Offset of field: DownlinkHandlingMsg::maxRetransmissions"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, maxRetransmissions) - 8usize];
    ["Offset of field: DownlinkHandlingMsg::removalPolicy"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, removalPolicy) - 16usize];
    ["Offset of field: DownlinkHandlingMsg::transmitterAntennaName"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, transmitterAntennaName) - 20usize];
    ["Offset of field: DownlinkHandlingMsg::receiverAntennaName"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, receiverAntennaName) - 40usize];
    ["Offset of field: DownlinkHandlingMsg::dataName"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, dataName) - 60usize];
    ["Offset of field: DownlinkHandlingMsg::timeStep"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, timeStep) - 192usize];
    ["Offset of field: DownlinkHandlingMsg::bandwidth"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, bandwidth) - 200usize];
    ["Offset of field: DownlinkHandlingMsg::bitRateRequest"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, bitRateRequest) - 208usize];
    ["Offset of field: DownlinkHandlingMsg::packetSizeBits"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, packetSizeBits) - 216usize];
    ["Offset of field: DownlinkHandlingMsg::cnr"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, cnr) - 224usize];
    ["Offset of field: DownlinkHandlingMsg::cnr_dB"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, cnr_dB) - 232usize];
    ["Offset of field: DownlinkHandlingMsg::cNo_dBHz"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, cNo_dBHz) - 240usize];
    ["Offset of field: DownlinkHandlingMsg::ebN0_dB"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, ebN0_dB) - 248usize];
    ["Offset of field: DownlinkHandlingMsg::ber"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, ber) - 256usize];
    ["Offset of field: DownlinkHandlingMsg::per"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, per) - 264usize];
    ["Offset of field: DownlinkHandlingMsg::packetSuccessProb"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, packetSuccessProb) - 272usize];
    ["Offset of field: DownlinkHandlingMsg::packetDropProb"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, packetDropProb) - 280usize];
    ["Offset of field: DownlinkHandlingMsg::expectedAttemptsPerPacket"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, expectedAttemptsPerPacket) - 288usize];
    ["Offset of field: DownlinkHandlingMsg::attemptedDataRate"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, attemptedDataRate) - 296usize];
    ["Offset of field: DownlinkHandlingMsg::storageRemovalRate"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, storageRemovalRate) - 304usize];
    ["Offset of field: DownlinkHandlingMsg::deliveredDataRate"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, deliveredDataRate) - 312usize];
    ["Offset of field: DownlinkHandlingMsg::droppedDataRate"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, droppedDataRate) - 320usize];
    ["Offset of field: DownlinkHandlingMsg::availableDataBits"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, availableDataBits) - 328usize];
    ["Offset of field: DownlinkHandlingMsg::estimatedRemainingDataBits"][::core::mem::offset_of!(
        DownlinkHandlingMsg,
        estimatedRemainingDataBits
    ) - 336usize];
    ["Offset of field: DownlinkHandlingMsg::cumulativeAttemptedBits"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, cumulativeAttemptedBits) - 344usize];
    ["Offset of field: DownlinkHandlingMsg::cumulativeRemovedBits"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, cumulativeRemovedBits) - 352usize];
    ["Offset of field: DownlinkHandlingMsg::cumulativeDeliveredBits"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, cumulativeDeliveredBits) - 360usize];
    ["Offset of field: DownlinkHandlingMsg::cumulativeDroppedBits"]
        [::core::mem::offset_of!(DownlinkHandlingMsg, cumulativeDroppedBits) - 368usize];
};
impl Default for DownlinkHandlingMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DownlinkHandlingMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: DownlinkHandlingMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut DownlinkHandlingMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DownlinkHandlingMsg_C"][::core::mem::size_of::<DownlinkHandlingMsg_C>() - 424usize];
    ["Alignment of DownlinkHandlingMsg_C"]
        [::core::mem::align_of::<DownlinkHandlingMsg_C>() - 8usize];
    ["Offset of field: DownlinkHandlingMsg_C::header"]
        [::core::mem::offset_of!(DownlinkHandlingMsg_C, header) - 0usize];
    ["Offset of field: DownlinkHandlingMsg_C::data"]
        [::core::mem::offset_of!(DownlinkHandlingMsg_C, data) - 32usize];
    ["Offset of field: DownlinkHandlingMsg_C::dataPointer"]
        [::core::mem::offset_of!(DownlinkHandlingMsg_C, dataPointer) - 408usize];
    ["Offset of field: DownlinkHandlingMsg_C::headerPointer"]
        [::core::mem::offset_of!(DownlinkHandlingMsg_C, headerPointer) - 416usize];
};
impl Default for DownlinkHandlingMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! @brief Container for basic drag parameters."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DragGeometryMsg {
    #[doc = "!< [m^2] Area of spacecraft projected in velocity direction"]
    pub projectedArea: f64,
    #[doc = "!< [-]   Nondimensional drag coefficient"]
    pub dragCoeff: f64,
    #[doc = "!< [m]   Position of center of pressure relative to the center of frame S, given in frame S [m]"]
    pub r_CP_S: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DragGeometryMsg"][::core::mem::size_of::<DragGeometryMsg>() - 40usize];
    ["Alignment of DragGeometryMsg"]
        [::core::mem::align_of::<DragGeometryMsg>() - 8usize];
    ["Offset of field: DragGeometryMsg::projectedArea"]
        [::core::mem::offset_of!(DragGeometryMsg, projectedArea) - 0usize];
    ["Offset of field: DragGeometryMsg::dragCoeff"]
        [::core::mem::offset_of!(DragGeometryMsg, dragCoeff) - 8usize];
    ["Offset of field: DragGeometryMsg::r_CP_S"]
        [::core::mem::offset_of!(DragGeometryMsg, r_CP_S) - 16usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DragGeometryMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: DragGeometryMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut DragGeometryMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DragGeometryMsg_C"][::core::mem::size_of::<DragGeometryMsg_C>() - 88usize];
    ["Alignment of DragGeometryMsg_C"][::core::mem::align_of::<DragGeometryMsg_C>() - 8usize];
    ["Offset of field: DragGeometryMsg_C::header"]
        [::core::mem::offset_of!(DragGeometryMsg_C, header) - 0usize];
    ["Offset of field: DragGeometryMsg_C::data"]
        [::core::mem::offset_of!(DragGeometryMsg_C, data) - 32usize];
    ["Offset of field: DragGeometryMsg_C::dataPointer"]
        [::core::mem::offset_of!(DragGeometryMsg_C, dataPointer) - 72usize];
    ["Offset of field: DragGeometryMsg_C::headerPointer"]
        [::core::mem::offset_of!(DragGeometryMsg_C, headerPointer) - 80usize];
};
impl Default for DragGeometryMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Input burn command structure used to configure the burn"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DvBurnCmdMsg {
    #[doc = "!< [m/s] The commanded DV we need in inertial"]
    pub dvInrtlCmd: [f64; 3usize],
    #[doc = "!< [-] The commanded vector we need to rotate about"]
    pub dvRotVecUnit: [f64; 3usize],
    #[doc = "!< [r/s] The commanded rotation rate for the vector"]
    pub dvRotVecMag: f64,
    #[doc = "!< [ns]  The commanded time to start the burn"]
    pub burnStartTime: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DvBurnCmdMsg"][::core::mem::size_of::<DvBurnCmdMsg>() - 64usize];
    ["Alignment of DvBurnCmdMsg"][::core::mem::align_of::<DvBurnCmdMsg>() - 8usize];
    ["Offset of field: DvBurnCmdMsg::dvInrtlCmd"]
        [::core::mem::offset_of!(DvBurnCmdMsg, dvInrtlCmd) - 0usize];
    ["Offset of field: DvBurnCmdMsg::dvRotVecUnit"]
        [::core::mem::offset_of!(DvBurnCmdMsg, dvRotVecUnit) - 24usize];
    ["Offset of field: DvBurnCmdMsg::dvRotVecMag"]
        [::core::mem::offset_of!(DvBurnCmdMsg, dvRotVecMag) - 48usize];
    ["Offset of field: DvBurnCmdMsg::burnStartTime"]
        [::core::mem::offset_of!(DvBurnCmdMsg, burnStartTime) - 56usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DvBurnCmdMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: DvBurnCmdMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut DvBurnCmdMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DvBurnCmdMsg_C"][::core::mem::size_of::<DvBurnCmdMsg_C>() - 112usize];
    ["Alignment of DvBurnCmdMsg_C"][::core::mem::align_of::<DvBurnCmdMsg_C>() - 8usize];
    ["Offset of field: DvBurnCmdMsg_C::header"]
        [::core::mem::offset_of!(DvBurnCmdMsg_C, header) - 0usize];
    ["Offset of field: DvBurnCmdMsg_C::data"]
        [::core::mem::offset_of!(DvBurnCmdMsg_C, data) - 32usize];
    ["Offset of field: DvBurnCmdMsg_C::dataPointer"]
        [::core::mem::offset_of!(DvBurnCmdMsg_C, dataPointer) - 96usize];
    ["Offset of field: DvBurnCmdMsg_C::headerPointer"]
        [::core::mem::offset_of!(DvBurnCmdMsg_C, headerPointer) - 104usize];
};
impl Default for DvBurnCmdMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief DV executation data structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DvExecutionDataMsg {
    #[doc = "< [-] Flag indicating whether burn is executing"]
    pub burnExecuting: u32,
    #[doc = "< [-] Flag indicating whether the burn is complete"]
    pub burnComplete: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DvExecutionDataMsg"]
        [::core::mem::size_of::<DvExecutionDataMsg>() - 8usize];
    ["Alignment of DvExecutionDataMsg"]
        [::core::mem::align_of::<DvExecutionDataMsg>() - 4usize];
    ["Offset of field: DvExecutionDataMsg::burnExecuting"]
        [::core::mem::offset_of!(DvExecutionDataMsg, burnExecuting) - 0usize];
    ["Offset of field: DvExecutionDataMsg::burnComplete"]
        [::core::mem::offset_of!(DvExecutionDataMsg, burnComplete) - 4usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DvExecutionDataMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: DvExecutionDataMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut DvExecutionDataMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DvExecutionDataMsg_C"][::core::mem::size_of::<DvExecutionDataMsg_C>() - 56usize];
    ["Alignment of DvExecutionDataMsg_C"][::core::mem::align_of::<DvExecutionDataMsg_C>() - 8usize];
    ["Offset of field: DvExecutionDataMsg_C::header"]
        [::core::mem::offset_of!(DvExecutionDataMsg_C, header) - 0usize];
    ["Offset of field: DvExecutionDataMsg_C::data"]
        [::core::mem::offset_of!(DvExecutionDataMsg_C, data) - 32usize];
    ["Offset of field: DvExecutionDataMsg_C::dataPointer"]
        [::core::mem::offset_of!(DvExecutionDataMsg_C, dataPointer) - 40usize];
    ["Offset of field: DvExecutionDataMsg_C::headerPointer"]
        [::core::mem::offset_of!(DvExecutionDataMsg_C, headerPointer) - 48usize];
};
impl Default for DvExecutionDataMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Output message payload for Earth radiation pressure calculations\n\n This message contains the total albedo and infrared radiation fluxes at the satellite,\n along with flux-weighted net force direction vectors for each component. These values\n are used as inputs to the facetERPDynamicEffector module.\n\n The direction vectors account for Earth's extended source nature, providing the correct\n net force direction rather than assuming parallel rays or anti-nadir direction."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct EarthRadiationMsg {
    #[doc = "!< [W/m^2] total (reflected solar) flux"]
    pub albedoFlux: f64,
    #[doc = "!< [W/m^2] total IR flux"]
    pub irFlux: f64,
    #[doc = "!< [-] flux-weighted net albedo force direction,\n!<     inertial frame N; [0,0,0] if albedoFlux==0"]
    pub albedoDir_N: [f64; 3usize],
    #[doc = "!< [-] flux-weighted net IR force direction,\n!<     inertial frame N; [0,0,0] if irFlux==0"]
    pub irDir_N: [f64; 3usize],
    #[doc = "!< [ns] simulation time of validity"]
    pub timeTag: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EarthRadiationMsg"]
        [::core::mem::size_of::<EarthRadiationMsg>() - 72usize];
    ["Alignment of EarthRadiationMsg"]
        [::core::mem::align_of::<EarthRadiationMsg>() - 8usize];
    ["Offset of field: EarthRadiationMsg::albedoFlux"]
        [::core::mem::offset_of!(EarthRadiationMsg, albedoFlux) - 0usize];
    ["Offset of field: EarthRadiationMsg::irFlux"]
        [::core::mem::offset_of!(EarthRadiationMsg, irFlux) - 8usize];
    ["Offset of field: EarthRadiationMsg::albedoDir_N"]
        [::core::mem::offset_of!(EarthRadiationMsg, albedoDir_N) - 16usize];
    ["Offset of field: EarthRadiationMsg::irDir_N"]
        [::core::mem::offset_of!(EarthRadiationMsg, irDir_N) - 40usize];
    ["Offset of field: EarthRadiationMsg::timeTag"]
        [::core::mem::offset_of!(EarthRadiationMsg, timeTag) - 64usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EarthRadiationMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: EarthRadiationMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut EarthRadiationMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EarthRadiationMsg_C"][::core::mem::size_of::<EarthRadiationMsg_C>() - 120usize];
    ["Alignment of EarthRadiationMsg_C"][::core::mem::align_of::<EarthRadiationMsg_C>() - 8usize];
    ["Offset of field: EarthRadiationMsg_C::header"]
        [::core::mem::offset_of!(EarthRadiationMsg_C, header) - 0usize];
    ["Offset of field: EarthRadiationMsg_C::data"]
        [::core::mem::offset_of!(EarthRadiationMsg_C, data) - 32usize];
    ["Offset of field: EarthRadiationMsg_C::dataPointer"]
        [::core::mem::offset_of!(EarthRadiationMsg_C, dataPointer) - 104usize];
    ["Offset of field: EarthRadiationMsg_C::headerPointer"]
        [::core::mem::offset_of!(EarthRadiationMsg_C, headerPointer) - 112usize];
};
impl Default for EarthRadiationMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! @brief Eclipse illumination message definition."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct EclipseMsg {
    #[doc = "! Fraction of illumination due to eclipse. 0 = fully shadowed, 1 = fully illuminated."]
    pub shadowFactor: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EclipseMsg"][::core::mem::size_of::<EclipseMsg>() - 8usize];
    ["Alignment of EclipseMsg"][::core::mem::align_of::<EclipseMsg>() - 8usize];
    ["Offset of field: EclipseMsg::shadowFactor"]
        [::core::mem::offset_of!(EclipseMsg, shadowFactor) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EclipseMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: EclipseMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut EclipseMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EclipseMsg_C"][::core::mem::size_of::<EclipseMsg_C>() - 56usize];
    ["Alignment of EclipseMsg_C"][::core::mem::align_of::<EclipseMsg_C>() - 8usize];
    ["Offset of field: EclipseMsg_C::header"]
        [::core::mem::offset_of!(EclipseMsg_C, header) - 0usize];
    ["Offset of field: EclipseMsg_C::data"]
        [::core::mem::offset_of!(EclipseMsg_C, data) - 32usize];
    ["Offset of field: EclipseMsg_C::dataPointer"]
        [::core::mem::offset_of!(EclipseMsg_C, dataPointer) - 40usize];
    ["Offset of field: EclipseMsg_C::headerPointer"]
        [::core::mem::offset_of!(EclipseMsg_C, headerPointer) - 48usize];
};
impl Default for EclipseMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message that defines the parameters of an onboard electron beam gun."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ElectronBeamMsg {
    #[doc = "!< [eV] Energy of the primary electron beam"]
    pub energyEB: f64,
    #[doc = "!< [A]  Primary beam current (positive value represents electrons leaving)"]
    pub currentEB: f64,
    #[doc = "!< [-] A number from [0,1] representing the fraction of current actually reaching the target (to simulate beam divergence)"]
    pub alphaEB: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ElectronBeamMsg"][::core::mem::size_of::<ElectronBeamMsg>() - 24usize];
    ["Alignment of ElectronBeamMsg"]
        [::core::mem::align_of::<ElectronBeamMsg>() - 8usize];
    ["Offset of field: ElectronBeamMsg::energyEB"]
        [::core::mem::offset_of!(ElectronBeamMsg, energyEB) - 0usize];
    ["Offset of field: ElectronBeamMsg::currentEB"]
        [::core::mem::offset_of!(ElectronBeamMsg, currentEB) - 8usize];
    ["Offset of field: ElectronBeamMsg::alphaEB"]
        [::core::mem::offset_of!(ElectronBeamMsg, alphaEB) - 16usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ElectronBeamMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ElectronBeamMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ElectronBeamMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ElectronBeamMsg_C"][::core::mem::size_of::<ElectronBeamMsg_C>() - 72usize];
    ["Alignment of ElectronBeamMsg_C"][::core::mem::align_of::<ElectronBeamMsg_C>() - 8usize];
    ["Offset of field: ElectronBeamMsg_C::header"]
        [::core::mem::offset_of!(ElectronBeamMsg_C, header) - 0usize];
    ["Offset of field: ElectronBeamMsg_C::data"]
        [::core::mem::offset_of!(ElectronBeamMsg_C, data) - 32usize];
    ["Offset of field: ElectronBeamMsg_C::dataPointer"]
        [::core::mem::offset_of!(ElectronBeamMsg_C, dataPointer) - 56usize];
    ["Offset of field: ElectronBeamMsg_C::headerPointer"]
        [::core::mem::offset_of!(ElectronBeamMsg_C, headerPointer) - 64usize];
};
impl Default for ElectronBeamMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message structure used to write ephemeris states out to other modules"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct EphemerisMsg {
    #[doc = "!< [m] Position of orbital body"]
    pub r_BdyZero_N: [f64; 3usize],
    #[doc = "!< [m/s] Velocity of orbital body"]
    pub v_BdyZero_N: [f64; 3usize],
    #[doc = "!< MRP attitude of the orbital body fixed frame relative to inertial"]
    pub sigma_BN: [f64; 3usize],
    #[doc = "!< [r/s] angular velocity of the orbital body relative to inertial"]
    pub omega_BN_B: [f64; 3usize],
    #[doc = "!< [s] vehicle Time-tag for state"]
    pub timeTag: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EphemerisMsg"][::core::mem::size_of::<EphemerisMsg>() - 104usize];
    ["Alignment of EphemerisMsg"][::core::mem::align_of::<EphemerisMsg>() - 8usize];
    ["Offset of field: EphemerisMsg::r_BdyZero_N"]
        [::core::mem::offset_of!(EphemerisMsg, r_BdyZero_N) - 0usize];
    ["Offset of field: EphemerisMsg::v_BdyZero_N"]
        [::core::mem::offset_of!(EphemerisMsg, v_BdyZero_N) - 24usize];
    ["Offset of field: EphemerisMsg::sigma_BN"]
        [::core::mem::offset_of!(EphemerisMsg, sigma_BN) - 48usize];
    ["Offset of field: EphemerisMsg::omega_BN_B"]
        [::core::mem::offset_of!(EphemerisMsg, omega_BN_B) - 72usize];
    ["Offset of field: EphemerisMsg::timeTag"]
        [::core::mem::offset_of!(EphemerisMsg, timeTag) - 96usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EphemerisMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: EphemerisMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut EphemerisMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EphemerisMsg_C"][::core::mem::size_of::<EphemerisMsg_C>() - 152usize];
    ["Alignment of EphemerisMsg_C"][::core::mem::align_of::<EphemerisMsg_C>() - 8usize];
    ["Offset of field: EphemerisMsg_C::header"]
        [::core::mem::offset_of!(EphemerisMsg_C, header) - 0usize];
    ["Offset of field: EphemerisMsg_C::data"]
        [::core::mem::offset_of!(EphemerisMsg_C, data) - 32usize];
    ["Offset of field: EphemerisMsg_C::dataPointer"]
        [::core::mem::offset_of!(EphemerisMsg_C, dataPointer) - 136usize];
    ["Offset of field: EphemerisMsg_C::headerPointer"]
        [::core::mem::offset_of!(EphemerisMsg_C, headerPointer) - 144usize];
};
impl Default for EphemerisMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the the epoch date and time message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct EpochMsg {
    #[doc = "!< year, integer"]
    pub year: ::core::ffi::c_int,
    #[doc = "!< month, integer"]
    pub month: ::core::ffi::c_int,
    #[doc = "!< day, integer"]
    pub day: ::core::ffi::c_int,
    #[doc = "!< hours, integer"]
    pub hours: ::core::ffi::c_int,
    #[doc = "!< minutes, integer"]
    pub minutes: ::core::ffi::c_int,
    #[doc = "!< seconds, double"]
    pub seconds: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EpochMsg"][::core::mem::size_of::<EpochMsg>() - 32usize];
    ["Alignment of EpochMsg"][::core::mem::align_of::<EpochMsg>() - 8usize];
    ["Offset of field: EpochMsg::year"]
        [::core::mem::offset_of!(EpochMsg, year) - 0usize];
    ["Offset of field: EpochMsg::month"]
        [::core::mem::offset_of!(EpochMsg, month) - 4usize];
    ["Offset of field: EpochMsg::day"]
        [::core::mem::offset_of!(EpochMsg, day) - 8usize];
    ["Offset of field: EpochMsg::hours"]
        [::core::mem::offset_of!(EpochMsg, hours) - 12usize];
    ["Offset of field: EpochMsg::minutes"]
        [::core::mem::offset_of!(EpochMsg, minutes) - 16usize];
    ["Offset of field: EpochMsg::seconds"]
        [::core::mem::offset_of!(EpochMsg, seconds) - 24usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EpochMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: EpochMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut EpochMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EpochMsg_C"][::core::mem::size_of::<EpochMsg_C>() - 80usize];
    ["Alignment of EpochMsg_C"][::core::mem::align_of::<EpochMsg_C>() - 8usize];
    ["Offset of field: EpochMsg_C::header"][::core::mem::offset_of!(EpochMsg_C, header) - 0usize];
    ["Offset of field: EpochMsg_C::data"]
        [::core::mem::offset_of!(EpochMsg_C, data) - 32usize];
    ["Offset of field: EpochMsg_C::dataPointer"]
        [::core::mem::offset_of!(EpochMsg_C, dataPointer) - 64usize];
    ["Offset of field: EpochMsg_C::headerPointer"]
        [::core::mem::offset_of!(EpochMsg_C, headerPointer) - 72usize];
};
impl Default for EpochMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message used to define a single facet geometry configuration message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FacetElementBodyMsg {
    #[doc = "!< [m^2] Facet area"]
    pub area: f64,
    #[doc = "!< [m] Facet center of pressure location wrt point B expressed in B frame components"]
    pub r_CopB_B: [f64; 3usize],
    #[doc = "!< [-] Facet normal vector expressed in hub B frame components"]
    pub nHat_B: [f64; 3usize],
    #[doc = "!< [-] Facet rotation axis expressed in hub B frame components"]
    pub rotHat_B: [f64; 3usize],
    #[doc = "!< [-] Facet diffuse reflection optical coefficient"]
    pub c_diffuse: f64,
    #[doc = "!< [-] Facet specular reflection optical coefficient"]
    pub c_specular: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FacetElementBodyMsg"]
        [::core::mem::size_of::<FacetElementBodyMsg>() - 96usize];
    ["Alignment of FacetElementBodyMsg"]
        [::core::mem::align_of::<FacetElementBodyMsg>() - 8usize];
    ["Offset of field: FacetElementBodyMsg::area"]
        [::core::mem::offset_of!(FacetElementBodyMsg, area) - 0usize];
    ["Offset of field: FacetElementBodyMsg::r_CopB_B"]
        [::core::mem::offset_of!(FacetElementBodyMsg, r_CopB_B) - 8usize];
    ["Offset of field: FacetElementBodyMsg::nHat_B"]
        [::core::mem::offset_of!(FacetElementBodyMsg, nHat_B) - 32usize];
    ["Offset of field: FacetElementBodyMsg::rotHat_B"]
        [::core::mem::offset_of!(FacetElementBodyMsg, rotHat_B) - 56usize];
    ["Offset of field: FacetElementBodyMsg::c_diffuse"]
        [::core::mem::offset_of!(FacetElementBodyMsg, c_diffuse) - 80usize];
    ["Offset of field: FacetElementBodyMsg::c_specular"]
        [::core::mem::offset_of!(FacetElementBodyMsg, c_specular) - 88usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FacetElementBodyMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: FacetElementBodyMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut FacetElementBodyMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FacetElementBodyMsg_C"][::core::mem::size_of::<FacetElementBodyMsg_C>() - 144usize];
    ["Alignment of FacetElementBodyMsg_C"]
        [::core::mem::align_of::<FacetElementBodyMsg_C>() - 8usize];
    ["Offset of field: FacetElementBodyMsg_C::header"]
        [::core::mem::offset_of!(FacetElementBodyMsg_C, header) - 0usize];
    ["Offset of field: FacetElementBodyMsg_C::data"]
        [::core::mem::offset_of!(FacetElementBodyMsg_C, data) - 32usize];
    ["Offset of field: FacetElementBodyMsg_C::dataPointer"]
        [::core::mem::offset_of!(FacetElementBodyMsg_C, dataPointer) - 128usize];
    ["Offset of field: FacetElementBodyMsg_C::headerPointer"]
        [::core::mem::offset_of!(FacetElementBodyMsg_C, headerPointer) - 136usize];
};
impl Default for FacetElementBodyMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message used to define a single facet geometry configuration message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FacetElementMsg {
    #[doc = "!< [m^2] Facet area"]
    pub area: f64,
    #[doc = "!< [m] Facet center of pressure location wrt facet frame origin point F"]
    pub r_CopF_F: [f64; 3usize],
    #[doc = "!< [-] Facet normal vector expressed in facet frame F components"]
    pub nHat_F: [f64; 3usize],
    #[doc = "!< [-] Facet rotation axis expressed in facet frame F components"]
    pub rotHat_F: [f64; 3usize],
    #[doc = "!< [-] Initial facet frame attitude relative to hub B frame"]
    pub dcm_F0B: [[f64; 3usize]; 3usize],
    #[doc = "!< [m] Facet location relative to hub frame origin point B"]
    pub r_FB_B: [f64; 3usize],
    #[doc = "!< [-] Facet diffuse reflection optical coefficient"]
    pub c_diffuse: f64,
    #[doc = "!< [-] Facet specular reflection optical coefficient"]
    pub c_specular: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FacetElementMsg"][::core::mem::size_of::<FacetElementMsg>() - 192usize];
    ["Alignment of FacetElementMsg"]
        [::core::mem::align_of::<FacetElementMsg>() - 8usize];
    ["Offset of field: FacetElementMsg::area"]
        [::core::mem::offset_of!(FacetElementMsg, area) - 0usize];
    ["Offset of field: FacetElementMsg::r_CopF_F"]
        [::core::mem::offset_of!(FacetElementMsg, r_CopF_F) - 8usize];
    ["Offset of field: FacetElementMsg::nHat_F"]
        [::core::mem::offset_of!(FacetElementMsg, nHat_F) - 32usize];
    ["Offset of field: FacetElementMsg::rotHat_F"]
        [::core::mem::offset_of!(FacetElementMsg, rotHat_F) - 56usize];
    ["Offset of field: FacetElementMsg::dcm_F0B"]
        [::core::mem::offset_of!(FacetElementMsg, dcm_F0B) - 80usize];
    ["Offset of field: FacetElementMsg::r_FB_B"]
        [::core::mem::offset_of!(FacetElementMsg, r_FB_B) - 152usize];
    ["Offset of field: FacetElementMsg::c_diffuse"]
        [::core::mem::offset_of!(FacetElementMsg, c_diffuse) - 176usize];
    ["Offset of field: FacetElementMsg::c_specular"]
        [::core::mem::offset_of!(FacetElementMsg, c_specular) - 184usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FacetElementMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: FacetElementMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut FacetElementMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FacetElementMsg_C"][::core::mem::size_of::<FacetElementMsg_C>() - 240usize];
    ["Alignment of FacetElementMsg_C"][::core::mem::align_of::<FacetElementMsg_C>() - 8usize];
    ["Offset of field: FacetElementMsg_C::header"]
        [::core::mem::offset_of!(FacetElementMsg_C, header) - 0usize];
    ["Offset of field: FacetElementMsg_C::data"]
        [::core::mem::offset_of!(FacetElementMsg_C, data) - 32usize];
    ["Offset of field: FacetElementMsg_C::dataPointer"]
        [::core::mem::offset_of!(FacetElementMsg_C, dataPointer) - 224usize];
    ["Offset of field: FacetElementMsg_C::headerPointer"]
        [::core::mem::offset_of!(FacetElementMsg_C, headerPointer) - 232usize];
};
impl Default for FacetElementMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A force vector applied at an MJScene site reference frame\n\n Sites are locations fixed on a body (in the context of MJScene) with an\n associated reference frame. This message represents a force that\n could be applied at this site and expressed on the site's reference frame."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ForceAtSiteMsg {
    #[doc = "!< [N] Force in Newtons"]
    pub force_S: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ForceAtSiteMsg"][::core::mem::size_of::<ForceAtSiteMsg>() - 24usize];
    ["Alignment of ForceAtSiteMsg"]
        [::core::mem::align_of::<ForceAtSiteMsg>() - 8usize];
    ["Offset of field: ForceAtSiteMsg::force_S"]
        [::core::mem::offset_of!(ForceAtSiteMsg, force_S) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ForceAtSiteMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ForceAtSiteMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ForceAtSiteMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ForceAtSiteMsg_C"][::core::mem::size_of::<ForceAtSiteMsg_C>() - 72usize];
    ["Alignment of ForceAtSiteMsg_C"][::core::mem::align_of::<ForceAtSiteMsg_C>() - 8usize];
    ["Offset of field: ForceAtSiteMsg_C::header"]
        [::core::mem::offset_of!(ForceAtSiteMsg_C, header) - 0usize];
    ["Offset of field: ForceAtSiteMsg_C::data"]
        [::core::mem::offset_of!(ForceAtSiteMsg_C, data) - 32usize];
    ["Offset of field: ForceAtSiteMsg_C::dataPointer"]
        [::core::mem::offset_of!(ForceAtSiteMsg_C, dataPointer) - 56usize];
    ["Offset of field: ForceAtSiteMsg_C::headerPointer"]
        [::core::mem::offset_of!(ForceAtSiteMsg_C, headerPointer) - 64usize];
};
impl Default for ForceAtSiteMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the individual fuel tank mass property message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FuelTankMsg {
    #[doc = "!< [kg], current fuel mass"]
    pub fuelMass: f64,
    #[doc = "!< [kg/s], current rate of change of fuel mass"]
    pub fuelMassDot: f64,
    #[doc = "!< [kg], maximum fuel mass capacity"]
    pub maxFuelMass: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FuelTankMsg"][::core::mem::size_of::<FuelTankMsg>() - 24usize];
    ["Alignment of FuelTankMsg"][::core::mem::align_of::<FuelTankMsg>() - 8usize];
    ["Offset of field: FuelTankMsg::fuelMass"]
        [::core::mem::offset_of!(FuelTankMsg, fuelMass) - 0usize];
    ["Offset of field: FuelTankMsg::fuelMassDot"]
        [::core::mem::offset_of!(FuelTankMsg, fuelMassDot) - 8usize];
    ["Offset of field: FuelTankMsg::maxFuelMass"]
        [::core::mem::offset_of!(FuelTankMsg, maxFuelMass) - 16usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FuelTankMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: FuelTankMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut FuelTankMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FuelTankMsg_C"][::core::mem::size_of::<FuelTankMsg_C>() - 72usize];
    ["Alignment of FuelTankMsg_C"][::core::mem::align_of::<FuelTankMsg_C>() - 8usize];
    ["Offset of field: FuelTankMsg_C::header"]
        [::core::mem::offset_of!(FuelTankMsg_C, header) - 0usize];
    ["Offset of field: FuelTankMsg_C::data"]
        [::core::mem::offset_of!(FuelTankMsg_C, data) - 32usize];
    ["Offset of field: FuelTankMsg_C::dataPointer"]
        [::core::mem::offset_of!(FuelTankMsg_C, dataPointer) - 56usize];
    ["Offset of field: FuelTankMsg_C::headerPointer"]
        [::core::mem::offset_of!(FuelTankMsg_C, headerPointer) - 64usize];
};
impl Default for FuelTankMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " gravity gradient torque message definition"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct GravityGradientMsg {
    #[doc = "!< [Nm] Gravity Gradient torque in body frame components"]
    pub gravityGradientTorque_B: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GravityGradientMsg"]
        [::core::mem::size_of::<GravityGradientMsg>() - 24usize];
    ["Alignment of GravityGradientMsg"]
        [::core::mem::align_of::<GravityGradientMsg>() - 8usize];
    ["Offset of field: GravityGradientMsg::gravityGradientTorque_B"]
        [::core::mem::offset_of!(GravityGradientMsg, gravityGradientTorque_B) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GravityGradientMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: GravityGradientMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut GravityGradientMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GravityGradientMsg_C"][::core::mem::size_of::<GravityGradientMsg_C>() - 72usize];
    ["Alignment of GravityGradientMsg_C"][::core::mem::align_of::<GravityGradientMsg_C>() - 8usize];
    ["Offset of field: GravityGradientMsg_C::header"]
        [::core::mem::offset_of!(GravityGradientMsg_C, header) - 0usize];
    ["Offset of field: GravityGradientMsg_C::data"]
        [::core::mem::offset_of!(GravityGradientMsg_C, data) - 32usize];
    ["Offset of field: GravityGradientMsg_C::dataPointer"]
        [::core::mem::offset_of!(GravityGradientMsg_C, dataPointer) - 56usize];
    ["Offset of field: GravityGradientMsg_C::headerPointer"]
        [::core::mem::offset_of!(GravityGradientMsg_C, headerPointer) - 64usize];
};
impl Default for GravityGradientMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message that defines the inertial location of a groundLocation at the current time."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct GroundStateMsg {
    #[doc = "!< Position vector of the location w.r.t. the inertial origin in the inertial frame"]
    pub r_LN_N: [f64; 3usize],
    #[doc = "!< Position vector of the location with respect to the planet center in the inertial frame"]
    pub r_LP_N: [f64; 3usize],
    #[doc = "!< [-] Surface normal vector from the target location in inertial coordinates"]
    pub rHat_LP_N: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GroundStateMsg"][::core::mem::size_of::<GroundStateMsg>() - 72usize];
    ["Alignment of GroundStateMsg"]
        [::core::mem::align_of::<GroundStateMsg>() - 8usize];
    ["Offset of field: GroundStateMsg::r_LN_N"]
        [::core::mem::offset_of!(GroundStateMsg, r_LN_N) - 0usize];
    ["Offset of field: GroundStateMsg::r_LP_N"]
        [::core::mem::offset_of!(GroundStateMsg, r_LP_N) - 24usize];
    ["Offset of field: GroundStateMsg::rHat_LP_N"]
        [::core::mem::offset_of!(GroundStateMsg, rHat_LP_N) - 48usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GroundStateMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: GroundStateMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut GroundStateMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GroundStateMsg_C"][::core::mem::size_of::<GroundStateMsg_C>() - 120usize];
    ["Alignment of GroundStateMsg_C"][::core::mem::align_of::<GroundStateMsg_C>() - 8usize];
    ["Offset of field: GroundStateMsg_C::header"]
        [::core::mem::offset_of!(GroundStateMsg_C, header) - 0usize];
    ["Offset of field: GroundStateMsg_C::data"]
        [::core::mem::offset_of!(GroundStateMsg_C, data) - 32usize];
    ["Offset of field: GroundStateMsg_C::dataPointer"]
        [::core::mem::offset_of!(GroundStateMsg_C, dataPointer) - 104usize];
    ["Offset of field: GroundStateMsg_C::headerPointer"]
        [::core::mem::offset_of!(GroundStateMsg_C, headerPointer) - 112usize];
};
impl Default for GroundStateMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief structure for filter-states output for the unscented kalman filter\nimplementation of the sunline state estimator"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct HeadingFilterMsg {
    #[doc = "< [s] Current time of validity for output"]
    pub timeTag: f64,
    #[doc = "< [-] Current covariance of the filter"]
    pub covar: [f64; 25usize],
    #[doc = "< [-] Current estimated state of the filter"]
    pub state: [f64; 5usize],
    #[doc = "< [-] Current deviation of the state from the reference state"]
    pub stateError: [f64; 5usize],
    #[doc = "< [-] PostFit Residuals"]
    pub postFitRes: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HeadingFilterMsg"]
        [::core::mem::size_of::<HeadingFilterMsg>() - 312usize];
    ["Alignment of HeadingFilterMsg"]
        [::core::mem::align_of::<HeadingFilterMsg>() - 8usize];
    ["Offset of field: HeadingFilterMsg::timeTag"]
        [::core::mem::offset_of!(HeadingFilterMsg, timeTag) - 0usize];
    ["Offset of field: HeadingFilterMsg::covar"]
        [::core::mem::offset_of!(HeadingFilterMsg, covar) - 8usize];
    ["Offset of field: HeadingFilterMsg::state"]
        [::core::mem::offset_of!(HeadingFilterMsg, state) - 208usize];
    ["Offset of field: HeadingFilterMsg::stateError"]
        [::core::mem::offset_of!(HeadingFilterMsg, stateError) - 248usize];
    ["Offset of field: HeadingFilterMsg::postFitRes"]
        [::core::mem::offset_of!(HeadingFilterMsg, postFitRes) - 288usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HeadingFilterMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: HeadingFilterMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut HeadingFilterMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HeadingFilterMsg_C"][::core::mem::size_of::<HeadingFilterMsg_C>() - 360usize];
    ["Alignment of HeadingFilterMsg_C"][::core::mem::align_of::<HeadingFilterMsg_C>() - 8usize];
    ["Offset of field: HeadingFilterMsg_C::header"]
        [::core::mem::offset_of!(HeadingFilterMsg_C, header) - 0usize];
    ["Offset of field: HeadingFilterMsg_C::data"]
        [::core::mem::offset_of!(HeadingFilterMsg_C, data) - 32usize];
    ["Offset of field: HeadingFilterMsg_C::dataPointer"]
        [::core::mem::offset_of!(HeadingFilterMsg_C, dataPointer) - 344usize];
    ["Offset of field: HeadingFilterMsg_C::headerPointer"]
        [::core::mem::offset_of!(HeadingFilterMsg_C, headerPointer) - 352usize];
};
impl Default for HeadingFilterMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for attitude reference generation"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct HillRelStateMsg {
    #[doc = "!< [m]  Relative position of the deputy to the chief in Hill-frame components"]
    pub r_DC_H: [f64; 3usize],
    #[doc = "!< [m/s]  Relative velocity of the deputy to the chief in Hill-frame components"]
    pub v_DC_H: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HillRelStateMsg"][::core::mem::size_of::<HillRelStateMsg>() - 48usize];
    ["Alignment of HillRelStateMsg"]
        [::core::mem::align_of::<HillRelStateMsg>() - 8usize];
    ["Offset of field: HillRelStateMsg::r_DC_H"]
        [::core::mem::offset_of!(HillRelStateMsg, r_DC_H) - 0usize];
    ["Offset of field: HillRelStateMsg::v_DC_H"]
        [::core::mem::offset_of!(HillRelStateMsg, v_DC_H) - 24usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HillRelStateMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: HillRelStateMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut HillRelStateMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HillRelStateMsg_C"][::core::mem::size_of::<HillRelStateMsg_C>() - 96usize];
    ["Alignment of HillRelStateMsg_C"][::core::mem::align_of::<HillRelStateMsg_C>() - 8usize];
    ["Offset of field: HillRelStateMsg_C::header"]
        [::core::mem::offset_of!(HillRelStateMsg_C, header) - 0usize];
    ["Offset of field: HillRelStateMsg_C::data"]
        [::core::mem::offset_of!(HillRelStateMsg_C, data) - 32usize];
    ["Offset of field: HillRelStateMsg_C::dataPointer"]
        [::core::mem::offset_of!(HillRelStateMsg_C, dataPointer) - 80usize];
    ["Offset of field: HillRelStateMsg_C::headerPointer"]
        [::core::mem::offset_of!(HillRelStateMsg_C, headerPointer) - 88usize];
};
impl Default for HillRelStateMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the individual Hinged Rigid Body  data message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct HingedRigidBodyMsg {
    #[doc = "!< [rad], panel angular displacement"]
    pub theta: f64,
    #[doc = "!< [rad/s], panel angular displacement rate"]
    pub thetaDot: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HingedRigidBodyMsg"]
        [::core::mem::size_of::<HingedRigidBodyMsg>() - 16usize];
    ["Alignment of HingedRigidBodyMsg"]
        [::core::mem::align_of::<HingedRigidBodyMsg>() - 8usize];
    ["Offset of field: HingedRigidBodyMsg::theta"]
        [::core::mem::offset_of!(HingedRigidBodyMsg, theta) - 0usize];
    ["Offset of field: HingedRigidBodyMsg::thetaDot"]
        [::core::mem::offset_of!(HingedRigidBodyMsg, thetaDot) - 8usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HingedRigidBodyMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: HingedRigidBodyMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut HingedRigidBodyMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HingedRigidBodyMsg_C"][::core::mem::size_of::<HingedRigidBodyMsg_C>() - 64usize];
    ["Alignment of HingedRigidBodyMsg_C"][::core::mem::align_of::<HingedRigidBodyMsg_C>() - 8usize];
    ["Offset of field: HingedRigidBodyMsg_C::header"]
        [::core::mem::offset_of!(HingedRigidBodyMsg_C, header) - 0usize];
    ["Offset of field: HingedRigidBodyMsg_C::data"]
        [::core::mem::offset_of!(HingedRigidBodyMsg_C, data) - 32usize];
    ["Offset of field: HingedRigidBodyMsg_C::dataPointer"]
        [::core::mem::offset_of!(HingedRigidBodyMsg_C, dataPointer) - 48usize];
    ["Offset of field: HingedRigidBodyMsg_C::headerPointer"]
        [::core::mem::offset_of!(HingedRigidBodyMsg_C, headerPointer) - 56usize];
};
impl Default for HingedRigidBodyMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Output structure for IMU structure in vehicle body frame"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IMUSensorBodyMsg {
    #[doc = "!< m/s Accumulated DVs in body"]
    pub DVFrameBody: [f64; 3usize],
    #[doc = "!< m/s2 Apparent acceleration of the body"]
    pub AccelBody: [f64; 3usize],
    #[doc = "!< r  Accumulated DRs in body"]
    pub DRFrameBody: [f64; 3usize],
    #[doc = "!< r/s Angular velocity in platform body"]
    pub AngVelBody: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMUSensorBodyMsg"]
        [::core::mem::size_of::<IMUSensorBodyMsg>() - 96usize];
    ["Alignment of IMUSensorBodyMsg"]
        [::core::mem::align_of::<IMUSensorBodyMsg>() - 8usize];
    ["Offset of field: IMUSensorBodyMsg::DVFrameBody"]
        [::core::mem::offset_of!(IMUSensorBodyMsg, DVFrameBody) - 0usize];
    ["Offset of field: IMUSensorBodyMsg::AccelBody"]
        [::core::mem::offset_of!(IMUSensorBodyMsg, AccelBody) - 24usize];
    ["Offset of field: IMUSensorBodyMsg::DRFrameBody"]
        [::core::mem::offset_of!(IMUSensorBodyMsg, DRFrameBody) - 48usize];
    ["Offset of field: IMUSensorBodyMsg::AngVelBody"]
        [::core::mem::offset_of!(IMUSensorBodyMsg, AngVelBody) - 72usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMUSensorBodyMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: IMUSensorBodyMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut IMUSensorBodyMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMUSensorBodyMsg_C"][::core::mem::size_of::<IMUSensorBodyMsg_C>() - 144usize];
    ["Alignment of IMUSensorBodyMsg_C"][::core::mem::align_of::<IMUSensorBodyMsg_C>() - 8usize];
    ["Offset of field: IMUSensorBodyMsg_C::header"]
        [::core::mem::offset_of!(IMUSensorBodyMsg_C, header) - 0usize];
    ["Offset of field: IMUSensorBodyMsg_C::data"]
        [::core::mem::offset_of!(IMUSensorBodyMsg_C, data) - 32usize];
    ["Offset of field: IMUSensorBodyMsg_C::dataPointer"]
        [::core::mem::offset_of!(IMUSensorBodyMsg_C, dataPointer) - 128usize];
    ["Offset of field: IMUSensorBodyMsg_C::headerPointer"]
        [::core::mem::offset_of!(IMUSensorBodyMsg_C, headerPointer) - 136usize];
};
impl Default for IMUSensorBodyMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! @brief Simulated IMU Sensor output message definition."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct IMUSensorMsg {
    #[doc = "!< m/s Accumulated DVs in platform"]
    pub DVFramePlatform: [f64; 3usize],
    #[doc = "!< m/s2 Apparent acceleration of the platform"]
    pub AccelPlatform: [f64; 3usize],
    #[doc = "!< r  Accumulated DRs in platform"]
    pub DRFramePlatform: [f64; 3usize],
    #[doc = "!< r/s Angular velocity in platform frame"]
    pub AngVelPlatform: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMUSensorMsg"][::core::mem::size_of::<IMUSensorMsg>() - 96usize];
    ["Alignment of IMUSensorMsg"][::core::mem::align_of::<IMUSensorMsg>() - 8usize];
    ["Offset of field: IMUSensorMsg::DVFramePlatform"]
        [::core::mem::offset_of!(IMUSensorMsg, DVFramePlatform) - 0usize];
    ["Offset of field: IMUSensorMsg::AccelPlatform"]
        [::core::mem::offset_of!(IMUSensorMsg, AccelPlatform) - 24usize];
    ["Offset of field: IMUSensorMsg::DRFramePlatform"]
        [::core::mem::offset_of!(IMUSensorMsg, DRFramePlatform) - 48usize];
    ["Offset of field: IMUSensorMsg::AngVelPlatform"]
        [::core::mem::offset_of!(IMUSensorMsg, AngVelPlatform) - 72usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IMUSensorMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: IMUSensorMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut IMUSensorMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMUSensorMsg_C"][::core::mem::size_of::<IMUSensorMsg_C>() - 144usize];
    ["Alignment of IMUSensorMsg_C"][::core::mem::align_of::<IMUSensorMsg_C>() - 8usize];
    ["Offset of field: IMUSensorMsg_C::header"]
        [::core::mem::offset_of!(IMUSensorMsg_C, header) - 0usize];
    ["Offset of field: IMUSensorMsg_C::data"]
        [::core::mem::offset_of!(IMUSensorMsg_C, data) - 32usize];
    ["Offset of field: IMUSensorMsg_C::dataPointer"]
        [::core::mem::offset_of!(IMUSensorMsg_C, dataPointer) - 128usize];
    ["Offset of field: IMUSensorMsg_C::headerPointer"]
        [::core::mem::offset_of!(IMUSensorMsg_C, headerPointer) - 136usize];
};
impl Default for IMUSensorMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief structure for filter-states output for the unscented kalman filter\nimplementation of the inertial state estimator"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InertialFilterMsg {
    #[doc = "!< [s] Current time of validity for output"]
    pub timeTag: f64,
    #[doc = "!< [-] Current covariance of the filter"]
    pub covar: [f64; 36usize],
    #[doc = "!< [-] Current estimated state of the filter"]
    pub state: [f64; 6usize],
    #[doc = "!< [-] Valid observation count for this frame"]
    pub numObs: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InertialFilterMsg"]
        [::core::mem::size_of::<InertialFilterMsg>() - 352usize];
    ["Alignment of InertialFilterMsg"]
        [::core::mem::align_of::<InertialFilterMsg>() - 8usize];
    ["Offset of field: InertialFilterMsg::timeTag"]
        [::core::mem::offset_of!(InertialFilterMsg, timeTag) - 0usize];
    ["Offset of field: InertialFilterMsg::covar"]
        [::core::mem::offset_of!(InertialFilterMsg, covar) - 8usize];
    ["Offset of field: InertialFilterMsg::state"]
        [::core::mem::offset_of!(InertialFilterMsg, state) - 296usize];
    ["Offset of field: InertialFilterMsg::numObs"]
        [::core::mem::offset_of!(InertialFilterMsg, numObs) - 344usize];
};
impl Default for InertialFilterMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InertialFilterMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: InertialFilterMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut InertialFilterMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InertialFilterMsg_C"][::core::mem::size_of::<InertialFilterMsg_C>() - 400usize];
    ["Alignment of InertialFilterMsg_C"][::core::mem::align_of::<InertialFilterMsg_C>() - 8usize];
    ["Offset of field: InertialFilterMsg_C::header"]
        [::core::mem::offset_of!(InertialFilterMsg_C, header) - 0usize];
    ["Offset of field: InertialFilterMsg_C::data"]
        [::core::mem::offset_of!(InertialFilterMsg_C, data) - 32usize];
    ["Offset of field: InertialFilterMsg_C::dataPointer"]
        [::core::mem::offset_of!(InertialFilterMsg_C, dataPointer) - 384usize];
    ["Offset of field: InertialFilterMsg_C::headerPointer"]
        [::core::mem::offset_of!(InertialFilterMsg_C, headerPointer) - 392usize];
};
impl Default for InertialFilterMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "!@brief Inertial heading message definition.\n*! This message contains the unit direction vector of a certain direction\nexpressed in inertial frame coordinates.\n*/"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct InertialHeadingMsg {
    #[doc = "!< [] unit heading vector to any thing \"X\" in space, \"N\", inertial frame"]
    pub rHat_XN_N: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InertialHeadingMsg"]
        [::core::mem::size_of::<InertialHeadingMsg>() - 24usize];
    ["Alignment of InertialHeadingMsg"]
        [::core::mem::align_of::<InertialHeadingMsg>() - 8usize];
    ["Offset of field: InertialHeadingMsg::rHat_XN_N"]
        [::core::mem::offset_of!(InertialHeadingMsg, rHat_XN_N) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InertialHeadingMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: InertialHeadingMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut InertialHeadingMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InertialHeadingMsg_C"][::core::mem::size_of::<InertialHeadingMsg_C>() - 72usize];
    ["Alignment of InertialHeadingMsg_C"][::core::mem::align_of::<InertialHeadingMsg_C>() - 8usize];
    ["Offset of field: InertialHeadingMsg_C::header"]
        [::core::mem::offset_of!(InertialHeadingMsg_C, header) - 0usize];
    ["Offset of field: InertialHeadingMsg_C::data"]
        [::core::mem::offset_of!(InertialHeadingMsg_C, data) - 32usize];
    ["Offset of field: InertialHeadingMsg_C::dataPointer"]
        [::core::mem::offset_of!(InertialHeadingMsg_C, dataPointer) - 56usize];
    ["Offset of field: InertialHeadingMsg_C::headerPointer"]
        [::core::mem::offset_of!(InertialHeadingMsg_C, headerPointer) - 64usize];
};
impl Default for InertialHeadingMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define extra output of the Lambert problem solution"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LambertPerformanceMsg {
    #[doc = "!< [-] solution for free variable (iteration variable)"]
    pub x: f64,
    #[doc = "!< [-] number of root-finder iterations to find x"]
    pub numIter: ::core::ffi::c_int,
    #[doc = "!< [-] difference in x between last and second-to-last iteration"]
    pub errX: f64,
    #[doc = "!< [-] second solution for free variable (iteration variable)"]
    pub xSol2: f64,
    #[doc = "!< [-] number of root-finder iterations to find x_sol2"]
    pub numIterSol2: ::core::ffi::c_int,
    #[doc = "!< [-] difference in x_sol2 between last and second-to-last iteration"]
    pub errXSol2: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LambertPerformanceMsg"]
        [::core::mem::size_of::<LambertPerformanceMsg>() - 48usize];
    ["Alignment of LambertPerformanceMsg"]
        [::core::mem::align_of::<LambertPerformanceMsg>() - 8usize];
    ["Offset of field: LambertPerformanceMsg::x"]
        [::core::mem::offset_of!(LambertPerformanceMsg, x) - 0usize];
    ["Offset of field: LambertPerformanceMsg::numIter"]
        [::core::mem::offset_of!(LambertPerformanceMsg, numIter) - 8usize];
    ["Offset of field: LambertPerformanceMsg::errX"]
        [::core::mem::offset_of!(LambertPerformanceMsg, errX) - 16usize];
    ["Offset of field: LambertPerformanceMsg::xSol2"]
        [::core::mem::offset_of!(LambertPerformanceMsg, xSol2) - 24usize];
    ["Offset of field: LambertPerformanceMsg::numIterSol2"]
        [::core::mem::offset_of!(LambertPerformanceMsg, numIterSol2) - 32usize];
    ["Offset of field: LambertPerformanceMsg::errXSol2"]
        [::core::mem::offset_of!(LambertPerformanceMsg, errXSol2) - 40usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LambertPerformanceMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: LambertPerformanceMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut LambertPerformanceMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LambertPerformanceMsg_C"]
        [::core::mem::size_of::<LambertPerformanceMsg_C>() - 96usize];
    ["Alignment of LambertPerformanceMsg_C"]
        [::core::mem::align_of::<LambertPerformanceMsg_C>() - 8usize];
    ["Offset of field: LambertPerformanceMsg_C::header"]
        [::core::mem::offset_of!(LambertPerformanceMsg_C, header) - 0usize];
    ["Offset of field: LambertPerformanceMsg_C::data"]
        [::core::mem::offset_of!(LambertPerformanceMsg_C, data) - 32usize];
    ["Offset of field: LambertPerformanceMsg_C::dataPointer"]
        [::core::mem::offset_of!(LambertPerformanceMsg_C, dataPointer) - 80usize];
    ["Offset of field: LambertPerformanceMsg_C::headerPointer"]
        [::core::mem::offset_of!(LambertPerformanceMsg_C, headerPointer) - 88usize];
};
impl Default for LambertPerformanceMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const IZZO: SolverMethod = 0;
pub const GOODING: SolverMethod = 1;
pub type SolverMethod = ::core::ffi::c_uint;
#[doc = " @brief Structure used to define the input for Lambert problem"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LambertProblemMsg {
    #[doc = "!< [-] lambert solver algorithm (GOODING or IZZO)"]
    pub solverMethod: SolverMethod,
    #[doc = "!< [m] position vector at t0"]
    pub r1_N: [f64; 3usize],
    #[doc = "!< [m] position vector at t1"]
    pub r2_N: [f64; 3usize],
    #[doc = "!< [s] time of flight between r1_N and r2_N (t1-t0)"]
    pub transferTime: f64,
    #[doc = "!< [m^3 s^-2] gravitational parameter of body"]
    pub mu: f64,
    #[doc = "!< [-] number of revolutions to be completed (completed orbits)"]
    pub numRevolutions: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LambertProblemMsg"]
        [::core::mem::size_of::<LambertProblemMsg>() - 80usize];
    ["Alignment of LambertProblemMsg"]
        [::core::mem::align_of::<LambertProblemMsg>() - 8usize];
    ["Offset of field: LambertProblemMsg::solverMethod"]
        [::core::mem::offset_of!(LambertProblemMsg, solverMethod) - 0usize];
    ["Offset of field: LambertProblemMsg::r1_N"]
        [::core::mem::offset_of!(LambertProblemMsg, r1_N) - 8usize];
    ["Offset of field: LambertProblemMsg::r2_N"]
        [::core::mem::offset_of!(LambertProblemMsg, r2_N) - 32usize];
    ["Offset of field: LambertProblemMsg::transferTime"]
        [::core::mem::offset_of!(LambertProblemMsg, transferTime) - 56usize];
    ["Offset of field: LambertProblemMsg::mu"]
        [::core::mem::offset_of!(LambertProblemMsg, mu) - 64usize];
    ["Offset of field: LambertProblemMsg::numRevolutions"]
        [::core::mem::offset_of!(LambertProblemMsg, numRevolutions) - 72usize];
};
impl Default for LambertProblemMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LambertProblemMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: LambertProblemMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut LambertProblemMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LambertProblemMsg_C"][::core::mem::size_of::<LambertProblemMsg_C>() - 128usize];
    ["Alignment of LambertProblemMsg_C"][::core::mem::align_of::<LambertProblemMsg_C>() - 8usize];
    ["Offset of field: LambertProblemMsg_C::header"]
        [::core::mem::offset_of!(LambertProblemMsg_C, header) - 0usize];
    ["Offset of field: LambertProblemMsg_C::data"]
        [::core::mem::offset_of!(LambertProblemMsg_C, data) - 32usize];
    ["Offset of field: LambertProblemMsg_C::dataPointer"]
        [::core::mem::offset_of!(LambertProblemMsg_C, dataPointer) - 112usize];
    ["Offset of field: LambertProblemMsg_C::headerPointer"]
        [::core::mem::offset_of!(LambertProblemMsg_C, headerPointer) - 120usize];
};
impl Default for LambertProblemMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output of the Lambert problem solution"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LambertSolutionMsg {
    #[doc = "!< [m/s] velocity solution at t1"]
    pub v1_N: [f64; 3usize],
    #[doc = "!< [m/s] velocity solution at t2"]
    pub v2_N: [f64; 3usize],
    #[doc = "!< [-] valid solution if 1, not if 0"]
    pub valid: ::core::ffi::c_int,
    #[doc = "!< [m/s] second velocity solution at t1 (for multi-revolution solutions)"]
    pub v1Sol2_N: [f64; 3usize],
    #[doc = "!< [m/s] second velocity solution at t2 (for multi-revolution solutions)"]
    pub v2Sol2_N: [f64; 3usize],
    #[doc = "!< [-] valid second solution if 1, not if 0"]
    pub validSol2: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LambertSolutionMsg"]
        [::core::mem::size_of::<LambertSolutionMsg>() - 112usize];
    ["Alignment of LambertSolutionMsg"]
        [::core::mem::align_of::<LambertSolutionMsg>() - 8usize];
    ["Offset of field: LambertSolutionMsg::v1_N"]
        [::core::mem::offset_of!(LambertSolutionMsg, v1_N) - 0usize];
    ["Offset of field: LambertSolutionMsg::v2_N"]
        [::core::mem::offset_of!(LambertSolutionMsg, v2_N) - 24usize];
    ["Offset of field: LambertSolutionMsg::valid"]
        [::core::mem::offset_of!(LambertSolutionMsg, valid) - 48usize];
    ["Offset of field: LambertSolutionMsg::v1Sol2_N"]
        [::core::mem::offset_of!(LambertSolutionMsg, v1Sol2_N) - 56usize];
    ["Offset of field: LambertSolutionMsg::v2Sol2_N"]
        [::core::mem::offset_of!(LambertSolutionMsg, v2Sol2_N) - 80usize];
    ["Offset of field: LambertSolutionMsg::validSol2"]
        [::core::mem::offset_of!(LambertSolutionMsg, validSol2) - 104usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LambertSolutionMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: LambertSolutionMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut LambertSolutionMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LambertSolutionMsg_C"][::core::mem::size_of::<LambertSolutionMsg_C>() - 160usize];
    ["Alignment of LambertSolutionMsg_C"][::core::mem::align_of::<LambertSolutionMsg_C>() - 8usize];
    ["Offset of field: LambertSolutionMsg_C::header"]
        [::core::mem::offset_of!(LambertSolutionMsg_C, header) - 0usize];
    ["Offset of field: LambertSolutionMsg_C::data"]
        [::core::mem::offset_of!(LambertSolutionMsg_C, data) - 32usize];
    ["Offset of field: LambertSolutionMsg_C::dataPointer"]
        [::core::mem::offset_of!(LambertSolutionMsg_C, dataPointer) - 144usize];
    ["Offset of field: LambertSolutionMsg_C::headerPointer"]
        [::core::mem::offset_of!(LambertSolutionMsg_C, headerPointer) - 152usize];
};
impl Default for LambertSolutionMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to log results of lambert validator, such as constraint violations.\nSpecifies why lambertValidator failed to write a non-zero DV command message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LambertValidatorMsg {
    #[doc = "!< [-] no valid lambert solution if 1, otherwise 0"]
    pub failedValidLambert: ::core::ffi::c_int,
    #[doc = "!< [-] Lambert solver root finder iterations for x too high if 1, otherwise 0"]
    pub failedNumIterationsLambert: ::core::ffi::c_int,
    #[doc = "!< [-] Lambert solver root finder for x not converged if 1, otherwise 0"]
    pub failedXToleranceLambert: ::core::ffi::c_int,
    #[doc = "!< [-] x solution too different from previous time step if 1, otherwise 0"]
    pub failedXSolutionConvergence: ::core::ffi::c_int,
    #[doc = "!< [-] Delta-V solution too different from previous time step if 1, otherwise 0"]
    pub failedDvSolutionConvergence: ::core::ffi::c_int,
    #[doc = "!< [-] violated the maximum distance from target constraint if 1, otherwise 0"]
    pub failedDistanceTargetConstraint: ::core::ffi::c_int,
    #[doc = "!< [-] violated the minimum orbit radius constraint if 1, otherwise 0"]
    pub failedOrbitRadiusConstraint: ::core::ffi::c_int,
    #[doc = "!< [-] difference in solution for free variable (iteration variable) to previous time"]
    pub xSolutionDifference: f64,
    #[doc = "!< [m/s] difference in Delta-V solution magnitude to previous time step"]
    pub dvSolutionDifference: f64,
    #[doc = "!< [-] number of violations of the maximum distance from target constraint"]
    pub violationsDistanceTarget: ::core::ffi::c_int,
    #[doc = "!< [-] number of violations of the minimum orbit radius constraint"]
    pub violationsOrbitRadius: ::core::ffi::c_int,
    #[doc = "!< [m/s] Delta-V vector that would be commanded at maneuver time if all checks passed"]
    pub dv_N: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LambertValidatorMsg"]
        [::core::mem::size_of::<LambertValidatorMsg>() - 80usize];
    ["Alignment of LambertValidatorMsg"]
        [::core::mem::align_of::<LambertValidatorMsg>() - 8usize];
    ["Offset of field: LambertValidatorMsg::failedValidLambert"]
        [::core::mem::offset_of!(LambertValidatorMsg, failedValidLambert) - 0usize];
    ["Offset of field: LambertValidatorMsg::failedNumIterationsLambert"]
        [::core::mem::offset_of!(LambertValidatorMsg, failedNumIterationsLambert) - 4usize];
    ["Offset of field: LambertValidatorMsg::failedXToleranceLambert"]
        [::core::mem::offset_of!(LambertValidatorMsg, failedXToleranceLambert) - 8usize];
    ["Offset of field: LambertValidatorMsg::failedXSolutionConvergence"]
        [::core::mem::offset_of!(LambertValidatorMsg, failedXSolutionConvergence) - 12usize];
    ["Offset of field: LambertValidatorMsg::failedDvSolutionConvergence"][::core::mem::offset_of!(
        LambertValidatorMsg,
        failedDvSolutionConvergence
    ) - 16usize];
    ["Offset of field: LambertValidatorMsg::failedDistanceTargetConstraint"][::core::mem::offset_of!(
        LambertValidatorMsg,
        failedDistanceTargetConstraint
    ) - 20usize];
    ["Offset of field: LambertValidatorMsg::failedOrbitRadiusConstraint"][::core::mem::offset_of!(
        LambertValidatorMsg,
        failedOrbitRadiusConstraint
    ) - 24usize];
    ["Offset of field: LambertValidatorMsg::xSolutionDifference"]
        [::core::mem::offset_of!(LambertValidatorMsg, xSolutionDifference) - 32usize];
    ["Offset of field: LambertValidatorMsg::dvSolutionDifference"]
        [::core::mem::offset_of!(LambertValidatorMsg, dvSolutionDifference) - 40usize];
    ["Offset of field: LambertValidatorMsg::violationsDistanceTarget"]
        [::core::mem::offset_of!(LambertValidatorMsg, violationsDistanceTarget) - 48usize];
    ["Offset of field: LambertValidatorMsg::violationsOrbitRadius"]
        [::core::mem::offset_of!(LambertValidatorMsg, violationsOrbitRadius) - 52usize];
    ["Offset of field: LambertValidatorMsg::dv_N"]
        [::core::mem::offset_of!(LambertValidatorMsg, dv_N) - 56usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LambertValidatorMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: LambertValidatorMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut LambertValidatorMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LambertValidatorMsg_C"][::core::mem::size_of::<LambertValidatorMsg_C>() - 128usize];
    ["Alignment of LambertValidatorMsg_C"]
        [::core::mem::align_of::<LambertValidatorMsg_C>() - 8usize];
    ["Offset of field: LambertValidatorMsg_C::header"]
        [::core::mem::offset_of!(LambertValidatorMsg_C, header) - 0usize];
    ["Offset of field: LambertValidatorMsg_C::data"]
        [::core::mem::offset_of!(LambertValidatorMsg_C, data) - 32usize];
    ["Offset of field: LambertValidatorMsg_C::dataPointer"]
        [::core::mem::offset_of!(LambertValidatorMsg_C, dataPointer) - 112usize];
    ["Offset of field: LambertValidatorMsg_C::headerPointer"]
        [::core::mem::offset_of!(LambertValidatorMsg_C, headerPointer) - 120usize];
};
impl Default for LambertValidatorMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message that defines visibility of a landmark by the on-board camera providing the landmark pixel using\nthe pinhole camera model"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LandmarkMsg {
    #[doc = "!< [-] 1 when the landmark is visible by the camera, 0 otherwise."]
    pub isVisible: ::core::ffi::c_int,
    #[doc = "!< [-] landmark pixel as view from pinhole camera"]
    pub pL: [::core::ffi::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LandmarkMsg"][::core::mem::size_of::<LandmarkMsg>() - 12usize];
    ["Alignment of LandmarkMsg"][::core::mem::align_of::<LandmarkMsg>() - 4usize];
    ["Offset of field: LandmarkMsg::isVisible"]
        [::core::mem::offset_of!(LandmarkMsg, isVisible) - 0usize];
    ["Offset of field: LandmarkMsg::pL"]
        [::core::mem::offset_of!(LandmarkMsg, pL) - 4usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LandmarkMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: LandmarkMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut LandmarkMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LandmarkMsg_C"][::core::mem::size_of::<LandmarkMsg_C>() - 64usize];
    ["Alignment of LandmarkMsg_C"][::core::mem::align_of::<LandmarkMsg_C>() - 8usize];
    ["Offset of field: LandmarkMsg_C::header"]
        [::core::mem::offset_of!(LandmarkMsg_C, header) - 0usize];
    ["Offset of field: LandmarkMsg_C::data"]
        [::core::mem::offset_of!(LandmarkMsg_C, data) - 32usize];
    ["Offset of field: LandmarkMsg_C::dataPointer"]
        [::core::mem::offset_of!(LandmarkMsg_C, dataPointer) - 48usize];
    ["Offset of field: LandmarkMsg_C::headerPointer"]
        [::core::mem::offset_of!(LandmarkMsg_C, headerPointer) - 56usize];
};
impl Default for LandmarkMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the translating rigid body data message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LinearTranslationRigidBodyMsg {
    #[doc = "!< [m], body linear displacement"]
    pub rho: f64,
    #[doc = "!< [m/s], body linear displacement rate"]
    pub rhoDot: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LinearTranslationRigidBodyMsg"]
        [::core::mem::size_of::<LinearTranslationRigidBodyMsg>() - 16usize];
    ["Alignment of LinearTranslationRigidBodyMsg"]
        [::core::mem::align_of::<LinearTranslationRigidBodyMsg>() - 8usize];
    ["Offset of field: LinearTranslationRigidBodyMsg::rho"]
        [::core::mem::offset_of!(LinearTranslationRigidBodyMsg, rho) - 0usize];
    ["Offset of field: LinearTranslationRigidBodyMsg::rhoDot"]
        [::core::mem::offset_of!(LinearTranslationRigidBodyMsg, rhoDot) - 8usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LinearTranslationRigidBodyMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: LinearTranslationRigidBodyMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut LinearTranslationRigidBodyMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LinearTranslationRigidBodyMsg_C"]
        [::core::mem::size_of::<LinearTranslationRigidBodyMsg_C>() - 64usize];
    ["Alignment of LinearTranslationRigidBodyMsg_C"]
        [::core::mem::align_of::<LinearTranslationRigidBodyMsg_C>() - 8usize];
    ["Offset of field: LinearTranslationRigidBodyMsg_C::header"]
        [::core::mem::offset_of!(LinearTranslationRigidBodyMsg_C, header) - 0usize];
    ["Offset of field: LinearTranslationRigidBodyMsg_C::data"]
        [::core::mem::offset_of!(LinearTranslationRigidBodyMsg_C, data) - 32usize];
    ["Offset of field: LinearTranslationRigidBodyMsg_C::dataPointer"]
        [::core::mem::offset_of!(LinearTranslationRigidBodyMsg_C, dataPointer) - 48usize];
    ["Offset of field: LinearTranslationRigidBodyMsg_C::headerPointer"]
        [::core::mem::offset_of!(LinearTranslationRigidBodyMsg_C, headerPointer) - 56usize];
};
impl Default for LinearTranslationRigidBodyMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " antenna state message definition"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct LinkBudgetMsg {
    #[doc = "!< [-]     Antenna identifier"]
    pub antennaName1: [::core::ffi::c_char; 20usize],
    #[doc = "!< [-]     Antenna identifier"]
    pub antennaName2: [::core::ffi::c_char; 20usize],
    #[doc = "!< [-]     Current state of the antenna 2 (0: off, 1: Rx, 2: Tx, 3: RxTx)"]
    pub antennaState2: u32,
    #[doc = "!< [-]     Current state of the antenna 1 (0: off, 1: Rx, 2: Tx, 3: RxTx)"]
    pub antennaState1: u32,
    #[doc = "!< [-]     Carrier to noise ratio at antenna 1"]
    pub CNR1: f64,
    #[doc = "!< [-]     Carrier to noise ratio at antenna 2"]
    pub CNR2: f64,
    #[doc = "!< [m]     Distance between the two antennas"]
    pub distance: f64,
    #[doc = "!< [Hz]    Bandwidth of the communication link"]
    pub bandwidth: f64,
    #[doc = "!< [Hz]    Operating frequency of the communication link"]
    pub frequency: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LinkBudgetMsg"][::core::mem::size_of::<LinkBudgetMsg>() - 88usize];
    ["Alignment of LinkBudgetMsg"][::core::mem::align_of::<LinkBudgetMsg>() - 8usize];
    ["Offset of field: LinkBudgetMsg::antennaName1"]
        [::core::mem::offset_of!(LinkBudgetMsg, antennaName1) - 0usize];
    ["Offset of field: LinkBudgetMsg::antennaName2"]
        [::core::mem::offset_of!(LinkBudgetMsg, antennaName2) - 20usize];
    ["Offset of field: LinkBudgetMsg::antennaState2"]
        [::core::mem::offset_of!(LinkBudgetMsg, antennaState2) - 40usize];
    ["Offset of field: LinkBudgetMsg::antennaState1"]
        [::core::mem::offset_of!(LinkBudgetMsg, antennaState1) - 44usize];
    ["Offset of field: LinkBudgetMsg::CNR1"]
        [::core::mem::offset_of!(LinkBudgetMsg, CNR1) - 48usize];
    ["Offset of field: LinkBudgetMsg::CNR2"]
        [::core::mem::offset_of!(LinkBudgetMsg, CNR2) - 56usize];
    ["Offset of field: LinkBudgetMsg::distance"]
        [::core::mem::offset_of!(LinkBudgetMsg, distance) - 64usize];
    ["Offset of field: LinkBudgetMsg::bandwidth"]
        [::core::mem::offset_of!(LinkBudgetMsg, bandwidth) - 72usize];
    ["Offset of field: LinkBudgetMsg::frequency"]
        [::core::mem::offset_of!(LinkBudgetMsg, frequency) - 80usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LinkBudgetMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: LinkBudgetMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut LinkBudgetMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LinkBudgetMsg_C"][::core::mem::size_of::<LinkBudgetMsg_C>() - 136usize];
    ["Alignment of LinkBudgetMsg_C"][::core::mem::align_of::<LinkBudgetMsg_C>() - 8usize];
    ["Offset of field: LinkBudgetMsg_C::header"]
        [::core::mem::offset_of!(LinkBudgetMsg_C, header) - 0usize];
    ["Offset of field: LinkBudgetMsg_C::data"]
        [::core::mem::offset_of!(LinkBudgetMsg_C, data) - 32usize];
    ["Offset of field: LinkBudgetMsg_C::dataPointer"]
        [::core::mem::offset_of!(LinkBudgetMsg_C, dataPointer) - 120usize];
    ["Offset of field: LinkBudgetMsg_C::headerPointer"]
        [::core::mem::offset_of!(LinkBudgetMsg_C, headerPointer) - 128usize];
};
impl Default for LinkBudgetMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief magnetic torque bar array configuration msg"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MTBArrayConfigMsg {
    #[doc = "!< [-] number of magnetic torque bars on the spacecraft"]
    pub numMTB: ::core::ffi::c_int,
    #[doc = "!< [-] magnetic torque bar alignment matrix in Body frame components, must be provided in row-major format"]
    pub GtMatrix_B: [f64; 108usize],
    #[doc = "!< [A-m2] maximum commandable dipole for each magnetic torque bar"]
    pub maxMtbDipoles: [f64; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MTBArrayConfigMsg"]
        [::core::mem::size_of::<MTBArrayConfigMsg>() - 1160usize];
    ["Alignment of MTBArrayConfigMsg"]
        [::core::mem::align_of::<MTBArrayConfigMsg>() - 8usize];
    ["Offset of field: MTBArrayConfigMsg::numMTB"]
        [::core::mem::offset_of!(MTBArrayConfigMsg, numMTB) - 0usize];
    ["Offset of field: MTBArrayConfigMsg::GtMatrix_B"]
        [::core::mem::offset_of!(MTBArrayConfigMsg, GtMatrix_B) - 8usize];
    ["Offset of field: MTBArrayConfigMsg::maxMtbDipoles"]
        [::core::mem::offset_of!(MTBArrayConfigMsg, maxMtbDipoles) - 872usize];
};
impl Default for MTBArrayConfigMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MTBArrayConfigMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: MTBArrayConfigMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut MTBArrayConfigMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MTBArrayConfigMsg_C"][::core::mem::size_of::<MTBArrayConfigMsg_C>() - 1208usize];
    ["Alignment of MTBArrayConfigMsg_C"][::core::mem::align_of::<MTBArrayConfigMsg_C>() - 8usize];
    ["Offset of field: MTBArrayConfigMsg_C::header"]
        [::core::mem::offset_of!(MTBArrayConfigMsg_C, header) - 0usize];
    ["Offset of field: MTBArrayConfigMsg_C::data"]
        [::core::mem::offset_of!(MTBArrayConfigMsg_C, data) - 32usize];
    ["Offset of field: MTBArrayConfigMsg_C::dataPointer"]
        [::core::mem::offset_of!(MTBArrayConfigMsg_C, dataPointer) - 1192usize];
    ["Offset of field: MTBArrayConfigMsg_C::headerPointer"]
        [::core::mem::offset_of!(MTBArrayConfigMsg_C, headerPointer) - 1200usize];
};
impl Default for MTBArrayConfigMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message for magnetic torque bar dipole commands."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MTBCmdMsg {
    #[doc = "!< [A-m2] magnetic torque bar dipole cmds"]
    pub mtbDipoleCmds: [f64; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MTBCmdMsg"][::core::mem::size_of::<MTBCmdMsg>() - 288usize];
    ["Alignment of MTBCmdMsg"][::core::mem::align_of::<MTBCmdMsg>() - 8usize];
    ["Offset of field: MTBCmdMsg::mtbDipoleCmds"]
        [::core::mem::offset_of!(MTBCmdMsg, mtbDipoleCmds) - 0usize];
};
impl Default for MTBCmdMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MTBCmdMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: MTBCmdMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut MTBCmdMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MTBCmdMsg_C"][::core::mem::size_of::<MTBCmdMsg_C>() - 336usize];
    ["Alignment of MTBCmdMsg_C"][::core::mem::align_of::<MTBCmdMsg_C>() - 8usize];
    ["Offset of field: MTBCmdMsg_C::header"][::core::mem::offset_of!(MTBCmdMsg_C, header) - 0usize];
    ["Offset of field: MTBCmdMsg_C::data"]
        [::core::mem::offset_of!(MTBCmdMsg_C, data) - 32usize];
    ["Offset of field: MTBCmdMsg_C::dataPointer"]
        [::core::mem::offset_of!(MTBCmdMsg_C, dataPointer) - 320usize];
    ["Offset of field: MTBCmdMsg_C::headerPointer"]
        [::core::mem::offset_of!(MTBCmdMsg_C, headerPointer) - 328usize];
};
impl Default for MTBCmdMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " gravity gradient torque message definition"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MTBMsg {
    #[doc = "!< [Nm]  net torque contribution of all magnetic torque bars in Body frame components"]
    pub mtbNetTorque_B: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MTBMsg"][::core::mem::size_of::<MTBMsg>() - 24usize];
    ["Alignment of MTBMsg"][::core::mem::align_of::<MTBMsg>() - 8usize];
    ["Offset of field: MTBMsg::mtbNetTorque_B"]
        [::core::mem::offset_of!(MTBMsg, mtbNetTorque_B) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MTBMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: MTBMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut MTBMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MTBMsg_C"][::core::mem::size_of::<MTBMsg_C>() - 72usize];
    ["Alignment of MTBMsg_C"][::core::mem::align_of::<MTBMsg_C>() - 8usize];
    ["Offset of field: MTBMsg_C::header"][::core::mem::offset_of!(MTBMsg_C, header) - 0usize];
    ["Offset of field: MTBMsg_C::data"][::core::mem::offset_of!(MTBMsg_C, data) - 32usize];
    ["Offset of field: MTBMsg_C::dataPointer"]
        [::core::mem::offset_of!(MTBMsg_C, dataPointer) - 56usize];
    ["Offset of field: MTBMsg_C::headerPointer"]
        [::core::mem::offset_of!(MTBMsg_C, headerPointer) - 64usize];
};
impl Default for MTBMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " magnetic field message definition"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MagneticFieldMsg {
    #[doc = "!< [Tesla] Local magnetic field"]
    pub magField_N: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MagneticFieldMsg"]
        [::core::mem::size_of::<MagneticFieldMsg>() - 24usize];
    ["Alignment of MagneticFieldMsg"]
        [::core::mem::align_of::<MagneticFieldMsg>() - 8usize];
    ["Offset of field: MagneticFieldMsg::magField_N"]
        [::core::mem::offset_of!(MagneticFieldMsg, magField_N) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MagneticFieldMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: MagneticFieldMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut MagneticFieldMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MagneticFieldMsg_C"][::core::mem::size_of::<MagneticFieldMsg_C>() - 72usize];
    ["Alignment of MagneticFieldMsg_C"][::core::mem::align_of::<MagneticFieldMsg_C>() - 8usize];
    ["Offset of field: MagneticFieldMsg_C::header"]
        [::core::mem::offset_of!(MagneticFieldMsg_C, header) - 0usize];
    ["Offset of field: MagneticFieldMsg_C::data"]
        [::core::mem::offset_of!(MagneticFieldMsg_C, data) - 32usize];
    ["Offset of field: MagneticFieldMsg_C::dataPointer"]
        [::core::mem::offset_of!(MagneticFieldMsg_C, dataPointer) - 56usize];
    ["Offset of field: MagneticFieldMsg_C::headerPointer"]
        [::core::mem::offset_of!(MagneticFieldMsg_C, headerPointer) - 64usize];
};
impl Default for MagneticFieldMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message containing a scalar mass flow rate."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MassFlowRateMsg {
    #[doc = "!< [kg/s] scalar mass flow rate"]
    pub massFlowRate: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MassFlowRateMsg"][::core::mem::size_of::<MassFlowRateMsg>() - 8usize];
    ["Alignment of MassFlowRateMsg"]
        [::core::mem::align_of::<MassFlowRateMsg>() - 8usize];
    ["Offset of field: MassFlowRateMsg::massFlowRate"]
        [::core::mem::offset_of!(MassFlowRateMsg, massFlowRate) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MassFlowRateMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: MassFlowRateMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut MassFlowRateMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MassFlowRateMsg_C"][::core::mem::size_of::<MassFlowRateMsg_C>() - 56usize];
    ["Alignment of MassFlowRateMsg_C"][::core::mem::align_of::<MassFlowRateMsg_C>() - 8usize];
    ["Offset of field: MassFlowRateMsg_C::header"]
        [::core::mem::offset_of!(MassFlowRateMsg_C, header) - 0usize];
    ["Offset of field: MassFlowRateMsg_C::data"]
        [::core::mem::offset_of!(MassFlowRateMsg_C, data) - 32usize];
    ["Offset of field: MassFlowRateMsg_C::dataPointer"]
        [::core::mem::offset_of!(MassFlowRateMsg_C, dataPointer) - 40usize];
    ["Offset of field: MassFlowRateMsg_C::headerPointer"]
        [::core::mem::offset_of!(MassFlowRateMsg_C, headerPointer) - 48usize];
};
impl Default for MassFlowRateMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure containing number of commanded stepper motor steps"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MotorStepCommandMsg {
    #[doc = "!< Number of commanded stepper motor steps"]
    pub stepsCommanded: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MotorStepCommandMsg"]
        [::core::mem::size_of::<MotorStepCommandMsg>() - 4usize];
    ["Alignment of MotorStepCommandMsg"]
        [::core::mem::align_of::<MotorStepCommandMsg>() - 4usize];
    ["Offset of field: MotorStepCommandMsg::stepsCommanded"]
        [::core::mem::offset_of!(MotorStepCommandMsg, stepsCommanded) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MotorStepCommandMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: MotorStepCommandMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut MotorStepCommandMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MotorStepCommandMsg_C"][::core::mem::size_of::<MotorStepCommandMsg_C>() - 56usize];
    ["Alignment of MotorStepCommandMsg_C"]
        [::core::mem::align_of::<MotorStepCommandMsg_C>() - 8usize];
    ["Offset of field: MotorStepCommandMsg_C::header"]
        [::core::mem::offset_of!(MotorStepCommandMsg_C, header) - 0usize];
    ["Offset of field: MotorStepCommandMsg_C::data"]
        [::core::mem::offset_of!(MotorStepCommandMsg_C, data) - 32usize];
    ["Offset of field: MotorStepCommandMsg_C::dataPointer"]
        [::core::mem::offset_of!(MotorStepCommandMsg_C, dataPointer) - 40usize];
    ["Offset of field: MotorStepCommandMsg_C::headerPointer"]
        [::core::mem::offset_of!(MotorStepCommandMsg_C, headerPointer) - 48usize];
};
impl Default for MotorStepCommandMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for attitude guidance"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NavAttMsg {
    #[doc = "!< [s]   Current vehicle time-tag associated with measurements*/"]
    pub timeTag: f64,
    #[doc = "!<       Current spacecraft attitude (MRPs) of body relative to inertial */"]
    pub sigma_BN: [f64; 3usize],
    #[doc = "!< [r/s] Current spacecraft angular velocity vector of body frame B relative to inertial frame N, in B frame components"]
    pub omega_BN_B: [f64; 3usize],
    #[doc = "!<       Current sun pointing vector in body frame"]
    pub vehSunPntBdy: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NavAttMsg"][::core::mem::size_of::<NavAttMsg>() - 80usize];
    ["Alignment of NavAttMsg"][::core::mem::align_of::<NavAttMsg>() - 8usize];
    ["Offset of field: NavAttMsg::timeTag"]
        [::core::mem::offset_of!(NavAttMsg, timeTag) - 0usize];
    ["Offset of field: NavAttMsg::sigma_BN"]
        [::core::mem::offset_of!(NavAttMsg, sigma_BN) - 8usize];
    ["Offset of field: NavAttMsg::omega_BN_B"]
        [::core::mem::offset_of!(NavAttMsg, omega_BN_B) - 32usize];
    ["Offset of field: NavAttMsg::vehSunPntBdy"]
        [::core::mem::offset_of!(NavAttMsg, vehSunPntBdy) - 56usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NavAttMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: NavAttMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut NavAttMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NavAttMsg_C"][::core::mem::size_of::<NavAttMsg_C>() - 128usize];
    ["Alignment of NavAttMsg_C"][::core::mem::align_of::<NavAttMsg_C>() - 8usize];
    ["Offset of field: NavAttMsg_C::header"][::core::mem::offset_of!(NavAttMsg_C, header) - 0usize];
    ["Offset of field: NavAttMsg_C::data"]
        [::core::mem::offset_of!(NavAttMsg_C, data) - 32usize];
    ["Offset of field: NavAttMsg_C::dataPointer"]
        [::core::mem::offset_of!(NavAttMsg_C, dataPointer) - 112usize];
    ["Offset of field: NavAttMsg_C::headerPointer"]
        [::core::mem::offset_of!(NavAttMsg_C, headerPointer) - 120usize];
};
impl Default for NavAttMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for translatoin guidance"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NavTransMsg {
    #[doc = "!< [s]   Current vehicle time-tag associated with measurements*/"]
    pub timeTag: f64,
    #[doc = "!< [m]   Current inertial spacecraft position vector in inertial frame N components"]
    pub r_BN_N: [f64; 3usize],
    #[doc = "!< [m/s] Current inertial velocity of the spacecraft in inertial frame N components"]
    pub v_BN_N: [f64; 3usize],
    #[doc = "!< [m/s] Total accumulated delta-velocity for s/c"]
    pub vehAccumDV: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NavTransMsg"][::core::mem::size_of::<NavTransMsg>() - 80usize];
    ["Alignment of NavTransMsg"][::core::mem::align_of::<NavTransMsg>() - 8usize];
    ["Offset of field: NavTransMsg::timeTag"]
        [::core::mem::offset_of!(NavTransMsg, timeTag) - 0usize];
    ["Offset of field: NavTransMsg::r_BN_N"]
        [::core::mem::offset_of!(NavTransMsg, r_BN_N) - 8usize];
    ["Offset of field: NavTransMsg::v_BN_N"]
        [::core::mem::offset_of!(NavTransMsg, v_BN_N) - 32usize];
    ["Offset of field: NavTransMsg::vehAccumDV"]
        [::core::mem::offset_of!(NavTransMsg, vehAccumDV) - 56usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NavTransMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: NavTransMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut NavTransMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NavTransMsg_C"][::core::mem::size_of::<NavTransMsg_C>() - 128usize];
    ["Alignment of NavTransMsg_C"][::core::mem::align_of::<NavTransMsg_C>() - 8usize];
    ["Offset of field: NavTransMsg_C::header"]
        [::core::mem::offset_of!(NavTransMsg_C, header) - 0usize];
    ["Offset of field: NavTransMsg_C::data"]
        [::core::mem::offset_of!(NavTransMsg_C, data) - 32usize];
    ["Offset of field: NavTransMsg_C::dataPointer"]
        [::core::mem::offset_of!(NavTransMsg_C, dataPointer) - 112usize];
    ["Offset of field: NavTransMsg_C::headerPointer"]
        [::core::mem::offset_of!(NavTransMsg_C, headerPointer) - 120usize];
};
impl Default for NavTransMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct OpNavCirclesMsg {
    #[doc = "!< --[ns]   Current vehicle time-tag associated with measurements"]
    pub timeTag: u64,
    #[doc = "!< --  Valid measurement if 1, not if 0"]
    pub valid: ::core::ffi::c_int,
    #[doc = "!< -- [-]   ID of the camera that took the snapshot"]
    pub cameraID: i64,
    #[doc = "!< -- [-]   Ids for identified celestial bodies"]
    pub planetIds: [f64; 10usize],
    #[doc = "!< -- [-]   Center x, y in pixels of the circles"]
    pub circlesCenters: [f64; 20usize],
    #[doc = "!< -- [-]   Radius rho in pixels of the circles"]
    pub circlesRadii: [f64; 10usize],
    #[doc = "!< -- [-] Uncertainty about the image processing results for x, y, rho (center and radius) for main circle"]
    pub uncertainty: [f64; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OpNavCirclesMsg"][::core::mem::size_of::<OpNavCirclesMsg>() - 416usize];
    ["Alignment of OpNavCirclesMsg"]
        [::core::mem::align_of::<OpNavCirclesMsg>() - 8usize];
    ["Offset of field: OpNavCirclesMsg::timeTag"]
        [::core::mem::offset_of!(OpNavCirclesMsg, timeTag) - 0usize];
    ["Offset of field: OpNavCirclesMsg::valid"]
        [::core::mem::offset_of!(OpNavCirclesMsg, valid) - 8usize];
    ["Offset of field: OpNavCirclesMsg::cameraID"]
        [::core::mem::offset_of!(OpNavCirclesMsg, cameraID) - 16usize];
    ["Offset of field: OpNavCirclesMsg::planetIds"]
        [::core::mem::offset_of!(OpNavCirclesMsg, planetIds) - 24usize];
    ["Offset of field: OpNavCirclesMsg::circlesCenters"]
        [::core::mem::offset_of!(OpNavCirclesMsg, circlesCenters) - 104usize];
    ["Offset of field: OpNavCirclesMsg::circlesRadii"]
        [::core::mem::offset_of!(OpNavCirclesMsg, circlesRadii) - 264usize];
    ["Offset of field: OpNavCirclesMsg::uncertainty"]
        [::core::mem::offset_of!(OpNavCirclesMsg, uncertainty) - 344usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpNavCirclesMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: OpNavCirclesMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut OpNavCirclesMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OpNavCirclesMsg_C"][::core::mem::size_of::<OpNavCirclesMsg_C>() - 464usize];
    ["Alignment of OpNavCirclesMsg_C"][::core::mem::align_of::<OpNavCirclesMsg_C>() - 8usize];
    ["Offset of field: OpNavCirclesMsg_C::header"]
        [::core::mem::offset_of!(OpNavCirclesMsg_C, header) - 0usize];
    ["Offset of field: OpNavCirclesMsg_C::data"]
        [::core::mem::offset_of!(OpNavCirclesMsg_C, data) - 32usize];
    ["Offset of field: OpNavCirclesMsg_C::dataPointer"]
        [::core::mem::offset_of!(OpNavCirclesMsg_C, dataPointer) - 448usize];
    ["Offset of field: OpNavCirclesMsg_C::headerPointer"]
        [::core::mem::offset_of!(OpNavCirclesMsg_C, headerPointer) - 456usize];
};
impl Default for OpNavCirclesMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief structure for filter-states output for the unscented kalman filter\nimplementation of the sunline state estimator"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpNavFilterMsg {
    #[doc = "!< [s] Current time of validity for output"]
    pub timeTag: f64,
    #[doc = "!< [-] Current covariance of the filter"]
    pub covar: [f64; 36usize],
    #[doc = "!< [-] Current estimated state of the filter"]
    pub state: [f64; 6usize],
    #[doc = "!< [-] Current deviation of the state from the reference state"]
    pub stateError: [f64; 6usize],
    #[doc = "!< [-] PostFit Residuals"]
    pub postFitRes: [f64; 3usize],
    #[doc = "!< [-] Valid observation count for this frame"]
    pub numObs: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OpNavFilterMsg"][::core::mem::size_of::<OpNavFilterMsg>() - 424usize];
    ["Alignment of OpNavFilterMsg"]
        [::core::mem::align_of::<OpNavFilterMsg>() - 8usize];
    ["Offset of field: OpNavFilterMsg::timeTag"]
        [::core::mem::offset_of!(OpNavFilterMsg, timeTag) - 0usize];
    ["Offset of field: OpNavFilterMsg::covar"]
        [::core::mem::offset_of!(OpNavFilterMsg, covar) - 8usize];
    ["Offset of field: OpNavFilterMsg::state"]
        [::core::mem::offset_of!(OpNavFilterMsg, state) - 296usize];
    ["Offset of field: OpNavFilterMsg::stateError"]
        [::core::mem::offset_of!(OpNavFilterMsg, stateError) - 344usize];
    ["Offset of field: OpNavFilterMsg::postFitRes"]
        [::core::mem::offset_of!(OpNavFilterMsg, postFitRes) - 392usize];
    ["Offset of field: OpNavFilterMsg::numObs"]
        [::core::mem::offset_of!(OpNavFilterMsg, numObs) - 416usize];
};
impl Default for OpNavFilterMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpNavFilterMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: OpNavFilterMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut OpNavFilterMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OpNavFilterMsg_C"][::core::mem::size_of::<OpNavFilterMsg_C>() - 472usize];
    ["Alignment of OpNavFilterMsg_C"][::core::mem::align_of::<OpNavFilterMsg_C>() - 8usize];
    ["Offset of field: OpNavFilterMsg_C::header"]
        [::core::mem::offset_of!(OpNavFilterMsg_C, header) - 0usize];
    ["Offset of field: OpNavFilterMsg_C::data"]
        [::core::mem::offset_of!(OpNavFilterMsg_C, data) - 32usize];
    ["Offset of field: OpNavFilterMsg_C::dataPointer"]
        [::core::mem::offset_of!(OpNavFilterMsg_C, dataPointer) - 456usize];
    ["Offset of field: OpNavFilterMsg_C::headerPointer"]
        [::core::mem::offset_of!(OpNavFilterMsg_C, headerPointer) - 464usize];
};
impl Default for OpNavFilterMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the message containing planet limb data for opNav"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpNavLimbMsg {
    #[doc = "!< --[s]   Current vehicle time-tag associated with measurements"]
    pub timeTag: f64,
    #[doc = "!< --  Valid measurement if 1, not if 0"]
    pub valid: ::core::ffi::c_int,
    #[doc = "!< -- [-] Number of limb points found"]
    pub numLimbPoints: i32,
    #[doc = "!< -- [-]   ID of the camera that took the snapshot"]
    pub cameraID: i64,
    #[doc = "!< -- [-]   ID for identified celestial body"]
    pub planetIds: f64,
    #[doc = "!< -- [-] (x, y) in pixels of the limb points"]
    pub limbPoints: [f64; 4000usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OpNavLimbMsg"][::core::mem::size_of::<OpNavLimbMsg>() - 32032usize];
    ["Alignment of OpNavLimbMsg"][::core::mem::align_of::<OpNavLimbMsg>() - 8usize];
    ["Offset of field: OpNavLimbMsg::timeTag"]
        [::core::mem::offset_of!(OpNavLimbMsg, timeTag) - 0usize];
    ["Offset of field: OpNavLimbMsg::valid"]
        [::core::mem::offset_of!(OpNavLimbMsg, valid) - 8usize];
    ["Offset of field: OpNavLimbMsg::numLimbPoints"]
        [::core::mem::offset_of!(OpNavLimbMsg, numLimbPoints) - 12usize];
    ["Offset of field: OpNavLimbMsg::cameraID"]
        [::core::mem::offset_of!(OpNavLimbMsg, cameraID) - 16usize];
    ["Offset of field: OpNavLimbMsg::planetIds"]
        [::core::mem::offset_of!(OpNavLimbMsg, planetIds) - 24usize];
    ["Offset of field: OpNavLimbMsg::limbPoints"]
        [::core::mem::offset_of!(OpNavLimbMsg, limbPoints) - 32usize];
};
impl Default for OpNavLimbMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpNavLimbMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: OpNavLimbMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut OpNavLimbMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OpNavLimbMsg_C"][::core::mem::size_of::<OpNavLimbMsg_C>() - 32080usize];
    ["Alignment of OpNavLimbMsg_C"][::core::mem::align_of::<OpNavLimbMsg_C>() - 8usize];
    ["Offset of field: OpNavLimbMsg_C::header"]
        [::core::mem::offset_of!(OpNavLimbMsg_C, header) - 0usize];
    ["Offset of field: OpNavLimbMsg_C::data"]
        [::core::mem::offset_of!(OpNavLimbMsg_C, data) - 32usize];
    ["Offset of field: OpNavLimbMsg_C::dataPointer"]
        [::core::mem::offset_of!(OpNavLimbMsg_C, dataPointer) - 32064usize];
    ["Offset of field: OpNavLimbMsg_C::headerPointer"]
        [::core::mem::offset_of!(OpNavLimbMsg_C, headerPointer) - 32072usize];
};
impl Default for OpNavLimbMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief structure for filter-states output for the unscented kalman filter\nimplementation of the sunline state estimator"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct OpNavMsg {
    #[doc = "!< [s] Current time of validity for output"]
    pub timeTag: f64,
    #[doc = "!< Valid measurement if 1, invalid if 0"]
    pub valid: ::core::ffi::c_int,
    #[doc = "!< [m^2] Current covariance of the filter"]
    pub covar_N: [f64; 9usize],
    #[doc = "!< [m^2] Current covariance of the filter"]
    pub covar_B: [f64; 9usize],
    #[doc = "!< [m^2] Current covariance of the filter"]
    pub covar_C: [f64; 9usize],
    #[doc = "!< [m] Current estimated state of the filter"]
    pub r_BN_N: [f64; 3usize],
    #[doc = "!< [m] Current estimated state of the filter"]
    pub r_BN_B: [f64; 3usize],
    #[doc = "!< [m] Current estimated state of the filter"]
    pub r_BN_C: [f64; 3usize],
    #[doc = "!< [-] Planet being navigated, Earth=1, Mars=2, Jupiter=3"]
    pub planetID: ::core::ffi::c_int,
    #[doc = "!< [-] Bool if a fault is detected"]
    pub faultDetected: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OpNavMsg"][::core::mem::size_of::<OpNavMsg>() - 312usize];
    ["Alignment of OpNavMsg"][::core::mem::align_of::<OpNavMsg>() - 8usize];
    ["Offset of field: OpNavMsg::timeTag"]
        [::core::mem::offset_of!(OpNavMsg, timeTag) - 0usize];
    ["Offset of field: OpNavMsg::valid"]
        [::core::mem::offset_of!(OpNavMsg, valid) - 8usize];
    ["Offset of field: OpNavMsg::covar_N"]
        [::core::mem::offset_of!(OpNavMsg, covar_N) - 16usize];
    ["Offset of field: OpNavMsg::covar_B"]
        [::core::mem::offset_of!(OpNavMsg, covar_B) - 88usize];
    ["Offset of field: OpNavMsg::covar_C"]
        [::core::mem::offset_of!(OpNavMsg, covar_C) - 160usize];
    ["Offset of field: OpNavMsg::r_BN_N"]
        [::core::mem::offset_of!(OpNavMsg, r_BN_N) - 232usize];
    ["Offset of field: OpNavMsg::r_BN_B"]
        [::core::mem::offset_of!(OpNavMsg, r_BN_B) - 256usize];
    ["Offset of field: OpNavMsg::r_BN_C"]
        [::core::mem::offset_of!(OpNavMsg, r_BN_C) - 280usize];
    ["Offset of field: OpNavMsg::planetID"]
        [::core::mem::offset_of!(OpNavMsg, planetID) - 304usize];
    ["Offset of field: OpNavMsg::faultDetected"]
        [::core::mem::offset_of!(OpNavMsg, faultDetected) - 308usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpNavMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: OpNavMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut OpNavMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OpNavMsg_C"][::core::mem::size_of::<OpNavMsg_C>() - 360usize];
    ["Alignment of OpNavMsg_C"][::core::mem::align_of::<OpNavMsg_C>() - 8usize];
    ["Offset of field: OpNavMsg_C::header"][::core::mem::offset_of!(OpNavMsg_C, header) - 0usize];
    ["Offset of field: OpNavMsg_C::data"]
        [::core::mem::offset_of!(OpNavMsg_C, data) - 32usize];
    ["Offset of field: OpNavMsg_C::dataPointer"]
        [::core::mem::offset_of!(OpNavMsg_C, dataPointer) - 344usize];
    ["Offset of field: OpNavMsg_C::headerPointer"]
        [::core::mem::offset_of!(OpNavMsg_C, headerPointer) - 352usize];
};
impl Default for OpNavMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief structure for filter-states output for the unscented kalman filter\nimplementation of the sunline state estimator"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixelLineFilterMsg {
    #[doc = "!< [s] Current time of validity for output"]
    pub timeTag: f64,
    #[doc = "!< [-] Current covariance of the filter"]
    pub covar: [f64; 81usize],
    #[doc = "!< [-] Current estimated state of the filter"]
    pub state: [f64; 9usize],
    #[doc = "!< [-] Current deviation of the state from the reference state"]
    pub stateError: [f64; 9usize],
    #[doc = "!< [-] PostFit Residuals"]
    pub postFitRes: [f64; 6usize],
    #[doc = "!< [-] Valid observation count for this frame"]
    pub numObs: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PixelLineFilterMsg"]
        [::core::mem::size_of::<PixelLineFilterMsg>() - 856usize];
    ["Alignment of PixelLineFilterMsg"]
        [::core::mem::align_of::<PixelLineFilterMsg>() - 8usize];
    ["Offset of field: PixelLineFilterMsg::timeTag"]
        [::core::mem::offset_of!(PixelLineFilterMsg, timeTag) - 0usize];
    ["Offset of field: PixelLineFilterMsg::covar"]
        [::core::mem::offset_of!(PixelLineFilterMsg, covar) - 8usize];
    ["Offset of field: PixelLineFilterMsg::state"]
        [::core::mem::offset_of!(PixelLineFilterMsg, state) - 656usize];
    ["Offset of field: PixelLineFilterMsg::stateError"]
        [::core::mem::offset_of!(PixelLineFilterMsg, stateError) - 728usize];
    ["Offset of field: PixelLineFilterMsg::postFitRes"]
        [::core::mem::offset_of!(PixelLineFilterMsg, postFitRes) - 800usize];
    ["Offset of field: PixelLineFilterMsg::numObs"]
        [::core::mem::offset_of!(PixelLineFilterMsg, numObs) - 848usize];
};
impl Default for PixelLineFilterMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixelLineFilterMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PixelLineFilterMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PixelLineFilterMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PixelLineFilterMsg_C"][::core::mem::size_of::<PixelLineFilterMsg_C>() - 904usize];
    ["Alignment of PixelLineFilterMsg_C"][::core::mem::align_of::<PixelLineFilterMsg_C>() - 8usize];
    ["Offset of field: PixelLineFilterMsg_C::header"]
        [::core::mem::offset_of!(PixelLineFilterMsg_C, header) - 0usize];
    ["Offset of field: PixelLineFilterMsg_C::data"]
        [::core::mem::offset_of!(PixelLineFilterMsg_C, data) - 32usize];
    ["Offset of field: PixelLineFilterMsg_C::dataPointer"]
        [::core::mem::offset_of!(PixelLineFilterMsg_C, dataPointer) - 888usize];
    ["Offset of field: PixelLineFilterMsg_C::headerPointer"]
        [::core::mem::offset_of!(PixelLineFilterMsg_C, headerPointer) - 896usize];
};
impl Default for PixelLineFilterMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "!@brief space weather ambient plasma flux message definition."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PlasmaFluxMsg {
    #[doc = "!< [m^-2 s^-1 sr^-2 eV^-1] differential flux"]
    pub meanElectronFlux: [f64; 50usize],
    #[doc = "!< [m^-2 s^-1 sr^-2 eV^-1] differential flux"]
    pub meanIonFlux: [f64; 50usize],
    #[doc = "!< [eV]"]
    pub energies: [f64; 50usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PlasmaFluxMsg"][::core::mem::size_of::<PlasmaFluxMsg>() - 1200usize];
    ["Alignment of PlasmaFluxMsg"][::core::mem::align_of::<PlasmaFluxMsg>() - 8usize];
    ["Offset of field: PlasmaFluxMsg::meanElectronFlux"]
        [::core::mem::offset_of!(PlasmaFluxMsg, meanElectronFlux) - 0usize];
    ["Offset of field: PlasmaFluxMsg::meanIonFlux"]
        [::core::mem::offset_of!(PlasmaFluxMsg, meanIonFlux) - 400usize];
    ["Offset of field: PlasmaFluxMsg::energies"]
        [::core::mem::offset_of!(PlasmaFluxMsg, energies) - 800usize];
};
impl Default for PlasmaFluxMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PlasmaFluxMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PlasmaFluxMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PlasmaFluxMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PlasmaFluxMsg_C"][::core::mem::size_of::<PlasmaFluxMsg_C>() - 1248usize];
    ["Alignment of PlasmaFluxMsg_C"][::core::mem::align_of::<PlasmaFluxMsg_C>() - 8usize];
    ["Offset of field: PlasmaFluxMsg_C::header"]
        [::core::mem::offset_of!(PlasmaFluxMsg_C, header) - 0usize];
    ["Offset of field: PlasmaFluxMsg_C::data"]
        [::core::mem::offset_of!(PlasmaFluxMsg_C, data) - 32usize];
    ["Offset of field: PlasmaFluxMsg_C::dataPointer"]
        [::core::mem::offset_of!(PlasmaFluxMsg_C, dataPointer) - 1232usize];
    ["Offset of field: PlasmaFluxMsg_C::headerPointer"]
        [::core::mem::offset_of!(PlasmaFluxMsg_C, headerPointer) - 1240usize];
};
impl Default for PlasmaFluxMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! @brief Power node command message used to change the state of power modules."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PowerNodeStatusMsg {
    #[doc = "!< Power status indicator; 0 is off, 1 is on, additional values"]
    pub powerStatus: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PowerNodeStatusMsg"]
        [::core::mem::size_of::<PowerNodeStatusMsg>() - 8usize];
    ["Alignment of PowerNodeStatusMsg"]
        [::core::mem::align_of::<PowerNodeStatusMsg>() - 8usize];
    ["Offset of field: PowerNodeStatusMsg::powerStatus"]
        [::core::mem::offset_of!(PowerNodeStatusMsg, powerStatus) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PowerNodeStatusMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PowerNodeStatusMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PowerNodeStatusMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PowerNodeStatusMsg_C"][::core::mem::size_of::<PowerNodeStatusMsg_C>() - 56usize];
    ["Alignment of PowerNodeStatusMsg_C"][::core::mem::align_of::<PowerNodeStatusMsg_C>() - 8usize];
    ["Offset of field: PowerNodeStatusMsg_C::header"]
        [::core::mem::offset_of!(PowerNodeStatusMsg_C, header) - 0usize];
    ["Offset of field: PowerNodeStatusMsg_C::data"]
        [::core::mem::offset_of!(PowerNodeStatusMsg_C, data) - 32usize];
    ["Offset of field: PowerNodeStatusMsg_C::dataPointer"]
        [::core::mem::offset_of!(PowerNodeStatusMsg_C, dataPointer) - 40usize];
    ["Offset of field: PowerNodeStatusMsg_C::headerPointer"]
        [::core::mem::offset_of!(PowerNodeStatusMsg_C, headerPointer) - 48usize];
};
impl Default for PowerNodeStatusMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message for reporting the power consumed produced or consumed by a module."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PowerNodeUsageMsg {
    #[doc = "!< [W] Power usage by the message writer; positive for sources, negative for sinks"]
    pub netPower: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PowerNodeUsageMsg"]
        [::core::mem::size_of::<PowerNodeUsageMsg>() - 8usize];
    ["Alignment of PowerNodeUsageMsg"]
        [::core::mem::align_of::<PowerNodeUsageMsg>() - 8usize];
    ["Offset of field: PowerNodeUsageMsg::netPower"]
        [::core::mem::offset_of!(PowerNodeUsageMsg, netPower) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PowerNodeUsageMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PowerNodeUsageMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PowerNodeUsageMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PowerNodeUsageMsg_C"][::core::mem::size_of::<PowerNodeUsageMsg_C>() - 56usize];
    ["Alignment of PowerNodeUsageMsg_C"][::core::mem::align_of::<PowerNodeUsageMsg_C>() - 8usize];
    ["Offset of field: PowerNodeUsageMsg_C::header"]
        [::core::mem::offset_of!(PowerNodeUsageMsg_C, header) - 0usize];
    ["Offset of field: PowerNodeUsageMsg_C::data"]
        [::core::mem::offset_of!(PowerNodeUsageMsg_C, data) - 32usize];
    ["Offset of field: PowerNodeUsageMsg_C::dataPointer"]
        [::core::mem::offset_of!(PowerNodeUsageMsg_C, dataPointer) - 40usize];
    ["Offset of field: PowerNodeUsageMsg_C::headerPointer"]
        [::core::mem::offset_of!(PowerNodeUsageMsg_C, headerPointer) - 48usize];
};
impl Default for PowerNodeUsageMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message to store current battery stored charge, maximum charge, and received power."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PowerStorageFaultMsg {
    #[doc = "!< Fault capacity ratio (faulted capacity / nominal capacity)"]
    pub faultCapacityRatio: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PowerStorageFaultMsg"]
        [::core::mem::size_of::<PowerStorageFaultMsg>() - 8usize];
    ["Alignment of PowerStorageFaultMsg"]
        [::core::mem::align_of::<PowerStorageFaultMsg>() - 8usize];
    ["Offset of field: PowerStorageFaultMsg::faultCapacityRatio"]
        [::core::mem::offset_of!(PowerStorageFaultMsg, faultCapacityRatio) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PowerStorageFaultMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PowerStorageFaultMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PowerStorageFaultMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PowerStorageFaultMsg_C"][::core::mem::size_of::<PowerStorageFaultMsg_C>() - 56usize];
    ["Alignment of PowerStorageFaultMsg_C"]
        [::core::mem::align_of::<PowerStorageFaultMsg_C>() - 8usize];
    ["Offset of field: PowerStorageFaultMsg_C::header"]
        [::core::mem::offset_of!(PowerStorageFaultMsg_C, header) - 0usize];
    ["Offset of field: PowerStorageFaultMsg_C::data"]
        [::core::mem::offset_of!(PowerStorageFaultMsg_C, data) - 32usize];
    ["Offset of field: PowerStorageFaultMsg_C::dataPointer"]
        [::core::mem::offset_of!(PowerStorageFaultMsg_C, dataPointer) - 40usize];
    ["Offset of field: PowerStorageFaultMsg_C::headerPointer"]
        [::core::mem::offset_of!(PowerStorageFaultMsg_C, headerPointer) - 48usize];
};
impl Default for PowerStorageFaultMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message to store current battery stored charge, maximum charge, and received power."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PowerStorageStatusMsg {
    #[doc = "!< [W-s] Battery stored charge in Watt-hours."]
    pub storageLevel: f64,
    #[doc = "!< [W-s] Maximum battery storage capacity."]
    pub storageCapacity: f64,
    #[doc = "!< [W] Current net power received/drained from the battery."]
    pub currentNetPower: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PowerStorageStatusMsg"]
        [::core::mem::size_of::<PowerStorageStatusMsg>() - 24usize];
    ["Alignment of PowerStorageStatusMsg"]
        [::core::mem::align_of::<PowerStorageStatusMsg>() - 8usize];
    ["Offset of field: PowerStorageStatusMsg::storageLevel"]
        [::core::mem::offset_of!(PowerStorageStatusMsg, storageLevel) - 0usize];
    ["Offset of field: PowerStorageStatusMsg::storageCapacity"]
        [::core::mem::offset_of!(PowerStorageStatusMsg, storageCapacity) - 8usize];
    ["Offset of field: PowerStorageStatusMsg::currentNetPower"]
        [::core::mem::offset_of!(PowerStorageStatusMsg, currentNetPower) - 16usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PowerStorageStatusMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PowerStorageStatusMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PowerStorageStatusMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PowerStorageStatusMsg_C"]
        [::core::mem::size_of::<PowerStorageStatusMsg_C>() - 72usize];
    ["Alignment of PowerStorageStatusMsg_C"]
        [::core::mem::align_of::<PowerStorageStatusMsg_C>() - 8usize];
    ["Offset of field: PowerStorageStatusMsg_C::header"]
        [::core::mem::offset_of!(PowerStorageStatusMsg_C, header) - 0usize];
    ["Offset of field: PowerStorageStatusMsg_C::data"]
        [::core::mem::offset_of!(PowerStorageStatusMsg_C, data) - 32usize];
    ["Offset of field: PowerStorageStatusMsg_C::dataPointer"]
        [::core::mem::offset_of!(PowerStorageStatusMsg_C, dataPointer) - 56usize];
    ["Offset of field: PowerStorageStatusMsg_C::headerPointer"]
        [::core::mem::offset_of!(PowerStorageStatusMsg_C, headerPointer) - 64usize];
};
impl Default for PowerStorageStatusMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the individual prescribed motion state effector data message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PrescribedMotionMsg {
    #[doc = "!< [m] position vector from the M frame origin to the P frame origin in M frame components"]
    pub r_PM_M: [f64; 3usize],
    #[doc = "!< [m/s] B frame time derivative of r_PM_M"]
    pub rPrime_PM_M: [f64; 3usize],
    #[doc = "!< [m/s^2] B frame time derivative of rPrime_PM_M"]
    pub rPrimePrime_PM_M: [f64; 3usize],
    #[doc = "!< [rad/s] Angular velocity of the P frame wrt the M frame in P frame components"]
    pub omega_PM_P: [f64; 3usize],
    #[doc = "!< [rad/s^2] B frame time derivative of omega_PM_P"]
    pub omegaPrime_PM_P: [f64; 3usize],
    #[doc = "!< MRP attitude parameters for the P frame relative to the M frame"]
    pub sigma_PM: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrescribedMotionMsg"]
        [::core::mem::size_of::<PrescribedMotionMsg>() - 144usize];
    ["Alignment of PrescribedMotionMsg"]
        [::core::mem::align_of::<PrescribedMotionMsg>() - 8usize];
    ["Offset of field: PrescribedMotionMsg::r_PM_M"]
        [::core::mem::offset_of!(PrescribedMotionMsg, r_PM_M) - 0usize];
    ["Offset of field: PrescribedMotionMsg::rPrime_PM_M"]
        [::core::mem::offset_of!(PrescribedMotionMsg, rPrime_PM_M) - 24usize];
    ["Offset of field: PrescribedMotionMsg::rPrimePrime_PM_M"]
        [::core::mem::offset_of!(PrescribedMotionMsg, rPrimePrime_PM_M) - 48usize];
    ["Offset of field: PrescribedMotionMsg::omega_PM_P"]
        [::core::mem::offset_of!(PrescribedMotionMsg, omega_PM_P) - 72usize];
    ["Offset of field: PrescribedMotionMsg::omegaPrime_PM_P"]
        [::core::mem::offset_of!(PrescribedMotionMsg, omegaPrime_PM_P) - 96usize];
    ["Offset of field: PrescribedMotionMsg::sigma_PM"]
        [::core::mem::offset_of!(PrescribedMotionMsg, sigma_PM) - 120usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PrescribedMotionMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PrescribedMotionMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PrescribedMotionMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrescribedMotionMsg_C"][::core::mem::size_of::<PrescribedMotionMsg_C>() - 192usize];
    ["Alignment of PrescribedMotionMsg_C"]
        [::core::mem::align_of::<PrescribedMotionMsg_C>() - 8usize];
    ["Offset of field: PrescribedMotionMsg_C::header"]
        [::core::mem::offset_of!(PrescribedMotionMsg_C, header) - 0usize];
    ["Offset of field: PrescribedMotionMsg_C::data"]
        [::core::mem::offset_of!(PrescribedMotionMsg_C, data) - 32usize];
    ["Offset of field: PrescribedMotionMsg_C::dataPointer"]
        [::core::mem::offset_of!(PrescribedMotionMsg_C, dataPointer) - 176usize];
    ["Offset of field: PrescribedMotionMsg_C::headerPointer"]
        [::core::mem::offset_of!(PrescribedMotionMsg_C, headerPointer) - 184usize];
};
impl Default for PrescribedMotionMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the prescribed motion state effector rotational state data message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PrescribedRotationMsg {
    #[doc = "!< [rad/s] Angular velocity of the P frame wrt the M frame in P frame components"]
    pub omega_PM_P: [f64; 3usize],
    #[doc = "!< [rad/s^2] B/M frame time derivative of omega_PM_P"]
    pub omegaPrime_PM_P: [f64; 3usize],
    #[doc = "!< MRP attitude parameters for the P frame relative to the M frame"]
    pub sigma_PM: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrescribedRotationMsg"]
        [::core::mem::size_of::<PrescribedRotationMsg>() - 72usize];
    ["Alignment of PrescribedRotationMsg"]
        [::core::mem::align_of::<PrescribedRotationMsg>() - 8usize];
    ["Offset of field: PrescribedRotationMsg::omega_PM_P"]
        [::core::mem::offset_of!(PrescribedRotationMsg, omega_PM_P) - 0usize];
    ["Offset of field: PrescribedRotationMsg::omegaPrime_PM_P"]
        [::core::mem::offset_of!(PrescribedRotationMsg, omegaPrime_PM_P) - 24usize];
    ["Offset of field: PrescribedRotationMsg::sigma_PM"]
        [::core::mem::offset_of!(PrescribedRotationMsg, sigma_PM) - 48usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PrescribedRotationMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PrescribedRotationMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PrescribedRotationMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrescribedRotationMsg_C"]
        [::core::mem::size_of::<PrescribedRotationMsg_C>() - 120usize];
    ["Alignment of PrescribedRotationMsg_C"]
        [::core::mem::align_of::<PrescribedRotationMsg_C>() - 8usize];
    ["Offset of field: PrescribedRotationMsg_C::header"]
        [::core::mem::offset_of!(PrescribedRotationMsg_C, header) - 0usize];
    ["Offset of field: PrescribedRotationMsg_C::data"]
        [::core::mem::offset_of!(PrescribedRotationMsg_C, data) - 32usize];
    ["Offset of field: PrescribedRotationMsg_C::dataPointer"]
        [::core::mem::offset_of!(PrescribedRotationMsg_C, dataPointer) - 104usize];
    ["Offset of field: PrescribedRotationMsg_C::headerPointer"]
        [::core::mem::offset_of!(PrescribedRotationMsg_C, headerPointer) - 112usize];
};
impl Default for PrescribedRotationMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the prescribed motion state effector translational state data message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PrescribedTranslationMsg {
    #[doc = "!< [m] Position vector from the M frame origin to the P frame origin expressed in M frame components"]
    pub r_PM_M: [f64; 3usize],
    #[doc = "!< [m/s] B/M frame time derivative of r_PM_M"]
    pub rPrime_PM_M: [f64; 3usize],
    #[doc = "!< [m/s^2] B/M frame time derivative of rPrime_PM_M"]
    pub rPrimePrime_PM_M: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrescribedTranslationMsg"]
        [::core::mem::size_of::<PrescribedTranslationMsg>() - 72usize];
    ["Alignment of PrescribedTranslationMsg"]
        [::core::mem::align_of::<PrescribedTranslationMsg>() - 8usize];
    ["Offset of field: PrescribedTranslationMsg::r_PM_M"]
        [::core::mem::offset_of!(PrescribedTranslationMsg, r_PM_M) - 0usize];
    ["Offset of field: PrescribedTranslationMsg::rPrime_PM_M"]
        [::core::mem::offset_of!(PrescribedTranslationMsg, rPrime_PM_M) - 24usize];
    ["Offset of field: PrescribedTranslationMsg::rPrimePrime_PM_M"]
        [::core::mem::offset_of!(PrescribedTranslationMsg, rPrimePrime_PM_M) - 48usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PrescribedTranslationMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PrescribedTranslationMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PrescribedTranslationMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrescribedTranslationMsg_C"]
        [::core::mem::size_of::<PrescribedTranslationMsg_C>() - 120usize];
    ["Alignment of PrescribedTranslationMsg_C"]
        [::core::mem::align_of::<PrescribedTranslationMsg_C>() - 8usize];
    ["Offset of field: PrescribedTranslationMsg_C::header"]
        [::core::mem::offset_of!(PrescribedTranslationMsg_C, header) - 0usize];
    ["Offset of field: PrescribedTranslationMsg_C::data"]
        [::core::mem::offset_of!(PrescribedTranslationMsg_C, data) - 32usize];
    ["Offset of field: PrescribedTranslationMsg_C::dataPointer"]
        [::core::mem::offset_of!(PrescribedTranslationMsg_C, dataPointer) - 104usize];
    ["Offset of field: PrescribedTranslationMsg_C::headerPointer"]
        [::core::mem::offset_of!(PrescribedTranslationMsg_C, headerPointer) - 112usize];
};
impl Default for PrescribedTranslationMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define projected area"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ProjectedAreaMsg {
    #[doc = "!< [m^2] Projected area"]
    pub area: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProjectedAreaMsg"][::core::mem::size_of::<ProjectedAreaMsg>() - 8usize];
    ["Alignment of ProjectedAreaMsg"]
        [::core::mem::align_of::<ProjectedAreaMsg>() - 8usize];
    ["Offset of field: ProjectedAreaMsg::area"]
        [::core::mem::offset_of!(ProjectedAreaMsg, area) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ProjectedAreaMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ProjectedAreaMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ProjectedAreaMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ProjectedAreaMsg_C"][::core::mem::size_of::<ProjectedAreaMsg_C>() - 56usize];
    ["Alignment of ProjectedAreaMsg_C"][::core::mem::align_of::<ProjectedAreaMsg_C>() - 8usize];
    ["Offset of field: ProjectedAreaMsg_C::header"]
        [::core::mem::offset_of!(ProjectedAreaMsg_C, header) - 0usize];
    ["Offset of field: ProjectedAreaMsg_C::data"]
        [::core::mem::offset_of!(ProjectedAreaMsg_C, data) - 32usize];
    ["Offset of field: ProjectedAreaMsg_C::dataPointer"]
        [::core::mem::offset_of!(ProjectedAreaMsg_C, dataPointer) - 40usize];
    ["Offset of field: ProjectedAreaMsg_C::headerPointer"]
        [::core::mem::offset_of!(ProjectedAreaMsg_C, headerPointer) - 48usize];
};
impl Default for ProjectedAreaMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! @brief Container for all battery output data\n*! This structure contains all data output by the python battery module*/"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PyBatteryMsg {
    #[doc = "!< [%] Battery state of charge as %-full"]
    pub stateOfCharge: f64,
    #[doc = "!< [Ah] Battery state of charge un-scaled"]
    pub stateOfChargeAh: f64,
    #[doc = "!< [K] Temperature of solar arrays"]
    pub solarArrayTemperature: f64,
    #[doc = "!< [V] Bus voltage"]
    pub busVoltage: f64,
    #[doc = "!< [A] Total current flowing through battery"]
    pub batteryCurrent: f64,
    #[doc = "!< [A] Current sent to battery from solar arrays"]
    pub solarArrayCurrent: f64,
    #[doc = "!< [V] Electro-motive force of battery at this current form look-up table"]
    pub batteryEMF: f64,
    #[doc = "!< [Ohms] Equivalent Series Resistance of battery from look-up table"]
    pub batteryESR: f64,
    #[doc = "!< [V] total voltage across battery"]
    pub batteryVoltage: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PyBatteryMsg"][::core::mem::size_of::<PyBatteryMsg>() - 72usize];
    ["Alignment of PyBatteryMsg"][::core::mem::align_of::<PyBatteryMsg>() - 8usize];
    ["Offset of field: PyBatteryMsg::stateOfCharge"]
        [::core::mem::offset_of!(PyBatteryMsg, stateOfCharge) - 0usize];
    ["Offset of field: PyBatteryMsg::stateOfChargeAh"]
        [::core::mem::offset_of!(PyBatteryMsg, stateOfChargeAh) - 8usize];
    ["Offset of field: PyBatteryMsg::solarArrayTemperature"]
        [::core::mem::offset_of!(PyBatteryMsg, solarArrayTemperature) - 16usize];
    ["Offset of field: PyBatteryMsg::busVoltage"]
        [::core::mem::offset_of!(PyBatteryMsg, busVoltage) - 24usize];
    ["Offset of field: PyBatteryMsg::batteryCurrent"]
        [::core::mem::offset_of!(PyBatteryMsg, batteryCurrent) - 32usize];
    ["Offset of field: PyBatteryMsg::solarArrayCurrent"]
        [::core::mem::offset_of!(PyBatteryMsg, solarArrayCurrent) - 40usize];
    ["Offset of field: PyBatteryMsg::batteryEMF"]
        [::core::mem::offset_of!(PyBatteryMsg, batteryEMF) - 48usize];
    ["Offset of field: PyBatteryMsg::batteryESR"]
        [::core::mem::offset_of!(PyBatteryMsg, batteryESR) - 56usize];
    ["Offset of field: PyBatteryMsg::batteryVoltage"]
        [::core::mem::offset_of!(PyBatteryMsg, batteryVoltage) - 64usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyBatteryMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: PyBatteryMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut PyBatteryMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PyBatteryMsg_C"][::core::mem::size_of::<PyBatteryMsg_C>() - 120usize];
    ["Alignment of PyBatteryMsg_C"][::core::mem::align_of::<PyBatteryMsg_C>() - 8usize];
    ["Offset of field: PyBatteryMsg_C::header"]
        [::core::mem::offset_of!(PyBatteryMsg_C, header) - 0usize];
    ["Offset of field: PyBatteryMsg_C::data"]
        [::core::mem::offset_of!(PyBatteryMsg_C, data) - 32usize];
    ["Offset of field: PyBatteryMsg_C::dataPointer"]
        [::core::mem::offset_of!(PyBatteryMsg_C, dataPointer) - 104usize];
    ["Offset of field: PyBatteryMsg_C::headerPointer"]
        [::core::mem::offset_of!(PyBatteryMsg_C, headerPointer) - 112usize];
};
impl Default for PyBatteryMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief RW array configuration FSW msg"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWArrayConfigMsg {
    #[doc = "!< [-]    The RW spin axis matrix in body frame components"]
    pub GsMatrix_B: [f64; 108usize],
    #[doc = "!< [kgm2] The spin axis inertia for RWs"]
    pub JsList: [f64; 36usize],
    #[doc = "!< [-]    The number of reaction wheels available on vehicle"]
    pub numRW: ::core::ffi::c_int,
    #[doc = "!< [Nm]   The maximum RW motor torque"]
    pub uMax: [f64; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWArrayConfigMsg"]
        [::core::mem::size_of::<RWArrayConfigMsg>() - 1448usize];
    ["Alignment of RWArrayConfigMsg"]
        [::core::mem::align_of::<RWArrayConfigMsg>() - 8usize];
    ["Offset of field: RWArrayConfigMsg::GsMatrix_B"]
        [::core::mem::offset_of!(RWArrayConfigMsg, GsMatrix_B) - 0usize];
    ["Offset of field: RWArrayConfigMsg::JsList"]
        [::core::mem::offset_of!(RWArrayConfigMsg, JsList) - 864usize];
    ["Offset of field: RWArrayConfigMsg::numRW"]
        [::core::mem::offset_of!(RWArrayConfigMsg, numRW) - 1152usize];
    ["Offset of field: RWArrayConfigMsg::uMax"]
        [::core::mem::offset_of!(RWArrayConfigMsg, uMax) - 1160usize];
};
impl Default for RWArrayConfigMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWArrayConfigMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: RWArrayConfigMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut RWArrayConfigMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWArrayConfigMsg_C"][::core::mem::size_of::<RWArrayConfigMsg_C>() - 1496usize];
    ["Alignment of RWArrayConfigMsg_C"][::core::mem::align_of::<RWArrayConfigMsg_C>() - 8usize];
    ["Offset of field: RWArrayConfigMsg_C::header"]
        [::core::mem::offset_of!(RWArrayConfigMsg_C, header) - 0usize];
    ["Offset of field: RWArrayConfigMsg_C::data"]
        [::core::mem::offset_of!(RWArrayConfigMsg_C, data) - 32usize];
    ["Offset of field: RWArrayConfigMsg_C::dataPointer"]
        [::core::mem::offset_of!(RWArrayConfigMsg_C, dataPointer) - 1480usize];
    ["Offset of field: RWArrayConfigMsg_C::headerPointer"]
        [::core::mem::offset_of!(RWArrayConfigMsg_C, headerPointer) - 1488usize];
};
impl Default for RWArrayConfigMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const AVAILABLE: FSWdeviceAvailability = 0;
pub const UNAVAILABLE: FSWdeviceAvailability = 1;
#[doc = " @brief Structure used to define the output definition for component availability"]
pub type FSWdeviceAvailability = ::core::ffi::c_uint;
#[doc = " @brief Array with availability of RW"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWAvailabilityMsg {
    #[doc = "!< The current state of the wheel"]
    pub wheelAvailability: [FSWdeviceAvailability; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWAvailabilityMsg"]
        [::core::mem::size_of::<RWAvailabilityMsg>() - 144usize];
    ["Alignment of RWAvailabilityMsg"]
        [::core::mem::align_of::<RWAvailabilityMsg>() - 4usize];
    ["Offset of field: RWAvailabilityMsg::wheelAvailability"]
        [::core::mem::offset_of!(RWAvailabilityMsg, wheelAvailability) - 0usize];
};
impl Default for RWAvailabilityMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWAvailabilityMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: RWAvailabilityMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut RWAvailabilityMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWAvailabilityMsg_C"][::core::mem::size_of::<RWAvailabilityMsg_C>() - 192usize];
    ["Alignment of RWAvailabilityMsg_C"][::core::mem::align_of::<RWAvailabilityMsg_C>() - 8usize];
    ["Offset of field: RWAvailabilityMsg_C::header"]
        [::core::mem::offset_of!(RWAvailabilityMsg_C, header) - 0usize];
    ["Offset of field: RWAvailabilityMsg_C::data"]
        [::core::mem::offset_of!(RWAvailabilityMsg_C, data) - 32usize];
    ["Offset of field: RWAvailabilityMsg_C::dataPointer"]
        [::core::mem::offset_of!(RWAvailabilityMsg_C, dataPointer) - 176usize];
    ["Offset of field: RWAvailabilityMsg_C::headerPointer"]
        [::core::mem::offset_of!(RWAvailabilityMsg_C, headerPointer) - 184usize];
};
impl Default for RWAvailabilityMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the individual RW motor torque command message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RWCmdMsg {
    #[doc = "!< [Nm], torque command for individual RW"]
    pub u_cmd: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWCmdMsg"][::core::mem::size_of::<RWCmdMsg>() - 8usize];
    ["Alignment of RWCmdMsg"][::core::mem::align_of::<RWCmdMsg>() - 8usize];
    ["Offset of field: RWCmdMsg::u_cmd"]
        [::core::mem::offset_of!(RWCmdMsg, u_cmd) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWCmdMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: RWCmdMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut RWCmdMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWCmdMsg_C"][::core::mem::size_of::<RWCmdMsg_C>() - 56usize];
    ["Alignment of RWCmdMsg_C"][::core::mem::align_of::<RWCmdMsg_C>() - 8usize];
    ["Offset of field: RWCmdMsg_C::header"][::core::mem::offset_of!(RWCmdMsg_C, header) - 0usize];
    ["Offset of field: RWCmdMsg_C::data"]
        [::core::mem::offset_of!(RWCmdMsg_C, data) - 32usize];
    ["Offset of field: RWCmdMsg_C::dataPointer"]
        [::core::mem::offset_of!(RWCmdMsg_C, dataPointer) - 40usize];
    ["Offset of field: RWCmdMsg_C::headerPointer"]
        [::core::mem::offset_of!(RWCmdMsg_C, headerPointer) - 48usize];
};
impl Default for RWCmdMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message used to define a single FSW RW configuration message"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RWConfigElementMsg {
    #[doc = "!< [-] Spin axis unit vector of the wheel in structure"]
    pub gsHat_B: [f64; 3usize],
    #[doc = "!< [kgm2] Spin axis inertia of the wheel"]
    pub Js: f64,
    #[doc = "!< [Nm]   maximum RW motor torque"]
    pub uMax: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWConfigElementMsg"]
        [::core::mem::size_of::<RWConfigElementMsg>() - 40usize];
    ["Alignment of RWConfigElementMsg"]
        [::core::mem::align_of::<RWConfigElementMsg>() - 8usize];
    ["Offset of field: RWConfigElementMsg::gsHat_B"]
        [::core::mem::offset_of!(RWConfigElementMsg, gsHat_B) - 0usize];
    ["Offset of field: RWConfigElementMsg::Js"]
        [::core::mem::offset_of!(RWConfigElementMsg, Js) - 24usize];
    ["Offset of field: RWConfigElementMsg::uMax"]
        [::core::mem::offset_of!(RWConfigElementMsg, uMax) - 32usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWConfigElementMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: RWConfigElementMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut RWConfigElementMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWConfigElementMsg_C"][::core::mem::size_of::<RWConfigElementMsg_C>() - 88usize];
    ["Alignment of RWConfigElementMsg_C"][::core::mem::align_of::<RWConfigElementMsg_C>() - 8usize];
    ["Offset of field: RWConfigElementMsg_C::header"]
        [::core::mem::offset_of!(RWConfigElementMsg_C, header) - 0usize];
    ["Offset of field: RWConfigElementMsg_C::data"]
        [::core::mem::offset_of!(RWConfigElementMsg_C, data) - 32usize];
    ["Offset of field: RWConfigElementMsg_C::dataPointer"]
        [::core::mem::offset_of!(RWConfigElementMsg_C, dataPointer) - 72usize];
    ["Offset of field: RWConfigElementMsg_C::headerPointer"]
        [::core::mem::offset_of!(RWConfigElementMsg_C, headerPointer) - 80usize];
};
impl Default for RWConfigElementMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const BalancedWheels: RWModels = 0;
pub const JitterSimple: RWModels = 1;
pub const JitterFullyCoupled: RWModels = 2;
#[doc = " @brief enumeration definiting the types of RW modes"]
pub type RWModels = ::core::ffi::c_uint;
#[doc = " @brief Structure used to define the individual RW configuration data message"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWConfigLogMsg {
    #[doc = "!< [m], position vector of the RW relative to the spacecraft body frame"]
    pub rWB_B: [f64; 3usize],
    #[doc = "!< [-] spin axis unit vector in body frame"]
    pub gsHat_B: [f64; 3usize],
    #[doc = "!< [-] initial torque axis unit vector in body frame"]
    pub w2Hat0_B: [f64; 3usize],
    #[doc = "!< [-] initial gimbal axis unit vector in body frame"]
    pub w3Hat0_B: [f64; 3usize],
    #[doc = "!< [kg], reaction wheel rotor mass"]
    pub mass: f64,
    #[doc = "!< [rad], wheel angle"]
    pub theta: f64,
    #[doc = "!< [rad/s], wheel speed"]
    pub Omega: f64,
    #[doc = "!< [kg-m^2], spin axis gsHat rotor moment of inertia"]
    pub Js: f64,
    #[doc = "!< [kg-m^2], gtHat axis rotor moment of inertia"]
    pub Jt: f64,
    #[doc = "!< [kg-m^2], ggHat axis rotor moment of inertia"]
    pub Jg: f64,
    #[doc = "!< [kg-m], static imbalance"]
    pub U_s: f64,
    #[doc = "!< [kg-m^2], dynamic imbalance"]
    pub U_d: f64,
    #[doc = "!< [m], wheel center of mass offset from wheel frame origin"]
    pub d: f64,
    #[doc = "!< [kg-m^2], x-z inertia of wheel about wheel center in wheel frame (imbalance)"]
    pub J13: f64,
    #[doc = "!< [N-m], current motor torque"]
    pub u_current: f64,
    #[doc = "!< [N-m], friction Torque"]
    pub frictionTorque: f64,
    #[doc = "!< [N-m], Max torque"]
    pub u_max: f64,
    #[doc = "!< [N-m], Min torque"]
    pub u_min: f64,
    #[doc = "!< [N-m], Coulomb friction torque magnitude"]
    pub u_f: f64,
    #[doc = "!< [rad/s], max wheel speed"]
    pub Omega_max: f64,
    #[doc = "!< [N-m/s], maximum wheel power"]
    pub P_max: f64,
    #[doc = "!< [%] ratio relative to max speed value up to which the friction behaves linearly"]
    pub linearFrictionRatio: f64,
    #[doc = "!< [-], Type of imbalance model to use"]
    pub RWModel: RWModels,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWConfigLogMsg"][::core::mem::size_of::<RWConfigLogMsg>() - 248usize];
    ["Alignment of RWConfigLogMsg"]
        [::core::mem::align_of::<RWConfigLogMsg>() - 8usize];
    ["Offset of field: RWConfigLogMsg::rWB_B"]
        [::core::mem::offset_of!(RWConfigLogMsg, rWB_B) - 0usize];
    ["Offset of field: RWConfigLogMsg::gsHat_B"]
        [::core::mem::offset_of!(RWConfigLogMsg, gsHat_B) - 24usize];
    ["Offset of field: RWConfigLogMsg::w2Hat0_B"]
        [::core::mem::offset_of!(RWConfigLogMsg, w2Hat0_B) - 48usize];
    ["Offset of field: RWConfigLogMsg::w3Hat0_B"]
        [::core::mem::offset_of!(RWConfigLogMsg, w3Hat0_B) - 72usize];
    ["Offset of field: RWConfigLogMsg::mass"]
        [::core::mem::offset_of!(RWConfigLogMsg, mass) - 96usize];
    ["Offset of field: RWConfigLogMsg::theta"]
        [::core::mem::offset_of!(RWConfigLogMsg, theta) - 104usize];
    ["Offset of field: RWConfigLogMsg::Omega"]
        [::core::mem::offset_of!(RWConfigLogMsg, Omega) - 112usize];
    ["Offset of field: RWConfigLogMsg::Js"]
        [::core::mem::offset_of!(RWConfigLogMsg, Js) - 120usize];
    ["Offset of field: RWConfigLogMsg::Jt"]
        [::core::mem::offset_of!(RWConfigLogMsg, Jt) - 128usize];
    ["Offset of field: RWConfigLogMsg::Jg"]
        [::core::mem::offset_of!(RWConfigLogMsg, Jg) - 136usize];
    ["Offset of field: RWConfigLogMsg::U_s"]
        [::core::mem::offset_of!(RWConfigLogMsg, U_s) - 144usize];
    ["Offset of field: RWConfigLogMsg::U_d"]
        [::core::mem::offset_of!(RWConfigLogMsg, U_d) - 152usize];
    ["Offset of field: RWConfigLogMsg::d"]
        [::core::mem::offset_of!(RWConfigLogMsg, d) - 160usize];
    ["Offset of field: RWConfigLogMsg::J13"]
        [::core::mem::offset_of!(RWConfigLogMsg, J13) - 168usize];
    ["Offset of field: RWConfigLogMsg::u_current"]
        [::core::mem::offset_of!(RWConfigLogMsg, u_current) - 176usize];
    ["Offset of field: RWConfigLogMsg::frictionTorque"]
        [::core::mem::offset_of!(RWConfigLogMsg, frictionTorque) - 184usize];
    ["Offset of field: RWConfigLogMsg::u_max"]
        [::core::mem::offset_of!(RWConfigLogMsg, u_max) - 192usize];
    ["Offset of field: RWConfigLogMsg::u_min"]
        [::core::mem::offset_of!(RWConfigLogMsg, u_min) - 200usize];
    ["Offset of field: RWConfigLogMsg::u_f"]
        [::core::mem::offset_of!(RWConfigLogMsg, u_f) - 208usize];
    ["Offset of field: RWConfigLogMsg::Omega_max"]
        [::core::mem::offset_of!(RWConfigLogMsg, Omega_max) - 216usize];
    ["Offset of field: RWConfigLogMsg::P_max"]
        [::core::mem::offset_of!(RWConfigLogMsg, P_max) - 224usize];
    ["Offset of field: RWConfigLogMsg::linearFrictionRatio"]
        [::core::mem::offset_of!(RWConfigLogMsg, linearFrictionRatio) - 232usize];
    ["Offset of field: RWConfigLogMsg::RWModel"]
        [::core::mem::offset_of!(RWConfigLogMsg, RWModel) - 240usize];
};
impl Default for RWConfigLogMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWConfigLogMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: RWConfigLogMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut RWConfigLogMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWConfigLogMsg_C"][::core::mem::size_of::<RWConfigLogMsg_C>() - 296usize];
    ["Alignment of RWConfigLogMsg_C"][::core::mem::align_of::<RWConfigLogMsg_C>() - 8usize];
    ["Offset of field: RWConfigLogMsg_C::header"]
        [::core::mem::offset_of!(RWConfigLogMsg_C, header) - 0usize];
    ["Offset of field: RWConfigLogMsg_C::data"]
        [::core::mem::offset_of!(RWConfigLogMsg_C, data) - 32usize];
    ["Offset of field: RWConfigLogMsg_C::dataPointer"]
        [::core::mem::offset_of!(RWConfigLogMsg_C, dataPointer) - 280usize];
    ["Offset of field: RWConfigLogMsg_C::headerPointer"]
        [::core::mem::offset_of!(RWConfigLogMsg_C, headerPointer) - 288usize];
};
impl Default for RWConfigLogMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Message used to define an array of RW FSW configurations"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWConstellationMsg {
    #[doc = "!< [-] number of RWs"]
    pub numRW: ::core::ffi::c_int,
    #[doc = "!< [-] array of the reaction wheels"]
    pub reactionWheels: [RWConfigElementMsg; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWConstellationMsg"]
        [::core::mem::size_of::<RWConstellationMsg>() - 1448usize];
    ["Alignment of RWConstellationMsg"]
        [::core::mem::align_of::<RWConstellationMsg>() - 8usize];
    ["Offset of field: RWConstellationMsg::numRW"]
        [::core::mem::offset_of!(RWConstellationMsg, numRW) - 0usize];
    ["Offset of field: RWConstellationMsg::reactionWheels"]
        [::core::mem::offset_of!(RWConstellationMsg, reactionWheels) - 8usize];
};
impl Default for RWConstellationMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWConstellationMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: RWConstellationMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut RWConstellationMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWConstellationMsg_C"][::core::mem::size_of::<RWConstellationMsg_C>() - 1496usize];
    ["Alignment of RWConstellationMsg_C"][::core::mem::align_of::<RWConstellationMsg_C>() - 8usize];
    ["Offset of field: RWConstellationMsg_C::header"]
        [::core::mem::offset_of!(RWConstellationMsg_C, header) - 0usize];
    ["Offset of field: RWConstellationMsg_C::data"]
        [::core::mem::offset_of!(RWConstellationMsg_C, data) - 32usize];
    ["Offset of field: RWConstellationMsg_C::dataPointer"]
        [::core::mem::offset_of!(RWConstellationMsg_C, dataPointer) - 1480usize];
    ["Offset of field: RWConstellationMsg_C::headerPointer"]
        [::core::mem::offset_of!(RWConstellationMsg_C, headerPointer) - 1488usize];
};
impl Default for RWConstellationMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for reaction wheel speeds"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWSpeedMsg {
    #[doc = "!< r/s The current angular velocities of the RW wheel"]
    pub wheelSpeeds: [f64; 36usize],
    #[doc = "!< rad The current angle of the RW if jitter is enabled"]
    pub wheelThetas: [f64; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWSpeedMsg"][::core::mem::size_of::<RWSpeedMsg>() - 576usize];
    ["Alignment of RWSpeedMsg"][::core::mem::align_of::<RWSpeedMsg>() - 8usize];
    ["Offset of field: RWSpeedMsg::wheelSpeeds"]
        [::core::mem::offset_of!(RWSpeedMsg, wheelSpeeds) - 0usize];
    ["Offset of field: RWSpeedMsg::wheelThetas"]
        [::core::mem::offset_of!(RWSpeedMsg, wheelThetas) - 288usize];
};
impl Default for RWSpeedMsg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RWSpeedMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: RWSpeedMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut RWSpeedMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RWSpeedMsg_C"][::core::mem::size_of::<RWSpeedMsg_C>() - 624usize];
    ["Alignment of RWSpeedMsg_C"][::core::mem::align_of::<RWSpeedMsg_C>() - 8usize];
    ["Offset of field: RWSpeedMsg_C::header"]
        [::core::mem::offset_of!(RWSpeedMsg_C, header) - 0usize];
    ["Offset of field: RWSpeedMsg_C::data"]
        [::core::mem::offset_of!(RWSpeedMsg_C, data) - 32usize];
    ["Offset of field: RWSpeedMsg_C::dataPointer"]
        [::core::mem::offset_of!(RWSpeedMsg_C, dataPointer) - 608usize];
    ["Offset of field: RWSpeedMsg_C::headerPointer"]
        [::core::mem::offset_of!(RWSpeedMsg_C, headerPointer) - 616usize];
};
impl Default for RWSpeedMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Structure used to define the output definition for attitude guidance"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RateCmdMsg {
    #[doc = "!< [r/s]   Desired body rate relative to R"]
    pub omega_BastR_B: [f64; 3usize],
    #[doc = "!< [r/s^2] Body-frame derivative of omega_BastR_B"]
    pub omegap_BastR_B: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RateCmdMsg"][::core::mem::size_of::<RateCmdMsg>() - 48usize];
    ["Alignment of RateCmdMsg"][::core::mem::align_of::<RateCmdMsg>() - 8usize];
    ["Offset of field: RateCmdMsg::omega_BastR_B"]
        [::core::mem::offset_of!(RateCmdMsg, omega_BastR_B) - 0usize];
    ["Offset of field: RateCmdMsg::omegap_BastR_B"]
        [::core::mem::offset_of!(RateCmdMsg, omegap_BastR_B) - 24usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RateCmdMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: RateCmdMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut RateCmdMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RateCmdMsg_C"][::core::mem::size_of::<RateCmdMsg_C>() - 96usize];
    ["Alignment of RateCmdMsg_C"][::core::mem::align_of::<RateCmdMsg_C>() - 8usize];
    ["Offset of field: RateCmdMsg_C::header"]
        [::core::mem::offset_of!(RateCmdMsg_C, header) - 0usize];
    ["Offset of field: RateCmdMsg_C::data"]
        [::core::mem::offset_of!(RateCmdMsg_C, data) - 32usize];
    ["Offset of field: RateCmdMsg_C::dataPointer"]
        [::core::mem::offset_of!(RateCmdMsg_C, dataPointer) - 80usize];
    ["Offset of field: RateCmdMsg_C::headerPointer"]
        [::core::mem::offset_of!(RateCmdMsg_C, headerPointer) - 88usize];
};
impl Default for RateCmdMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! @brief Container for sim real time speed up/down factor."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct RealTimeFactorMsg {
    #[doc = "!< -- factor of real time at which the sim should run"]
    pub speedFactor: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RealTimeFactorMsg"]
        [::core::mem::size_of::<RealTimeFactorMsg>() - 8usize];
    ["Alignment of RealTimeFactorMsg"]
        [::core::mem::align_of::<RealTimeFactorMsg>() - 8usize];
    ["Offset of field: RealTimeFactorMsg::speedFactor"]
        [::core::mem::offset_of!(RealTimeFactorMsg, speedFactor) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RealTimeFactorMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: RealTimeFactorMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut RealTimeFactorMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RealTimeFactorMsg_C"][::core::mem::size_of::<RealTimeFactorMsg_C>() - 56usize];
    ["Alignment of RealTimeFactorMsg_C"][::core::mem::align_of::<RealTimeFactorMsg_C>() - 8usize];
    ["Offset of field: RealTimeFactorMsg_C::header"]
        [::core::mem::offset_of!(RealTimeFactorMsg_C, header) - 0usize];
    ["Offset of field: RealTimeFactorMsg_C::data"]
        [::core::mem::offset_of!(RealTimeFactorMsg_C, data) - 32usize];
    ["Offset of field: RealTimeFactorMsg_C::dataPointer"]
        [::core::mem::offset_of!(RealTimeFactorMsg_C, dataPointer) - 40usize];
    ["Offset of field: RealTimeFactorMsg_C::headerPointer"]
        [::core::mem::offset_of!(RealTimeFactorMsg_C, headerPointer) - 48usize];
};
impl Default for RealTimeFactorMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! @brief Container for the orbit reconfiguration burn information."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ReconfigBurnInfoMsg {
    #[doc = "!< 0:not scheduled yet, 1:not burned yet, 2:already burned, 3:skipped (combined with another burn)"]
    pub flag: ::core::ffi::c_int,
    #[doc = "!< [s] simulation time of the scheduled burn since module reset"]
    pub t: f64,
    #[doc = "!< thrust on duration time [s]"]
    pub thrustOnTime: f64,
    #[doc = "!< target attitude"]
    pub sigma_RN: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ReconfigBurnInfoMsg"]
        [::core::mem::size_of::<ReconfigBurnInfoMsg>() - 48usize];
    ["Alignment of ReconfigBurnInfoMsg"]
        [::core::mem::align_of::<ReconfigBurnInfoMsg>() - 8usize];
    ["Offset of field: ReconfigBurnInfoMsg::flag"]
        [::core::mem::offset_of!(ReconfigBurnInfoMsg, flag) - 0usize];
    ["Offset of field: ReconfigBurnInfoMsg::t"]
        [::core::mem::offset_of!(ReconfigBurnInfoMsg, t) - 8usize];
    ["Offset of field: ReconfigBurnInfoMsg::thrustOnTime"]
        [::core::mem::offset_of!(ReconfigBurnInfoMsg, thrustOnTime) - 16usize];
    ["Offset of field: ReconfigBurnInfoMsg::sigma_RN"]
        [::core::mem::offset_of!(ReconfigBurnInfoMsg, sigma_RN) - 24usize];
};
#[doc = "! @brief Container for the orbit reconfiguration burn information."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ReconfigBurnArrayInfoMsg {
    #[doc = "!< array of burn info messages"]
    pub burnArray: [ReconfigBurnInfoMsg; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ReconfigBurnArrayInfoMsg"]
        [::core::mem::size_of::<ReconfigBurnArrayInfoMsg>() - 144usize];
    ["Alignment of ReconfigBurnArrayInfoMsg"]
        [::core::mem::align_of::<ReconfigBurnArrayInfoMsg>() - 8usize];
    ["Offset of field: ReconfigBurnArrayInfoMsg::burnArray"]
        [::core::mem::offset_of!(ReconfigBurnArrayInfoMsg, burnArray) - 0usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReconfigBurnArrayInfoMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ReconfigBurnArrayInfoMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ReconfigBurnArrayInfoMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ReconfigBurnArrayInfoMsg_C"]
        [::core::mem::size_of::<ReconfigBurnArrayInfoMsg_C>() - 192usize];
    ["Alignment of ReconfigBurnArrayInfoMsg_C"]
        [::core::mem::align_of::<ReconfigBurnArrayInfoMsg_C>() - 8usize];
    ["Offset of field: ReconfigBurnArrayInfoMsg_C::header"]
        [::core::mem::offset_of!(ReconfigBurnArrayInfoMsg_C, header) - 0usize];
    ["Offset of field: ReconfigBurnArrayInfoMsg_C::data"]
        [::core::mem::offset_of!(ReconfigBurnArrayInfoMsg_C, data) - 32usize];
    ["Offset of field: ReconfigBurnArrayInfoMsg_C::dataPointer"]
        [::core::mem::offset_of!(ReconfigBurnArrayInfoMsg_C, dataPointer) - 176usize];
    ["Offset of field: ReconfigBurnArrayInfoMsg_C::headerPointer"]
        [::core::mem::offset_of!(ReconfigBurnArrayInfoMsg_C, headerPointer) - 184usize];
};
impl Default for ReconfigBurnArrayInfoMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReconfigBurnInfoMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: ReconfigBurnInfoMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut ReconfigBurnInfoMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ReconfigBurnInfoMsg_C"][::core::mem::size_of::<ReconfigBurnInfoMsg_C>() - 96usize];
    ["Alignment of ReconfigBurnInfoMsg_C"]
        [::core::mem::align_of::<ReconfigBurnInfoMsg_C>() - 8usize];
    ["Offset of field: ReconfigBurnInfoMsg_C::header"]
        [::core::mem::offset_of!(ReconfigBurnInfoMsg_C, header) - 0usize];
    ["Offset of field: ReconfigBurnInfoMsg_C::data"]
        [::core::mem::offset_of!(ReconfigBurnInfoMsg_C, data) - 32usize];
    ["Offset of field: ReconfigBurnInfoMsg_C::dataPointer"]
        [::core::mem::offset_of!(ReconfigBurnInfoMsg_C, dataPointer) - 80usize];
    ["Offset of field: ReconfigBurnInfoMsg_C::headerPointer"]
        [::core::mem::offset_of!(ReconfigBurnInfoMsg_C, headerPointer) - 88usize];
};
impl Default for ReconfigBurnInfoMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief This structure is used in the messaging system to communicate what the\nstate of the vehicle is currently."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SCEnergyMomentumMsg {
    #[doc = "!< [J] Total orbital kinetic energy"]
    pub spacecraftOrbEnergy: f64,
    #[doc = "!< [J] Total rotational energy"]
    pub spacecraftRotEnergy: f64,
    #[doc = "!< [kg m^2/s] Total orbital angular momentum about N in N frame components"]
    pub spacecraftOrbAngMomPntN_N: [f64; 3usize],
    #[doc = "!< [kg m^2/s] Total rotational angular momentum about C in N frame components"]
    pub spacecraftRotAngMomPntC_N: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCEnergyMomentumMsg"]
        [::core::mem::size_of::<SCEnergyMomentumMsg>() - 64usize];
    ["Alignment of SCEnergyMomentumMsg"]
        [::core::mem::align_of::<SCEnergyMomentumMsg>() - 8usize];
    ["Offset of field: SCEnergyMomentumMsg::spacecraftOrbEnergy"]
        [::core::mem::offset_of!(SCEnergyMomentumMsg, spacecraftOrbEnergy) - 0usize];
    ["Offset of field: SCEnergyMomentumMsg::spacecraftRotEnergy"]
        [::core::mem::offset_of!(SCEnergyMomentumMsg, spacecraftRotEnergy) - 8usize];
    ["Offset of field: SCEnergyMomentumMsg::spacecraftOrbAngMomPntN_N"]
        [::core::mem::offset_of!(SCEnergyMomentumMsg, spacecraftOrbAngMomPntN_N) - 16usize];
    ["Offset of field: SCEnergyMomentumMsg::spacecraftRotAngMomPntC_N"]
        [::core::mem::offset_of!(SCEnergyMomentumMsg, spacecraftRotAngMomPntC_N) - 40usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCEnergyMomentumMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: SCEnergyMomentumMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut SCEnergyMomentumMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCEnergyMomentumMsg_C"][::core::mem::size_of::<SCEnergyMomentumMsg_C>() - 112usize];
    ["Alignment of SCEnergyMomentumMsg_C"]
        [::core::mem::align_of::<SCEnergyMomentumMsg_C>() - 8usize];
    ["Offset of field: SCEnergyMomentumMsg_C::header"]
        [::core::mem::offset_of!(SCEnergyMomentumMsg_C, header) - 0usize];
    ["Offset of field: SCEnergyMomentumMsg_C::data"]
        [::core::mem::offset_of!(SCEnergyMomentumMsg_C, data) - 32usize];
    ["Offset of field: SCEnergyMomentumMsg_C::dataPointer"]
        [::core::mem::offset_of!(SCEnergyMomentumMsg_C, dataPointer) - 96usize];
    ["Offset of field: SCEnergyMomentumMsg_C::headerPointer"]
        [::core::mem::offset_of!(SCEnergyMomentumMsg_C, headerPointer) - 104usize];
};
impl Default for SCEnergyMomentumMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief This structure is used in the messaging system to communicate what the mass\nproperties of the vehicle are currently."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SCMassPropsMsg {
    #[doc = "!< kg   Current spacecraft mass"]
    pub massSC: f64,
    #[doc = "!< m    Center of mass of spacecraft with respect to point B"]
    pub c_B: [f64; 3usize],
    #[doc = "!< kgm2 Inertia tensor of spacecraft (relative to body)"]
    pub ISC_PntB_B: [[f64; 3usize]; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCMassPropsMsg"][::core::mem::size_of::<SCMassPropsMsg>() - 104usize];
    ["Alignment of SCMassPropsMsg"]
        [::core::mem::align_of::<SCMassPropsMsg>() - 8usize];
    ["Offset of field: SCMassPropsMsg::massSC"]
        [::core::mem::offset_of!(SCMassPropsMsg, massSC) - 0usize];
    ["Offset of field: SCMassPropsMsg::c_B"]
        [::core::mem::offset_of!(SCMassPropsMsg, c_B) - 8usize];
    ["Offset of field: SCMassPropsMsg::ISC_PntB_B"]
        [::core::mem::offset_of!(SCMassPropsMsg, ISC_PntB_B) - 32usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCMassPropsMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: SCMassPropsMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut SCMassPropsMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCMassPropsMsg_C"][::core::mem::size_of::<SCMassPropsMsg_C>() - 152usize];
    ["Alignment of SCMassPropsMsg_C"][::core::mem::align_of::<SCMassPropsMsg_C>() - 8usize];
    ["Offset of field: SCMassPropsMsg_C::header"]
        [::core::mem::offset_of!(SCMassPropsMsg_C, header) - 0usize];
    ["Offset of field: SCMassPropsMsg_C::data"]
        [::core::mem::offset_of!(SCMassPropsMsg_C, data) - 32usize];
    ["Offset of field: SCMassPropsMsg_C::dataPointer"]
        [::core::mem::offset_of!(SCMassPropsMsg_C, dataPointer) - 136usize];
    ["Offset of field: SCMassPropsMsg_C::headerPointer"]
        [::core::mem::offset_of!(SCMassPropsMsg_C, headerPointer) - 144usize];
};
impl Default for SCMassPropsMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief This structure is used in the messaging system to communicate what the\nstate of the vehicle is currently."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SCStatesMsg {
    #[doc = "!< m  Current position vector (inertial)"]
    pub r_BN_N: [f64; 3usize],
    #[doc = "!< m/s Current velocity vector (inertial)"]
    pub v_BN_N: [f64; 3usize],
    #[doc = "!< m  Current position of CoM vector (inertial)"]
    pub r_CN_N: [f64; 3usize],
    #[doc = "!< m/s Current velocity of CoM vector (inertial)"]
    pub v_CN_N: [f64; 3usize],
    #[doc = "!< -- Current MRPs (inertial)"]
    pub sigma_BN: [f64; 3usize],
    #[doc = "!< r/s Current angular velocity"]
    pub omega_BN_B: [f64; 3usize],
    #[doc = "!< r/s/s Current angular acceleration"]
    pub omegaDot_BN_B: [f64; 3usize],
    #[doc = "!< m/s Accumulated DV of center of mass in body frame coordinates"]
    pub TotalAccumDVBdy: [f64; 3usize],
    #[doc = "!< m/s Accumulated DV of body frame in body frame coordinates"]
    pub TotalAccumDV_BN_B: [f64; 3usize],
    #[doc = "!< m/s Accumulated DV of center of mass in inertial frame coordinates"]
    pub TotalAccumDV_CN_N: [f64; 3usize],
    #[doc = "!< m/s/s Current Spacecraft non-conservative body frame accel"]
    pub nonConservativeAccelpntB_B: [f64; 3usize],
    #[doc = "!< -- Number of times that MRPs have switched"]
    pub MRPSwitchCount: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCStatesMsg"][::core::mem::size_of::<SCStatesMsg>() - 272usize];
    ["Alignment of SCStatesMsg"][::core::mem::align_of::<SCStatesMsg>() - 8usize];
    ["Offset of field: SCStatesMsg::r_BN_N"]
        [::core::mem::offset_of!(SCStatesMsg, r_BN_N) - 0usize];
    ["Offset of field: SCStatesMsg::v_BN_N"]
        [::core::mem::offset_of!(SCStatesMsg, v_BN_N) - 24usize];
    ["Offset of field: SCStatesMsg::r_CN_N"]
        [::core::mem::offset_of!(SCStatesMsg, r_CN_N) - 48usize];
    ["Offset of field: SCStatesMsg::v_CN_N"]
        [::core::mem::offset_of!(SCStatesMsg, v_CN_N) - 72usize];
    ["Offset of field: SCStatesMsg::sigma_BN"]
        [::core::mem::offset_of!(SCStatesMsg, sigma_BN) - 96usize];
    ["Offset of field: SCStatesMsg::omega_BN_B"]
        [::core::mem::offset_of!(SCStatesMsg, omega_BN_B) - 120usize];
    ["Offset of field: SCStatesMsg::omegaDot_BN_B"]
        [::core::mem::offset_of!(SCStatesMsg, omegaDot_BN_B) - 144usize];
    ["Offset of field: SCStatesMsg::TotalAccumDVBdy"]
        [::core::mem::offset_of!(SCStatesMsg, TotalAccumDVBdy) - 168usize];
    ["Offset of field: SCStatesMsg::TotalAccumDV_BN_B"]
        [::core::mem::offset_of!(SCStatesMsg, TotalAccumDV_BN_B) - 192usize];
    ["Offset of field: SCStatesMsg::TotalAccumDV_CN_N"]
        [::core::mem::offset_of!(SCStatesMsg, TotalAccumDV_CN_N) - 216usize];
    ["Offset of field: SCStatesMsg::nonConservativeAccelpntB_B"]
        [::core::mem::offset_of!(SCStatesMsg, nonConservativeAccelpntB_B) - 240usize];
    ["Offset of field: SCStatesMsg::MRPSwitchCount"]
        [::core::mem::offset_of!(SCStatesMsg, MRPSwitchCount) - 264usize];
};
#[doc = "! structure definition"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCStatesMsg_C {
    #[doc = "!< message header, zero'd on construction"]
    pub header: MsgHeader,
    #[doc = "!< message copy, zero'd on construction"]
    pub data: SCStatesMsg,
    #[doc = "!< pointer to message"]
    pub dataPointer: *mut SCStatesMsg,
    #[doc = "!< pointer to message header"]
    pub headerPointer: *mut MsgHeader,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCStatesMsg_C"][::core::mem::size_of::<SCStatesMsg_C>() - 320usize];
    ["Alignment of SCStatesMsg_C"][::core::mem::align_of::<SCStatesMsg_C>() - 8usize];
    ["Offset of field: SCStatesMsg_C::header"]
        [::core::mem::offset_of!(SCStatesMsg_C, header) - 0usize];
    ["Offset of field: SCStatesMsg_C::data"]
        [::core::mem::offset_of!(SCStatesMsg_C, data) - 32usize];
    ["Offset of field: SCStatesMsg_C::dataPointer"]
        [::core::mem::offset_of!(SCStatesMsg_C, dataPointer) - 304usize];
    ["Offset of field: SCStatesMsg_C::headerPointer"]
        [::core::mem::offset_of!(SCStatesMsg_C, headerPointer) - 312usize];
};
impl Default for SCStatesMsg_C {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Output structure for ST attitude measurement in vehicle body frame"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct STAttMsg {
    #[doc = "!< [ns] Vehicle time code associated with measurement"]
    pub timeTag: u64,
    #[doc = "!< [-] MRP estimate of inertial to body transformation"]
    pub MRP_BdyInrtl: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of STAttMsg"][::core::mem::size_of::<STAttMsg>() - 32usize];
    ["Alignment of STAttMsg"][::core::mem::align_of::<STAttMsg>() - 8usize];
    ["Offset of field: STAttMsg::timeTag"]
        [::core::mem::offset_of!(STAttMsg, timeTag) - 0usize];
